-------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/yuehenghu/Desktop/RP/Stata_RP/time-varying coefficient.log
  log type:  text
 opened on:  21 Oct 2022, 08:14:44

. 
. // import the data and convert to dta format
. import excel "/Users/yuehenghu/Desktop/RP/Stata_RP/all_09151.xlsx", sheet("Sheet4") first
> row clear
(9 vars, 690 obs)

. 
. //rename E co2_c //  CO2 emission, per capita
. gen lCO2pp_c=log(CO2pp) // dependent variable. natural log of CO2 emission, per capita

. rename lCO2pp_c lco2_c

. 
. //rename F gdp_c // explanatory variable. natural log of gdp
. gen lGDPpp_c=log(GDPpp) // explanatory variable. natural log of gdp

. rename lGDPpp_c lgdp_c

. 
. gen lGDPpp_c2=(lgdp_c)^2

. rename lGDPpp_c2 lgdp_c2

. 
. gen techonology_c=Technology

. gen fossil_fuel_prod_c=ffindex

. 
. tsset Number Year, yearly

Panel variable: Number (strongly balanced)
 Time variable: Year, 1997 to 2019
         Delta: 1 year

. 
. describe 

Contains data
 Observations:           690                  
    Variables:            14                  
-------------------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------------------
abbreviation    str4    %9s                   abbreviation
Number          byte    %10.0g                Number
Province        str14   %14s                  Province
Year            int     %ty                   Year
CO2pp           double  %10.0g                CO2pp
GDPpp           double  %10.0g                GDPpp
ffindex         double  %10.0g                ffindex
Technology      double  %10.0g                Technology
Region          str2    %9s                   Region
lco2_c          float   %9.0g                 
lgdp_c          float   %9.0g                 
lgdp_c2         float   %9.0g                 
techonology_c   float   %9.0g                 
fossil_fuel_p~c float   %9.0g                 
-------------------------------------------------------------------------------------------
Sorted by: Number  Year
     Note: Dataset has changed since last saved.

. 
. // save the descriptive statistics
. tabstat lco2_c lgdp_c lgdp_c2 fossil_fuel_prod_c techonology_c, statistics(n mean sd min 
> max range)

   Stats |    lco2_c    lgdp_c   lgdp_c2  fossil~c  techon~c
---------+--------------------------------------------------
       N |       690       690       690       690       690
    Mean |    1.5764  3.653591   14.4682  29.41215  17.53148
      SD |  .7987733  1.058816  7.635077  40.84692  14.75217
     Min | -2.073829  1.175945  1.382846  .0346021  .8803293
     Max |  3.883919   5.90334  34.84943   297.579  104.8126
   Range |  5.957748  4.727396  33.46658  297.5444  103.9323
------------------------------------------------------------

. logout, save(mytable) 

. logout, save(mytable) world
option world not allowed
r(198);

end of do-file

r(198);

. do "/var/folders/cf/w4s5yp7d4gn_3pr55b23tmbr0000gn/T//SD01083.000000"

. logout, save(mytable) word

mytable.rtf
dir

. 
end of do-file

. do "/var/folders/cf/w4s5yp7d4gn_3pr55b23tmbr0000gn/T//SD01083.000000"

. 
. // Panel unit root test
. // LLC: 
. // without trend component, with FE only
. xtunitroot llc lco2_c, demean lags(bic 5)

Levin–Lin–Chu unit-root test for lco2_c
---------------------------------------
H0: Panels contain unit roots               Number of panels  =     30
Ha: Panels are stationary                   Number of periods =     23

AR parameter: Common                        Asymptotics: N/T -> 0
Panel means:  Included
Time trend:   Not included                  Cross-sectional means removed

ADF regressions: 1.13 lags average (chosen by BIC)
LR variance:     Bartlett kernel, 9.00 lags average (chosen by LLC)
------------------------------------------------------------------------------
                    Statistic      p-value
------------------------------------------------------------------------------
 Unadjusted t       -21.4294
 Adjusted t*        -19.5280        0.0000
------------------------------------------------------------------------------

. xtunitroot llc lgdp_c, demean lags(bic 5)

Levin–Lin–Chu unit-root test for lgdp_c
---------------------------------------
H0: Panels contain unit roots               Number of panels  =     30
Ha: Panels are stationary                   Number of periods =     23

AR parameter: Common                        Asymptotics: N/T -> 0
Panel means:  Included
Time trend:   Not included                  Cross-sectional means removed

ADF regressions: 1.20 lags average (chosen by BIC)
LR variance:     Bartlett kernel, 9.00 lags average (chosen by LLC)
------------------------------------------------------------------------------
                    Statistic      p-value
------------------------------------------------------------------------------
 Unadjusted t        -2.8489
 Adjusted t*          1.2136        0.8875
------------------------------------------------------------------------------

. xtunitroot llc lgdp_c2, demean lags(bic 5)

Levin–Lin–Chu unit-root test for lgdp_c2
----------------------------------------
H0: Panels contain unit roots               Number of panels  =     30
Ha: Panels are stationary                   Number of periods =     23

AR parameter: Common                        Asymptotics: N/T -> 0
Panel means:  Included
Time trend:   Not included                  Cross-sectional means removed

ADF regressions: 0.83 lags average (chosen by BIC)
LR variance:     Bartlett kernel, 9.00 lags average (chosen by LLC)
------------------------------------------------------------------------------
                    Statistic      p-value
------------------------------------------------------------------------------
 Unadjusted t        -4.1892
 Adjusted t*          0.6763        0.7506
------------------------------------------------------------------------------

. xtunitroot llc fossil_fuel_prod_c, demean lags(bic 5)

Levin–Lin–Chu unit-root test for fossil_fuel_prod_c
---------------------------------------------------
H0: Panels contain unit roots               Number of panels  =     30
Ha: Panels are stationary                   Number of periods =     23

AR parameter: Common                        Asymptotics: N/T -> 0
Panel means:  Included
Time trend:   Not included                  Cross-sectional means removed

ADF regressions: 0.87 lags average (chosen by BIC)
LR variance:     Bartlett kernel, 9.00 lags average (chosen by LLC)
------------------------------------------------------------------------------
                    Statistic      p-value
------------------------------------------------------------------------------
 Unadjusted t       -12.6087
 Adjusted t*         -9.2564        0.0000
------------------------------------------------------------------------------

. xtunitroot llc techonology_c, demean lags(bic 5)

Levin–Lin–Chu unit-root test for techonology_c
----------------------------------------------
H0: Panels contain unit roots               Number of panels  =     30
Ha: Panels are stationary                   Number of periods =     23

AR parameter: Common                        Asymptotics: N/T -> 0
Panel means:  Included
Time trend:   Not included                  Cross-sectional means removed

ADF regressions: 1.97 lags average (chosen by BIC)
LR variance:     Bartlett kernel, 9.00 lags average (chosen by LLC)
------------------------------------------------------------------------------
                    Statistic      p-value
------------------------------------------------------------------------------
 Unadjusted t       -10.4966
 Adjusted t*         -3.8897        0.0001
------------------------------------------------------------------------------

. // with trend component, with FE only
. xtunitroot llc lco2_c, trend demean lags(bic 5)

Levin–Lin–Chu unit-root test for lco2_c
---------------------------------------
H0: Panels contain unit roots               Number of panels  =     30
Ha: Panels are stationary                   Number of periods =     23

AR parameter: Common                        Asymptotics: N/T -> 0
Panel means:  Included
Time trend:   Included                      Cross-sectional means removed

ADF regressions: 1.40 lags average (chosen by BIC)
LR variance:     Bartlett kernel, 9.00 lags average (chosen by LLC)
------------------------------------------------------------------------------
                    Statistic      p-value
------------------------------------------------------------------------------
 Unadjusted t       -11.4231
 Adjusted t*          0.8816        0.8110
------------------------------------------------------------------------------

. xtunitroot llc lgdp_c, trend demean lags(bic 5)

Levin–Lin–Chu unit-root test for lgdp_c
---------------------------------------
H0: Panels contain unit roots               Number of panels  =     30
Ha: Panels are stationary                   Number of periods =     23

AR parameter: Common                        Asymptotics: N/T -> 0
Panel means:  Included
Time trend:   Included                      Cross-sectional means removed

ADF regressions: 1.20 lags average (chosen by BIC)
LR variance:     Bartlett kernel, 9.00 lags average (chosen by LLC)
------------------------------------------------------------------------------
                    Statistic      p-value
------------------------------------------------------------------------------
 Unadjusted t       -12.3279
 Adjusted t*         -3.5011        0.0002
------------------------------------------------------------------------------

. xtunitroot llc lgdp_c2, trend demean lags(bic 5)

Levin–Lin–Chu unit-root test for lgdp_c2
----------------------------------------
H0: Panels contain unit roots               Number of panels  =     30
Ha: Panels are stationary                   Number of periods =     23

AR parameter: Common                        Asymptotics: N/T -> 0
Panel means:  Included
Time trend:   Included                      Cross-sectional means removed

ADF regressions: 1.13 lags average (chosen by BIC)
LR variance:     Bartlett kernel, 9.00 lags average (chosen by LLC)
------------------------------------------------------------------------------
                    Statistic      p-value
------------------------------------------------------------------------------
 Unadjusted t        -8.3574
 Adjusted t*         -2.0601        0.0197
------------------------------------------------------------------------------

. xtunitroot llc fossil_fuel_prod_c, trend demean lags(bic 5)

Levin–Lin–Chu unit-root test for fossil_fuel_prod_c
---------------------------------------------------
H0: Panels contain unit roots               Number of panels  =     30
Ha: Panels are stationary                   Number of periods =     23

AR parameter: Common                        Asymptotics: N/T -> 0
Panel means:  Included
Time trend:   Included                      Cross-sectional means removed

ADF regressions: 1.07 lags average (chosen by BIC)
LR variance:     Bartlett kernel, 9.00 lags average (chosen by LLC)
------------------------------------------------------------------------------
                    Statistic      p-value
------------------------------------------------------------------------------
 Unadjusted t       -21.2792
 Adjusted t*        -11.8999        0.0000
------------------------------------------------------------------------------

. xtunitroot llc techonology_c, trend demean lags(bic 5)

Levin–Lin–Chu unit-root test for techonology_c
----------------------------------------------
H0: Panels contain unit roots               Number of panels  =     30
Ha: Panels are stationary                   Number of periods =     23

AR parameter: Common                        Asymptotics: N/T -> 0
Panel means:  Included
Time trend:   Included                      Cross-sectional means removed

ADF regressions: 1.60 lags average (chosen by BIC)
LR variance:     Bartlett kernel, 9.00 lags average (chosen by LLC)
------------------------------------------------------------------------------
                    Statistic      p-value
------------------------------------------------------------------------------
 Unadjusted t       -17.0695
 Adjusted t*         -1.6289        0.0517
------------------------------------------------------------------------------

. 
. // IPS: 
. // without trend component, with FE only
. xtunitroot ips lco2_c, lags(bic 5) demean

Im–Pesaran–Shin unit-root test for lco2_c
-----------------------------------------
H0: All panels contain unit roots           Number of panels  =     30
Ha: Some panels are stationary              Number of periods =     23

AR parameter: Panel-specific                Asymptotics: T,N -> Infinity
Panel means:  Included                                        sequentially
Time trend:   Not included                  Cross-sectional means removed

ADF regressions: 1.13 lags average (chosen by BIC)
------------------------------------------------------------------------------
                    Statistic      p-value
------------------------------------------------------------------------------
 W-t-bar             -8.1155        0.0000
------------------------------------------------------------------------------

. xtunitroot ips lgdp_c, demean lags(bic 5)

Im–Pesaran–Shin unit-root test for lgdp_c
-----------------------------------------
H0: All panels contain unit roots           Number of panels  =     30
Ha: Some panels are stationary              Number of periods =     23

AR parameter: Panel-specific                Asymptotics: T,N -> Infinity
Panel means:  Included                                        sequentially
Time trend:   Not included                  Cross-sectional means removed

ADF regressions: 1.20 lags average (chosen by BIC)
------------------------------------------------------------------------------
                    Statistic      p-value
------------------------------------------------------------------------------
 W-t-bar              4.0297        1.0000
------------------------------------------------------------------------------

. xtunitroot ips lgdp_c2, demean lags(bic 5)

Im–Pesaran–Shin unit-root test for lgdp_c2
------------------------------------------
H0: All panels contain unit roots           Number of panels  =     30
Ha: Some panels are stationary              Number of periods =     23

AR parameter: Panel-specific                Asymptotics: T,N -> Infinity
Panel means:  Included                                        sequentially
Time trend:   Not included                  Cross-sectional means removed

ADF regressions: 0.83 lags average (chosen by BIC)
------------------------------------------------------------------------------
                    Statistic      p-value
------------------------------------------------------------------------------
 W-t-bar              2.1904        0.9858
------------------------------------------------------------------------------

. xtunitroot ips fossil_fuel_prod_c, demean lags(bic 5)

Im–Pesaran–Shin unit-root test for fossil_fuel_prod_c
-----------------------------------------------------
H0: All panels contain unit roots           Number of panels  =     30
Ha: Some panels are stationary              Number of periods =     23

AR parameter: Panel-specific                Asymptotics: T,N -> Infinity
Panel means:  Included                                        sequentially
Time trend:   Not included                  Cross-sectional means removed

ADF regressions: 0.87 lags average (chosen by BIC)
------------------------------------------------------------------------------
                    Statistic      p-value
------------------------------------------------------------------------------
 W-t-bar             -4.7227        0.0000
------------------------------------------------------------------------------

. xtunitroot ips techonology_c, demean lags(bic 5)

Im–Pesaran–Shin unit-root test for techonology_c
------------------------------------------------
H0: All panels contain unit roots           Number of panels  =     30
Ha: Some panels are stationary              Number of periods =     23

AR parameter: Panel-specific                Asymptotics: T,N -> Infinity
Panel means:  Included                                        sequentially
Time trend:   Not included                  Cross-sectional means removed

ADF regressions: 1.97 lags average (chosen by BIC)
------------------------------------------------------------------------------
                    Statistic      p-value
------------------------------------------------------------------------------
 W-t-bar             -3.3585        0.0004
------------------------------------------------------------------------------

. // with trend component, with FE only
. xtunitroot ips lco2_c, trend demean lags(bic 5)

Im–Pesaran–Shin unit-root test for lco2_c
-----------------------------------------
H0: All panels contain unit roots           Number of panels  =     30
Ha: Some panels are stationary              Number of periods =     23

AR parameter: Panel-specific                Asymptotics: T,N -> Infinity
Panel means:  Included                                        sequentially
Time trend:   Included                      Cross-sectional means removed

ADF regressions: 1.40 lags average (chosen by BIC)
------------------------------------------------------------------------------
                    Statistic      p-value
------------------------------------------------------------------------------
 W-t-bar             -0.9521        0.1705
------------------------------------------------------------------------------

. xtunitroot ips lgdp_c, trend demean lags(bic 5)

Im–Pesaran–Shin unit-root test for lgdp_c
-----------------------------------------
H0: All panels contain unit roots           Number of panels  =     30
Ha: Some panels are stationary              Number of periods =     23

AR parameter: Panel-specific                Asymptotics: T,N -> Infinity
Panel means:  Included                                        sequentially
Time trend:   Included                      Cross-sectional means removed

ADF regressions: 1.20 lags average (chosen by BIC)
------------------------------------------------------------------------------
                    Statistic      p-value
------------------------------------------------------------------------------
 W-t-bar             -1.3790        0.0839
------------------------------------------------------------------------------

. xtunitroot ips lgdp_c2, trend demean lags(bic 5)

Im–Pesaran–Shin unit-root test for lgdp_c2
------------------------------------------
H0: All panels contain unit roots           Number of panels  =     30
Ha: Some panels are stationary              Number of periods =     23

AR parameter: Panel-specific                Asymptotics: T,N -> Infinity
Panel means:  Included                                        sequentially
Time trend:   Included                      Cross-sectional means removed

ADF regressions: 1.13 lags average (chosen by BIC)
------------------------------------------------------------------------------
                    Statistic      p-value
------------------------------------------------------------------------------
 W-t-bar              2.8795        0.9980
------------------------------------------------------------------------------

. xtunitroot ips fossil_fuel_prod_c, trend demean lags(bic 5)

Im–Pesaran–Shin unit-root test for fossil_fuel_prod_c
-----------------------------------------------------
H0: All panels contain unit roots           Number of panels  =     30
Ha: Some panels are stationary              Number of periods =     23

AR parameter: Panel-specific                Asymptotics: T,N -> Infinity
Panel means:  Included                                        sequentially
Time trend:   Included                      Cross-sectional means removed

ADF regressions: 1.07 lags average (chosen by BIC)
------------------------------------------------------------------------------
                    Statistic      p-value
------------------------------------------------------------------------------
 W-t-bar             -6.1673        0.0000
------------------------------------------------------------------------------

. xtunitroot ips techonology_c, trend demean lags(bic 5)

Im–Pesaran–Shin unit-root test for techonology_c
------------------------------------------------
H0: All panels contain unit roots           Number of panels  =     30
Ha: Some panels are stationary              Number of periods =     23

AR parameter: Panel-specific                Asymptotics: T,N -> Infinity
Panel means:  Included                                        sequentially
Time trend:   Included                      Cross-sectional means removed

ADF regressions: 1.60 lags average (chosen by BIC)
------------------------------------------------------------------------------
                    Statistic      p-value
------------------------------------------------------------------------------
 W-t-bar             -6.7359        0.0000
------------------------------------------------------------------------------

. 
. 
. // Panel cointegration (KAO) test:
. xtcointtest kao lco2_c lgdp_c lgdp_c2 fossil_fuel_prod_c techonology_c

Kao test for cointegration
--------------------------
H0: No cointegration                        Number of panels       =     30
Ha: All panels are cointegrated             Number of periods      =     21

Cointegrating vector: Same
Panel means:          Included              Kernel:           Bartlett
Time trend:           Not included          Lags:             0.97 (Newey–West)
AR parameter:         Same                  Augmented lags:   1 
------------------------------------------------------------------------------
                                            Statistic         p-value
------------------------------------------------------------------------------
 Modified Dickey–Fuller t                    -4.0081          0.0000
 Dickey–Fuller t                             -4.0256          0.0000
 Augmented Dickey–Fuller t                    0.2883          0.3866
 Unadjusted modified Dickey–Fuller t         -4.0081          0.0000
 Unadjusted Dickey–Fuller t                  -4.0256          0.0000
------------------------------------------------------------------------------

. 
. 
. // fit the time-varying model, 7 regions seperately
. // local linear method.
. // Kernel: Epanechnikov Kernel
. // Bandwidth (bw): selected by a data driven rule of thumb bandwidth that corresponds to 
> the Epanechnikov Kernel.
. 
. 
. // Central China (C)
. xtnptimevar lco2_c lgdp_c lgdp_c2 fossil_fuel_prod_c techonology_c if Year<2017 & Region=
> ="C", stub(coefsc) alle bootstrap bootoptions(reps(100) seed(28845080)  level(68)) matsiz
> e(800) forcereg title(trend function, lgdp, lgdp2, ff, tech) saving("/Users/yuehenghu/Des
> ktop/RP/Stata_RP/mystatagraphs")

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     1
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)
(file coefsc_bootds.dta not found)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  60
                                                           Replications  = 100

                                  (Replications based on 3 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |  -1.723037   .9370502    -1.84   0.066    -2.654894   -.7911803
        1998 |  -1.951969   .8946519    -2.18   0.029    -2.841663   -1.062275
        1999 |  -2.180901   .8569226    -2.55   0.011    -3.033074   -1.328728
        2000 |  -2.409833   .8245034    -2.92   0.003    -3.229767   -1.589899
        2001 |  -2.638765   .7980419    -3.31   0.001    -3.432384   -1.845146
        2002 |  -2.867697   .7781459    -3.69   0.000     -3.64153   -2.093864
        2003 |  -3.096629   .7653277    -4.05   0.000    -3.857715   -2.335543
        2004 |  -3.325561   .7599456    -4.38   0.000    -4.081295   -2.569827
        2005 |  -3.554493    .762157    -4.66   0.000    -4.312426    -2.79656
        2006 |  -3.783425   .7718968    -4.90   0.000    -4.551043   -3.015806
        2007 |  -4.012357   .7888861    -5.09   0.000    -4.796871   -3.227843
        2008 |  -4.241289   .8126704    -5.22   0.000    -5.049455   -3.433122
        2009 |  -4.470221   .8426746    -5.30   0.000    -5.308225   -3.632216
        2010 |  -4.699153   .8782613    -5.35   0.000    -5.572546   -3.825759
        2011 |  -4.928085   .9187822    -5.36   0.000    -5.841775   -4.014394
        2012 |  -5.157017   .9636149    -5.35   0.000    -6.115291   -4.198742
        2013 |  -5.385949   1.012187    -5.32   0.000    -6.392526   -4.379371
        2014 |  -5.614881   1.063986    -5.28   0.000     -6.67297   -4.556792
        2015 |  -5.843813   1.118564    -5.22   0.000    -6.956177   -4.731448
        2016 |  -6.072745   1.175533    -5.17   0.000    -7.241763   -4.903726
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     2
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  60
                                                           Replications  = 100

                                  (Replications based on 3 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |    .575442   .6163926     0.93   0.351    -.0375345    1.188418
        1998 |   .6729474   .5759185     1.17   0.243     .1002207    1.245674
        1999 |   .7704529   .5375416     1.43   0.152     .2358904    1.305015
        2000 |   .8679584   .5017434     1.73   0.084     .3689957    1.366921
        2001 |   .9654639   .4691145     2.06   0.040     .4989493    1.431979
        2002 |   1.062969   .4403601     2.41   0.016     .6250498    1.500889
        2003 |   1.160475   .4162838     2.79   0.005     .7464982    1.574452
        2004 |    1.25798   .3977359     3.16   0.002     .8624488    1.653512
        2005 |   1.355486   .3855154     3.52   0.000     .9721071    1.738865
        2006 |   1.452991   .3802328     3.82   0.000     1.074866    1.831117
        2007 |   1.550497   .3821759     4.06   0.000     1.170439    1.930555
        2008 |   1.648002    .391237     4.21   0.000     1.258934    2.037071
        2009 |   1.745508    .406941     4.29   0.000     1.340822    2.150194
        2010 |   1.843014   .4285581     4.30   0.000     1.416831    2.269197
        2011 |   1.940519   .4552469     4.26   0.000     1.487795    2.393243
        2012 |   2.038025   .4861728     4.19   0.000     1.554546    2.521503
        2013 |    2.13553   .5205812     4.10   0.000     1.617834    2.653226
        2014 |   2.233036   .5578281     4.00   0.000     1.678299    2.787772
        2015 |   2.330541   .5973827     3.90   0.000     1.736469    2.924613
        2016 |   2.428047   .6388166     3.80   0.000     1.792771    3.063323
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     3
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  60
                                                           Replications  = 100

                                  (Replications based on 3 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |   .0280981   .0728957     0.39   0.700    -.0443936    .1005898
        1998 |   .0161017   .0679861     0.24   0.813    -.0515076    .0837111
        1999 |   .0041054   .0634987     0.06   0.948    -.0590414    .0672522
        2000 |   -.007891    .059529    -0.13   0.895    -.0670901    .0513081
        2001 |  -.0198873   .0561869    -0.35   0.723    -.0757629    .0359882
        2002 |  -.0318837     .05359    -0.59   0.552    -.0851767    .0214093
        2003 |    -.04388   .0518502    -0.85   0.397    -.0954429    .0076828
        2004 |  -.0558764   .0510554    -1.09   0.274    -.1066489   -.0051039
        2005 |  -.0678728   .0512495    -1.32   0.185    -.1188382   -.0169073
        2006 |  -.0798691   .0524215    -1.52   0.128    -.1320001   -.0277382
        2007 |  -.0918655   .0545084    -1.69   0.092    -.1460718   -.0376592
        2008 |  -.1038619   .0574104    -1.81   0.070    -.1609541   -.0467696
        2009 |  -.1158582   .0610115    -1.90   0.058    -.1765316   -.0551849
        2010 |  -.1278546   .0651958    -1.96   0.050     -.192689   -.0630201
        2011 |  -.1398509   .0698586    -2.00   0.045    -.2093224   -.0703795
        2012 |  -.1518473   .0749107    -2.03   0.043    -.2263428   -.0773518
        2013 |  -.1638437   .0802785    -2.04   0.041    -.2436773   -.0840101
        2014 |    -.17584    .085903    -2.05   0.041    -.2612669   -.0904132
        2015 |  -.1878364   .0917368    -2.05   0.041    -.2790648    -.096608
        2016 |  -.1998328   .0977426    -2.04   0.041    -.2970337   -.1026319
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     4
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  60
                                                           Replications  = 100

                                  (Replications based on 3 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |  -.0025845   .0015159    -1.70   0.088    -.0040921    -.001077
        1998 |  -.0019116   .0016728    -1.14   0.253    -.0035751    -.000248
        1999 |  -.0012386   .0018651    -0.66   0.507    -.0030934    .0006162
        2000 |  -.0005656   .0020832    -0.27   0.786    -.0026373     .001506
        2001 |   .0001073   .0023196     0.05   0.963    -.0021994    .0024141
        2002 |   .0007803   .0025694     0.30   0.761    -.0017749    .0033355
        2003 |   .0014533    .002829     0.51   0.607    -.0013601    .0042666
        2004 |   .0021262    .003096     0.69   0.492    -.0009526    .0052051
        2005 |   .0027992   .0033686     0.83   0.406    -.0005507    .0061491
        2006 |   .0034722   .0036455     0.95   0.341    -.0001532    .0070975
        2007 |   .0041451   .0039259     1.06   0.291      .000241    .0080492
        2008 |   .0048181    .004209     1.14   0.252     .0006325    .0090037
        2009 |   .0054911   .0044943     1.22   0.222     .0010217    .0099604
        2010 |    .006164   .0047814     1.29   0.197     .0014091     .010919
        2011 |    .006837   .0050701     1.35   0.177      .001795     .011879
        2012 |     .00751     .00536     1.40   0.161     .0021796    .0128403
        2013 |   .0081829    .005651     1.45   0.148     .0025632    .0138026
        2014 |   .0088559    .005943     1.49   0.136     .0029459    .0147659
        2015 |   .0095289   .0062357     1.53   0.126     .0033277      .01573
        2016 |   .0102018   .0065291     1.56   0.118     .0037089    .0166947
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     5
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  60
                                                           Replications  = 100

                                  (Replications based on 3 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |    .043114   .0046174     9.34   0.000     .0385221    .0477058
        1998 |   .0473621   .0042054    11.26   0.000     .0431799    .0515442
        1999 |   .0516101   .0038823    13.29   0.000     .0477494    .0554709
        2000 |   .0558582   .0036715    15.21   0.000      .052207    .0595094
        2001 |   .0601063    .003593    16.73   0.000     .0565333    .0636794
        2002 |   .0643544   .0036552    17.61   0.000     .0607195    .0679893
        2003 |   .0686025   .0038513    17.81   0.000     .0647726    .0724324
        2004 |   .0728506   .0041624    17.50   0.000     .0687112    .0769899
        2005 |   .0770987   .0045651    16.89   0.000     .0725588    .0816385
        2006 |   .0813467   .0050375    16.15   0.000     .0763371    .0863564
        2007 |   .0855948   .0055619    15.39   0.000     .0800638    .0911259
        2008 |   .0898429   .0061248    14.67   0.000     .0837521    .0959338
        2009 |    .094091   .0067167    14.01   0.000     .0874116    .1007704
        2010 |   .0983391   .0073304    13.42   0.000     .0910493    .1056289
        2011 |   .1025872   .0079611    12.89   0.000     .0946702    .1105041
        2012 |   .1068353   .0086048    12.42   0.000     .0982781    .1153924
        2013 |   .1110834    .009259    12.00   0.000     .1018757     .120291
        2014 |   .1153314   .0099215    11.62   0.000     .1054649     .125198
        2015 |   .1195795   .0105908    11.29   0.000     .1090474    .1301116
        2016 |   .1238276   .0112656    10.99   0.000     .1126244    .1350308
------------------------------------------------------------------------------

. ereturn list

scalars:
                  e(N) =  3
                  e(T) =  20
             e(bwidth) =  583.3138784026415
                  e(k) =  4
                 e(NT) =  60
              e(g_avg) =  20
              e(g_min) =  20
              e(g_max) =  20

macros:
            e(cmdline) : "xtnptimevar lco2_c lgdp_c lgdp_c2 fossil_fuel_prod_c techonol.."
                e(cmd) : "xtnptimevar"
   e(seq_coefsc_efftv) : "coefsc_tvprime"
  e(seq_coefsc_ciul_5) : "coefsc_ciul_5"
  e(seq_coefsc_cill_5) : "coefsc_cill_5"
    e(seq_coefsc_se_5) : "coefsc_se_5"
     e(seq_coefsc_b_5) : "coefsc_b_5"
  e(seq_coefsc_ciul_4) : "coefsc_ciul_4"
  e(seq_coefsc_cill_4) : "coefsc_cill_4"
    e(seq_coefsc_se_4) : "coefsc_se_4"
     e(seq_coefsc_b_4) : "coefsc_b_4"
  e(seq_coefsc_ciul_3) : "coefsc_ciul_3"
  e(seq_coefsc_cill_3) : "coefsc_cill_3"
    e(seq_coefsc_se_3) : "coefsc_se_3"
     e(seq_coefsc_b_3) : "coefsc_b_3"
  e(seq_coefsc_ciul_2) : "coefsc_ciul_2"
  e(seq_coefsc_cill_2) : "coefsc_cill_2"
    e(seq_coefsc_se_2) : "coefsc_se_2"
     e(seq_coefsc_b_2) : "coefsc_b_2"
  e(seq_coefsc_ciul_1) : "coefsc_ciul_1"
  e(seq_coefsc_cill_1) : "coefsc_cill_1"
    e(seq_coefsc_se_1) : "coefsc_se_1"
     e(seq_coefsc_b_1) : "coefsc_b_1"
            e(vcetype) : "Bootstrap"
            e(cluster) : "Number"
               e(seed) : "XAA0000000001b824187be0e3f6c93e403990dfc65b426511daebaecd1252.."
           e(clustvar) : "Number"
            e(stubloc) : "coefsc"
           e(nombreco) : "5"
               e(ivar) : "Number"
             e(depvar) : "lco2_c"

functions:
             e(sample)   

. describe coefsc_*

Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------------------
coefsc_1        double  %10.0g                Coefficient 1, original
coefsc_2        double  %10.0g                Coefficient 2, original
coefsc_3        double  %10.0g                Coefficient 3, original
coefsc_4        double  %10.0g                Coefficient 4, original
coefsc_5        double  %10.0g                Coefficient 5, original
coefsc_b_1      double  %10.0g                Coefficient-Vector 1, observed
coefsc_se_1     double  %10.0g                Std. Err. 1, bootstrapped
coefsc_cill_1   double  %10.0g                Lower bound confid. inter. 1, NB
coefsc_ciul_1   double  %10.0g                Upper bound confid. inter. 1, NB
coefsc_b_2      double  %10.0g                Coefficient-Vector 2, observed
coefsc_se_2     double  %10.0g                Std. Err. 2, bootstrapped
coefsc_cill_2   double  %10.0g                Lower bound confid. inter. 2, NB
coefsc_ciul_2   double  %10.0g                Upper bound confid. inter. 2, NB
coefsc_b_3      double  %10.0g                Coefficient-Vector 3, observed
coefsc_se_3     double  %10.0g                Std. Err. 3, bootstrapped
coefsc_cill_3   double  %10.0g                Lower bound confid. inter. 3, NB
coefsc_ciul_3   double  %10.0g                Upper bound confid. inter. 3, NB
coefsc_b_4      double  %10.0g                Coefficient-Vector 4, observed
coefsc_se_4     double  %10.0g                Std. Err. 4, bootstrapped
coefsc_cill_4   double  %10.0g                Lower bound confid. inter. 4, NB
coefsc_ciul_4   double  %10.0g                Upper bound confid. inter. 4, NB
coefsc_b_5      double  %10.0g                Coefficient-Vector 5, observed
coefsc_se_5     double  %10.0g                Std. Err. 5, bootstrapped
coefsc_cill_5   double  %10.0g                Lower bound confid. inter. 5, NB
coefsc_ciul_5   double  %10.0g                Upper bound confid. inter. 5, NB
coefsc_tvprime  float   %9.0g                 Year

. 
. // do the ols and see if the ols estimation result is in the confidence interval
. xtreg lco2_c lgdp_c lgdp_c2 fossil_fuel_prod_c techonology_c if Year<2017 & Region=="C", 
> fe level(68)

Fixed-effects (within) regression               Number of obs     =         60
Group variable: Number                          Number of groups  =          3

R-squared:                                      Obs per group:
     Within  = 0.9822                                         min =         20
     Between = 0.6462                                         avg =       20.0
     Overall = 0.9467                                         max =         20

                                                F(4,53)           =     731.22
corr(u_i, Xb) = 0.0613                          Prob > F          =     0.0000

------------------------------------------------------------------------------------
            lco2_c | Coefficient  Std. err.      t    P>|t|     [68% conf. interval]
-------------------+----------------------------------------------------------------
            lgdp_c |   1.951452   .0887706    21.98   0.000     1.862337    2.040567
           lgdp_c2 |  -.1831288   .0133944   -13.67   0.000    -.1965751   -.1696824
fossil_fuel_prod_c |  -.0109678   .0039014    -2.81   0.007    -.0148843   -.0070513
     techonology_c |   .0536379    .003893    13.78   0.000     .0497298    .0575461
             _cons |  -3.738847   .1900198   -19.68   0.000    -3.929604   -3.548091
-------------------+----------------------------------------------------------------
           sigma_u |  .11619312
           sigma_e |  .06632736
               rho |   .7542302   (fraction of variance due to u_i)
------------------------------------------------------------------------------------
F test that all u_i=0: F(2, 53) = 13.51                      Prob > F = 0.0000

. // cross sectional dependence test
. xtcsd, pesaran abs
 
Pesaran's test of cross sectional independence =     1.182, Pr = 0.2371
 
Average absolute value of the off-diagonal elements =     0.179

. xtcsd, friedman
 
Friedman's test of cross sectional independence =    24.486, Pr = 0.0000

. 
. 
. 
. // East China (E)
. xtnptimevar lco2_c lgdp_c lgdp_c2 fossil_fuel_prod_c techonology_c if Year<2017 & Region=
> ="E", stub(coefse) alle bootstrap bootoptions(reps(100) seed(28845080) level(68)) matsize
> (800) forcereg title(trend function, lgdp, lgdp2, ff, tech) saving("/Users/yuehenghu/Desk
> top/RP/Stata_RP/mystatagraphs")

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     1
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)
(file coefse_bootds.dta not found)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs = 140
                                                           Replications  = 100

                                  (Replications based on 7 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |  -2.709249   .9165781    -2.96   0.003    -3.620747    -1.79775
        1998 |  -2.900417   .9120654    -3.18   0.001    -3.807428   -1.993407
        1999 |  -3.091586   .9174094    -3.37   0.001    -4.003911   -2.179261
        2000 |  -3.282755   .9324403    -3.52   0.000    -4.210027   -2.355482
        2001 |  -3.473923   .9567019    -3.63   0.000    -4.425323   -2.522524
        2002 |  -3.665092   .9895154    -3.70   0.000    -4.649124   -2.681061
        2003 |  -3.856261   1.030064    -3.74   0.000    -4.880616   -2.831906
        2004 |   -4.04743   1.077474    -3.76   0.000    -5.118932   -2.975927
        2005 |  -4.238599   1.130884    -3.75   0.000    -5.363215   -3.113982
        2006 |  -4.429767   1.189485    -3.72   0.000     -5.61266   -3.246875
        2007 |  -4.620936   1.252549    -3.69   0.000    -5.866543   -3.375329
        2008 |  -4.812105   1.319436    -3.65   0.000    -6.124229   -3.499981
        2009 |  -5.003274   1.389595    -3.60   0.000    -6.385168   -3.621381
        2010 |  -5.194443   1.462554    -3.55   0.000    -6.648891   -3.739995
        2011 |  -5.385612   1.537915    -3.50   0.000    -6.915004    -3.85622
        2012 |  -5.576781   1.615342    -3.45   0.001     -7.18317   -3.970391
        2013 |   -5.76795   1.694552    -3.40   0.001     -7.45311   -4.082789
        2014 |  -5.959119   1.775306    -3.36   0.001    -7.724585   -4.193652
        2015 |  -6.150288   1.857402    -3.31   0.001    -7.997396   -4.303179
        2016 |  -6.341457   1.940671    -3.27   0.001    -8.271372   -4.411541
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     2
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs = 140
                                                           Replications  = 100

                                  (Replications based on 7 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |   1.102975   .5297947     2.08   0.037     .5761168    1.629834
        1998 |   1.167112   .5318882     2.19   0.028     .6381711    1.696052
        1999 |   1.231248   .5369128     2.29   0.022     .6973106    1.765185
        2000 |   1.295384   .5447875     2.38   0.017     .7536158    1.837152
        2001 |    1.35952   .5553909     2.45   0.014     .8072074    1.911833
        2002 |   1.423656   .5685705     2.50   0.012      .858237    1.989076
        2003 |   1.487793    .584152     2.55   0.011     .9068782    2.068707
        2004 |   1.551929   .6019487     2.58   0.010     .9533163    2.150542
        2005 |   1.616065   .6217706     2.60   0.009     .9977405     2.23439
        2006 |   1.680201   .6434305     2.61   0.009     1.040337    2.320066
        2007 |   1.744338   .6667493     2.62   0.009     1.081284    2.407392
        2008 |   1.808474   .6915592     2.62   0.009     1.120748      2.4962
        2009 |    1.87261   .7177055     2.61   0.009     1.158882    2.586338
        2010 |   1.936747   .7450477     2.60   0.009     1.195828    2.677665
        2011 |   2.000883   .7734589     2.59   0.010     1.231711    2.770055
        2012 |   2.065019   .8028256     2.57   0.010     1.266643    2.863395
        2013 |   2.129155   .8330467     2.56   0.011     1.300726    2.957585
        2014 |   2.193292   .8640326     2.54   0.011     1.334048    3.052536
        2015 |   2.257428    .895704     2.52   0.012     1.366688    3.148168
        2016 |   2.321564   .9279906     2.50   0.012     1.398717    3.244412
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     3
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs = 140
                                                           Replications  = 100

                                  (Replications based on 7 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |  -.0316599   .0792973    -0.40   0.690    -.1105177     .047198
        1998 |  -.0384448   .0792689    -0.48   0.628    -.1172744    .0403849
        1999 |  -.0452297   .0794802    -0.57   0.569    -.1242694    .0338101
        2000 |  -.0520146   .0799293    -0.65   0.515    -.1315009    .0274718
        2001 |  -.0587994   .0806122    -0.73   0.466    -.1389649     .021366
        2002 |  -.0655843    .081523    -0.80   0.421    -.1466555    .0154868
        2003 |  -.0723692   .0826541    -0.88   0.381    -.1545653    .0098268
        2004 |  -.0791541   .0839968    -0.94   0.346    -.1626854    .0043771
        2005 |   -.085939    .085541    -1.00   0.315     -.171006   -.0008721
        2006 |  -.0927239    .087276    -1.06   0.288    -.1795163   -.0059316
        2007 |  -.0995088   .0891907    -1.12   0.265    -.1882053   -.0108124
        2008 |  -.1062937   .0912738    -1.16   0.244    -.1970617   -.0155258
        2009 |  -.1130786   .0935141    -1.21   0.227    -.2060744   -.0200828
        2010 |  -.1198635   .0959004    -1.25   0.211    -.2152325   -.0244946
        2011 |  -.1266484   .0984223    -1.29   0.198    -.2245252   -.0287716
        2012 |  -.1334333   .1010695    -1.32   0.187    -.2339427    -.032924
        2013 |  -.1402182   .1038324    -1.35   0.177    -.2434752   -.0369613
        2014 |  -.1470031   .1067022    -1.38   0.168     -.253114   -.0408923
        2015 |   -.153788   .1096703    -1.40   0.161    -.2628505   -.0447255
        2016 |  -.1605729   .1127291    -1.42   0.154    -.2726772   -.0484686
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     4
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs = 140
                                                           Replications  = 100

                                  (Replications based on 7 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |  -.0002532   .0047778    -0.05   0.958    -.0050045    .0044981
        1998 |  -.0001985   .0044003    -0.05   0.964    -.0045744    .0041774
        1999 |  -.0001438   .0040939    -0.04   0.972     -.004215    .0039274
        2000 |  -.0000891   .0038756    -0.02   0.982    -.0039433    .0037651
        2001 |  -.0000344   .0037608    -0.01   0.993    -.0037744    .0037056
        2002 |   .0000203   .0037589     0.01   0.996    -.0037178    .0037584
        2003 |    .000075   .0038702     0.02   0.985    -.0037737    .0039237
        2004 |   .0001297   .0040853     0.03   0.975    -.0039329    .0041923
        2005 |   .0001844    .004389     0.04   0.966    -.0041803    .0045491
        2006 |   .0002391   .0047645     0.05   0.960    -.0044989    .0049772
        2007 |   .0002938   .0051961     0.06   0.955    -.0048735    .0054611
        2008 |   .0003485   .0056711     0.06   0.951    -.0052912    .0059882
        2009 |   .0004032   .0061795     0.07   0.948     -.005742    .0065485
        2010 |   .0004579   .0067137     0.07   0.946    -.0062186    .0071344
        2011 |   .0005126    .007268     0.07   0.944    -.0067151    .0077403
        2012 |   .0005673   .0078381     0.07   0.942    -.0072274     .008362
        2013 |    .000622   .0084209     0.07   0.941    -.0077522    .0089963
        2014 |   .0006767   .0090139     0.08   0.940    -.0082872    .0096407
        2015 |   .0007314   .0096151     0.08   0.939    -.0088304    .0102933
        2016 |   .0007861   .0102232     0.08   0.939    -.0093804    .0109527
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     5
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs = 140
                                                           Replications  = 100

                                  (Replications based on 7 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |   .0495266   .0141985     3.49   0.000     .0354068    .0636464
        1998 |   .0536352   .0129658     4.14   0.000     .0407413    .0665292
        1999 |   .0577438   .0120535     4.79   0.000     .0457571    .0697305
        2000 |   .0618524   .0115378     5.36   0.000     .0503785    .0733263
        2001 |    .065961   .0114723     5.75   0.000     .0545522    .0773698
        2002 |   .0700696   .0118646     5.91   0.000     .0582708    .0818684
        2003 |   .0741782   .0126721     5.85   0.000     .0615764      .08678
        2004 |   .0782868   .0138222     5.66   0.000     .0645412    .0920324
        2005 |   .0823954   .0152377     5.41   0.000     .0672422    .0975486
        2006 |    .086504   .0168517     5.13   0.000     .0697457    .1032623
        2007 |   .0906126   .0186126     4.87   0.000     .0721031    .1091221
        2008 |   .0947212   .0204827     4.62   0.000      .074352    .1150904
        2009 |   .0988298   .0224346     4.41   0.000     .0765195    .1211401
        2010 |   .1029384   .0244488     4.21   0.000     .0786251    .1272517
        2011 |    .107047    .026511     4.04   0.000     .0806829    .1334111
        2012 |   .1111556   .0286109     3.89   0.000     .0827032    .1396079
        2013 |   .1152642   .0307407     3.75   0.000     .0846938    .1458346
        2014 |   .1193728   .0328947     3.63   0.000     .0866604    .1520852
        2015 |   .1234814   .0350684     3.52   0.000     .0886073    .1583554
        2016 |     .12759   .0372583     3.42   0.001     .0905382    .1646418
------------------------------------------------------------------------------

. ereturn list

scalars:
                  e(N) =  7
                  e(T) =  20
             e(bwidth) =  750.5206524858833
                  e(k) =  4
                 e(NT) =  140
              e(g_avg) =  20
              e(g_min) =  20
              e(g_max) =  20

macros:
            e(cmdline) : "xtnptimevar lco2_c lgdp_c lgdp_c2 fossil_fuel_prod_c techonol.."
                e(cmd) : "xtnptimevar"
   e(seq_coefse_efftv) : "coefse_tvprime"
  e(seq_coefse_ciul_5) : "coefse_ciul_5"
  e(seq_coefse_cill_5) : "coefse_cill_5"
    e(seq_coefse_se_5) : "coefse_se_5"
     e(seq_coefse_b_5) : "coefse_b_5"
  e(seq_coefse_ciul_4) : "coefse_ciul_4"
  e(seq_coefse_cill_4) : "coefse_cill_4"
    e(seq_coefse_se_4) : "coefse_se_4"
     e(seq_coefse_b_4) : "coefse_b_4"
  e(seq_coefse_ciul_3) : "coefse_ciul_3"
  e(seq_coefse_cill_3) : "coefse_cill_3"
    e(seq_coefse_se_3) : "coefse_se_3"
     e(seq_coefse_b_3) : "coefse_b_3"
  e(seq_coefse_ciul_2) : "coefse_ciul_2"
  e(seq_coefse_cill_2) : "coefse_cill_2"
    e(seq_coefse_se_2) : "coefse_se_2"
     e(seq_coefse_b_2) : "coefse_b_2"
  e(seq_coefse_ciul_1) : "coefse_ciul_1"
  e(seq_coefse_cill_1) : "coefse_cill_1"
    e(seq_coefse_se_1) : "coefse_se_1"
     e(seq_coefse_b_1) : "coefse_b_1"
            e(vcetype) : "Bootstrap"
            e(cluster) : "Number"
               e(seed) : "XAA0000000001b824187be0e3f6c93e403990dfc65b426511daebaecd1252.."
           e(clustvar) : "Number"
            e(stubloc) : "coefse"
           e(nombreco) : "5"
               e(ivar) : "Number"
             e(depvar) : "lco2_c"

functions:
             e(sample)   

. describe coefse_*

Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------------------
coefse_1        double  %10.0g                Coefficient 1, original
coefse_2        double  %10.0g                Coefficient 2, original
coefse_3        double  %10.0g                Coefficient 3, original
coefse_4        double  %10.0g                Coefficient 4, original
coefse_5        double  %10.0g                Coefficient 5, original
coefse_b_1      double  %10.0g                Coefficient-Vector 1, observed
coefse_se_1     double  %10.0g                Std. Err. 1, bootstrapped
coefse_cill_1   double  %10.0g                Lower bound confid. inter. 1, NB
coefse_ciul_1   double  %10.0g                Upper bound confid. inter. 1, NB
coefse_b_2      double  %10.0g                Coefficient-Vector 2, observed
coefse_se_2     double  %10.0g                Std. Err. 2, bootstrapped
coefse_cill_2   double  %10.0g                Lower bound confid. inter. 2, NB
coefse_ciul_2   double  %10.0g                Upper bound confid. inter. 2, NB
coefse_b_3      double  %10.0g                Coefficient-Vector 3, observed
coefse_se_3     double  %10.0g                Std. Err. 3, bootstrapped
coefse_cill_3   double  %10.0g                Lower bound confid. inter. 3, NB
coefse_ciul_3   double  %10.0g                Upper bound confid. inter. 3, NB
coefse_b_4      double  %10.0g                Coefficient-Vector 4, observed
coefse_se_4     double  %10.0g                Std. Err. 4, bootstrapped
coefse_cill_4   double  %10.0g                Lower bound confid. inter. 4, NB
coefse_ciul_4   double  %10.0g                Upper bound confid. inter. 4, NB
coefse_b_5      double  %10.0g                Coefficient-Vector 5, observed
coefse_se_5     double  %10.0g                Std. Err. 5, bootstrapped
coefse_cill_5   double  %10.0g                Lower bound confid. inter. 5, NB
coefse_ciul_5   double  %10.0g                Upper bound confid. inter. 5, NB
coefse_tvprime  float   %9.0g                 Year

. 
. // do the ols and see if the ols estimation result is in the confidence interval
. xtreg lco2_c lgdp_c lgdp_c2 fossil_fuel_prod_c techonology_c if Year<2017 & Region=="E", 
> fe level(68)

Fixed-effects (within) regression               Number of obs     =        140
Group variable: Number                          Number of groups  =          7

R-squared:                                      Obs per group:
     Within  = 0.9578                                         min =         20
     Between = 0.9384                                         avg =       20.0
     Overall = 0.9374                                         max =         20

                                                F(4,129)          =     731.64
corr(u_i, Xb) = 0.3568                          Prob > F          =     0.0000

------------------------------------------------------------------------------------
            lco2_c | Coefficient  Std. err.      t    P>|t|     [68% conf. interval]
-------------------+----------------------------------------------------------------
            lgdp_c |     1.6883   .0749794    22.52   0.000     1.613447    1.763152
           lgdp_c2 |  -.1258847   .0088706   -14.19   0.000    -.1347403   -.1170292
fossil_fuel_prod_c |  -.0047907   .0019842    -2.41   0.017    -.0067716   -.0028098
     techonology_c |   .0563194   .0042819    13.15   0.000     .0520448     .060594
             _cons |   -3.61107   .1974217   -18.29   0.000    -3.808157   -3.413983
-------------------+----------------------------------------------------------------
           sigma_u |  .12972849
           sigma_e |  .09169958
               rho |  .66682324   (fraction of variance due to u_i)
------------------------------------------------------------------------------------
F test that all u_i=0: F(6, 129) = 8.29                      Prob > F = 0.0000

. 
. // cross sectional dependence test
. xtcsd, pesaran abs
 
Pesaran's test of cross sectional independence =    -0.166, Pr = 1.1321
 
Average absolute value of the off-diagonal elements =     0.569

. xtcsd, friedman
 
Friedman's test of cross sectional independence =    16.094, Pr = 0.0133

. 
. 
. 
. // North China
. xtnptimevar lco2_c lgdp_c lgdp_c2 fossil_fuel_prod_c techonology_c if Year<2017 & Region=
> ="N", stub(coefse) alle bootstrap bootoptions(reps(100) seed(28845080) level(68)) matsize
> (800) forcereg title(trend function, lgdp, lgdp2, ff, tech) saving("/Users/yuehenghu/Desk
> top/RP/Stata_RP/mystatagraphs")

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     1
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)
(file coefse_bootds.dta not found)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs = 100
                                                           Replications  = 100

                                  (Replications based on 5 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |  -4.874909   2.403948    -2.03   0.043    -7.265534   -2.484284
        1998 |  -4.879589   2.335538    -2.09   0.037    -7.202183   -2.556994
        1999 |  -4.884268   2.276238    -2.15   0.032    -7.147891   -2.620645
        2000 |  -4.888948   2.226776    -2.20   0.028    -7.103383   -2.674513
        2001 |  -4.893627   2.187819    -2.24   0.025    -7.069322   -2.717933
        2002 |  -4.898307   2.159937    -2.27   0.023    -7.046273   -2.750341
        2003 |  -4.902986    2.14356    -2.29   0.022    -7.034667   -2.771306
        2004 |  -4.907666   2.138954    -2.29   0.022    -7.034765   -2.780567
        2005 |  -4.912346   2.146193    -2.29   0.022    -7.046645   -2.778047
        2006 |  -4.917025    2.16516    -2.27   0.023    -7.070186   -2.763864
        2007 |  -4.921705   2.195551    -2.24   0.025    -7.105088   -2.738322
        2008 |  -4.926384   2.236899    -2.20   0.028    -7.150886   -2.701882
        2009 |  -4.931064   2.288612    -2.15   0.031    -7.206992   -2.655136
        2010 |  -4.935744   2.350004    -2.10   0.036    -7.272723   -2.598764
        2011 |  -4.940423   2.420339    -2.04   0.041    -7.347349   -2.533498
        2012 |  -4.945103   2.498864    -1.98   0.048    -7.430117   -2.460088
        2013 |  -4.949782    2.58483    -1.91   0.056    -7.520287   -2.379278
        2014 |  -4.954462   2.677521    -1.85   0.064    -7.617144    -2.29178
        2015 |  -4.959142   2.776265    -1.79   0.074     -7.72002   -2.198263
        2016 |  -4.963821   2.880438    -1.72   0.085    -7.828296   -2.099346
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     2
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs = 100
                                                           Replications  = 100

                                  (Replications based on 5 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |   3.165643   1.438433     2.20   0.028     1.735182    4.596104
        1998 |   3.155598    1.42229     2.22   0.027     1.741191    4.570006
        1999 |   3.145554   1.409336     2.23   0.026     1.744028     4.54708
        2000 |    3.13551   1.399661     2.24   0.025     1.743606    4.527414
        2001 |   3.125466   1.393332     2.24   0.025     1.739855    4.511076
        2002 |   3.115421   1.390396     2.24   0.025     1.732731    4.498111
        2003 |   3.105377   1.390873     2.23   0.026     1.722212    4.488542
        2004 |   3.095333    1.39476     2.22   0.026     1.708302    4.482363
        2005 |   3.085288   1.402029     2.20   0.028     1.691029    4.479547
        2006 |   3.075244   1.412628     2.18   0.029     1.670445    4.480043
        2007 |     3.0652   1.426482     2.15   0.032     1.646624    4.483776
        2008 |   3.055155   1.443497     2.12   0.034     1.619658    4.490653
        2009 |   3.045111   1.463564     2.08   0.037     1.589658    4.500564
        2010 |   3.035067   1.486559     2.04   0.041     1.556746    4.513387
        2011 |   3.025023   1.512348     2.00   0.045     1.521056    4.528989
        2012 |   3.014978   1.540791     1.96   0.050     1.482726     4.54723
        2013 |   3.004934   1.571744     1.91   0.056       1.4419    4.567967
        2014 |    2.99489   1.605062     1.87   0.062     1.398723    4.591056
        2015 |   2.984845     1.6406     1.82   0.069     1.353338    4.616353
        2016 |   2.974801   1.678218     1.77   0.076     1.305884    4.643718
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     3
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs = 100
                                                           Replications  = 100

                                  (Replications based on 5 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |  -.4057899   .2469678    -1.64   0.100     -.651389   -.1601908
        1998 |  -.4010807   .2440134    -1.64   0.100    -.6437418   -.1584196
        1999 |  -.3963715    .241284    -1.64   0.100    -.6363183   -.1564247
        2000 |  -.3916623   .2387873    -1.64   0.101    -.6291262   -.1541984
        2001 |  -.3869531   .2365306    -1.64   0.102    -.6221729   -.1517334
        2002 |  -.3822439   .2345209    -1.63   0.103    -.6154651   -.1490228
        2003 |  -.3775347   .2327646    -1.62   0.105    -.6090094   -.1460601
        2004 |  -.3728256   .2312675    -1.61   0.107    -.6028113   -.1428398
        2005 |  -.3681164   .2300345    -1.60   0.110     -.596876   -.1393567
        2006 |  -.3634072   .2290701    -1.59   0.113    -.5912077   -.1356066
        2007 |   -.358698   .2283775    -1.57   0.116    -.5858098   -.1315862
        2008 |  -.3539888   .2279593    -1.55   0.120    -.5806847   -.1272929
        2009 |  -.3492796   .2278169    -1.53   0.125    -.5758339   -.1227252
        2010 |  -.3445704    .227951    -1.51   0.131     -.571258   -.1178827
        2011 |  -.3398612   .2283609    -1.49   0.137    -.5669565   -.1127659
        2012 |   -.335152   .2290453    -1.46   0.143    -.5629279   -.1073761
        2013 |  -.3304428   .2300016    -1.44   0.151    -.5591697   -.1017159
        2014 |  -.3257336   .2312266    -1.41   0.159    -.5556787   -.0957885
        2015 |  -.3210244   .2327159    -1.38   0.168    -.5524505   -.0895983
        2016 |  -.3163152   .2344645    -1.35   0.177    -.5494803   -.0831502
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     4
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs = 100
                                                           Replications  = 100

                                  (Replications based on 5 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |   .0002805   .0028288     0.10   0.921    -.0025327    .0030936
        1998 |   .0001983   .0024173     0.08   0.935    -.0022057    .0026022
        1999 |    .000116   .0020665     0.06   0.955     -.001939    .0021711
        2000 |   .0000338   .0018121     0.02   0.985    -.0017682    .0018358
        2001 |  -.0000484   .0016978    -0.03   0.977    -.0017368      .00164
        2002 |  -.0001307   .0017514    -0.07   0.941    -.0018724    .0016111
        2003 |  -.0002129   .0019592    -0.11   0.913    -.0021613    .0017354
        2004 |  -.0002951   .0022793    -0.13   0.897    -.0025619    .0019716
        2005 |  -.0003774   .0026718    -0.14   0.888    -.0030343    .0022796
        2006 |  -.0004596   .0031092    -0.15   0.882    -.0035516    .0026324
        2007 |  -.0005418   .0035752    -0.15   0.880    -.0040972    .0030135
        2008 |  -.0006241   .0040599    -0.15   0.878    -.0046615    .0034133
        2009 |  -.0007063   .0045574    -0.15   0.877    -.0052384    .0038258
        2010 |  -.0007885   .0050638    -0.16   0.876    -.0058243    .0042472
        2011 |  -.0008708   .0055768    -0.16   0.876    -.0064167    .0046752
        2012 |   -.000953   .0060947    -0.16   0.876     -.007014     .005108
        2013 |  -.0010352   .0066164    -0.16   0.876    -.0076149    .0055445
        2014 |  -.0011175   .0071409    -0.16   0.876    -.0082188    .0059839
        2015 |  -.0011997   .0076678    -0.16   0.876     -.008825    .0064256
        2016 |  -.0012819   .0081966    -0.16   0.876    -.0094331    .0068692
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     5
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs = 100
                                                           Replications  = 100

                                  (Replications based on 5 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |   .0232379   .0164748     1.41   0.158     .0068544    .0396214
        1998 |   .0241941   .0158367     1.53   0.127     .0084452     .039943
        1999 |   .0251504   .0152529     1.65   0.099     .0099821    .0403188
        2000 |   .0261067   .0147299     1.77   0.076     .0114584     .040755
        2001 |    .027063   .0142745     1.90   0.058     .0128676    .0412584
        2002 |   .0280192   .0138933     2.02   0.044      .014203    .0418355
        2003 |   .0289755   .0135924     2.13   0.033     .0154585    .0424926
        2004 |   .0299318   .0133774     2.24   0.025     .0166286     .043235
        2005 |   .0308881   .0132523     2.33   0.020     .0177092     .044067
        2006 |   .0318443   .0132199     2.41   0.016     .0186978    .0449909
        2007 |   .0328006   .0132806     2.47   0.014     .0195936    .0460077
        2008 |   .0337569   .0134334     2.51   0.012      .020398    .0471158
        2009 |   .0347132    .013675     2.54   0.011      .021114    .0483124
        2010 |   .0356695   .0140009     2.55   0.011     .0217461    .0495928
        2011 |   .0366257   .0144054     2.54   0.011     .0223001    .0509513
        2012 |    .037582   .0148821     2.53   0.012     .0227824    .0523816
        2013 |   .0385383   .0154242     2.50   0.012     .0231995     .053877
        2014 |   .0394946   .0160252     2.46   0.014     .0235581     .055431
        2015 |   .0404508   .0166787     2.43   0.015     .0238646    .0570371
        2016 |   .0414071   .0173787     2.38   0.017     .0241248    .0586895
------------------------------------------------------------------------------

. ereturn list

scalars:
                  e(N) =  5
                  e(T) =  20
             e(bwidth) =  16199.97174067506
                  e(k) =  4
                 e(NT) =  100
              e(g_avg) =  20
              e(g_min) =  20
              e(g_max) =  20

macros:
            e(cmdline) : "xtnptimevar lco2_c lgdp_c lgdp_c2 fossil_fuel_prod_c techonol.."
                e(cmd) : "xtnptimevar"
   e(seq_coefse_efftv) : "coefse_tvprime"
  e(seq_coefse_ciul_5) : "coefse_ciul_5"
  e(seq_coefse_cill_5) : "coefse_cill_5"
    e(seq_coefse_se_5) : "coefse_se_5"
     e(seq_coefse_b_5) : "coefse_b_5"
  e(seq_coefse_ciul_4) : "coefse_ciul_4"
  e(seq_coefse_cill_4) : "coefse_cill_4"
    e(seq_coefse_se_4) : "coefse_se_4"
     e(seq_coefse_b_4) : "coefse_b_4"
  e(seq_coefse_ciul_3) : "coefse_ciul_3"
  e(seq_coefse_cill_3) : "coefse_cill_3"
    e(seq_coefse_se_3) : "coefse_se_3"
     e(seq_coefse_b_3) : "coefse_b_3"
  e(seq_coefse_ciul_2) : "coefse_ciul_2"
  e(seq_coefse_cill_2) : "coefse_cill_2"
    e(seq_coefse_se_2) : "coefse_se_2"
     e(seq_coefse_b_2) : "coefse_b_2"
  e(seq_coefse_ciul_1) : "coefse_ciul_1"
  e(seq_coefse_cill_1) : "coefse_cill_1"
    e(seq_coefse_se_1) : "coefse_se_1"
     e(seq_coefse_b_1) : "coefse_b_1"
            e(vcetype) : "Bootstrap"
            e(cluster) : "Number"
               e(seed) : "XAA0000000001b824187be0e3f6c93e403990dfc65b426511daebaecd1252.."
           e(clustvar) : "Number"
            e(stubloc) : "coefse"
           e(nombreco) : "5"
               e(ivar) : "Number"
             e(depvar) : "lco2_c"

functions:
             e(sample)   

. describe coefse_*

Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------------------
coefse_1        double  %10.0g                Coefficient 1, original
coefse_2        double  %10.0g                Coefficient 2, original
coefse_3        double  %10.0g                Coefficient 3, original
coefse_4        double  %10.0g                Coefficient 4, original
coefse_5        double  %10.0g                Coefficient 5, original
coefse_b_1      double  %10.0g                Coefficient-Vector 1, observed
coefse_se_1     double  %10.0g                Std. Err. 1, bootstrapped
coefse_cill_1   double  %10.0g                Lower bound confid. inter. 1, NB
coefse_ciul_1   double  %10.0g                Upper bound confid. inter. 1, NB
coefse_b_2      double  %10.0g                Coefficient-Vector 2, observed
coefse_se_2     double  %10.0g                Std. Err. 2, bootstrapped
coefse_cill_2   double  %10.0g                Lower bound confid. inter. 2, NB
coefse_ciul_2   double  %10.0g                Upper bound confid. inter. 2, NB
coefse_b_3      double  %10.0g                Coefficient-Vector 3, observed
coefse_se_3     double  %10.0g                Std. Err. 3, bootstrapped
coefse_cill_3   double  %10.0g                Lower bound confid. inter. 3, NB
coefse_ciul_3   double  %10.0g                Upper bound confid. inter. 3, NB
coefse_b_4      double  %10.0g                Coefficient-Vector 4, observed
coefse_se_4     double  %10.0g                Std. Err. 4, bootstrapped
coefse_cill_4   double  %10.0g                Lower bound confid. inter. 4, NB
coefse_ciul_4   double  %10.0g                Upper bound confid. inter. 4, NB
coefse_b_5      double  %10.0g                Coefficient-Vector 5, observed
coefse_se_5     double  %10.0g                Std. Err. 5, bootstrapped
coefse_cill_5   double  %10.0g                Lower bound confid. inter. 5, NB
coefse_ciul_5   double  %10.0g                Upper bound confid. inter. 5, NB
coefse_tvprime  float   %9.0g                 Year

. 
. // do the ols and see if the ols estimation result is in the confidence interval
. xtreg lco2_c lgdp_c lgdp_c2 fossil_fuel_prod_c techonology_c if Year<2017 & Region=="N", 
> fe level(68)

Fixed-effects (within) regression               Number of obs     =        100
Group variable: Number                          Number of groups  =          5

R-squared:                                      Obs per group:
     Within  = 0.9078                                         min =         20
     Between = 0.5519                                         avg =       20.0
     Overall = 0.7753                                         max =         20

                                                F(4,91)           =     223.96
corr(u_i, Xb) = 0.1143                          Prob > F          =     0.0000

------------------------------------------------------------------------------------
            lco2_c | Coefficient  Std. err.      t    P>|t|     [68% conf. interval]
-------------------+----------------------------------------------------------------
            lgdp_c |   2.804514   .1564213    17.93   0.000     2.648105    2.960923
           lgdp_c2 |  -.2797812   .0194622   -14.38   0.000    -.2992419   -.2603205
fossil_fuel_prod_c |    .000172   .0006303     0.27   0.786    -.0004583    .0008022
     techonology_c |   .0266781   .0028366     9.40   0.000     .0238417    .0295145
             _cons |  -4.957599   .3822132   -12.97   0.000    -5.339782   -4.575416
-------------------+----------------------------------------------------------------
           sigma_u |  .30490361
           sigma_e |  .17487559
               rho |  .75247231   (fraction of variance due to u_i)
------------------------------------------------------------------------------------
F test that all u_i=0: F(4, 91) = 33.16                      Prob > F = 0.0000

. 
. // cross sectional dependence test
. xtcsd, pesaran abs
 
Pesaran's test of cross sectional independence =     1.479, Pr = 0.1391
 
Average absolute value of the off-diagonal elements =     0.468

. xtcsd, friedman
 
Friedman's test of cross sectional independence =    25.411, Pr = 0.0000

. 
. 
. 
. // Northeast
. xtnptimevar lco2_c lgdp_c lgdp_c2 fossil_fuel_prod_c techonology_c if Year<2017 & Region=
> ="NE", stub(coefse) alle bootstrap bootoptions(reps(100) seed(28845080) level(68)) matsiz
> e(800) forcereg title(trend function, lgdp, lgdp2, ff, tech) saving("/Users/yuehenghu/Des
> ktop/RP/Stata_RP/mystatagraphs")

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     1
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)
(file coefse_bootds.dta not found)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  60
                                                           Replications  = 100

                                  (Replications based on 3 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |  -2.080274   .6275404    -3.31   0.001    -2.704336   -1.456212
        1998 |  -2.083302   .6323274    -3.29   0.001    -2.712125   -1.454479
        1999 |   -2.08633   .6371371    -3.27   0.001    -2.719936   -1.452724
        2000 |  -2.089357   .6419688    -3.25   0.001    -2.727768   -1.450947
        2001 |  -2.092385    .646822    -3.23   0.001    -2.735623   -1.449148
        2002 |  -2.095413   .6516964    -3.22   0.001    -2.743498   -1.447328
        2003 |  -2.098441   .6565913    -3.20   0.001    -2.751393   -1.445488
        2004 |  -2.101469   .6615064    -3.18   0.001    -2.759309   -1.443628
        2005 |  -2.104496   .6664413    -3.16   0.002    -2.767244   -1.441749
        2006 |  -2.107524   .6713954    -3.14   0.002    -2.775199    -1.43985
        2007 |  -2.110552   .6763683    -3.12   0.002    -2.783172   -1.437932
        2008 |   -2.11358   .6813597    -3.10   0.002    -2.791163   -1.435996
        2009 |  -2.116608   .6863691    -3.08   0.002    -2.799173   -1.434042
        2010 |  -2.119635   .6913962    -3.07   0.002      -2.8072   -1.432071
        2011 |  -2.122663   .6964405    -3.05   0.002    -2.815244   -1.430083
        2012 |  -2.125691   .7015017    -3.03   0.002    -2.823305   -1.428077
        2013 |  -2.128719   .7065794    -3.01   0.003    -2.831382   -1.426055
        2014 |  -2.131747   .7116734    -3.00   0.003    -2.839476   -1.424017
        2015 |  -2.134774   .7167831    -2.98   0.003    -2.847585   -1.421964
        2016 |  -2.137802   .7219083    -2.96   0.003     -2.85571   -1.419895
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     2
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  60
                                                           Replications  = 100

                                  (Replications based on 3 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |   .8443063   .4762195     1.77   0.076     .3707261    1.317886
        1998 |   .8355066   .4655824     1.79   0.073     .3725045    1.298509
        1999 |    .826707   .4550886     1.82   0.069     .3741405    1.279274
        2000 |   .8179074   .4447483     1.84   0.066     .3756239    1.260191
        2001 |   .8091078   .4345724     1.86   0.063     .3769439    1.241272
        2002 |   .8003082   .4245727     1.88   0.059     .3780886    1.222528
        2003 |   .7915086   .4147619     1.91   0.056     .3790454    1.203972
        2004 |    .782709   .4051538     1.93   0.053     .3798006    1.185617
        2005 |   .7739093   .3957631     1.96   0.051     .3803396    1.167479
        2006 |   .7651097   .3866057     1.98   0.048     .3806466    1.149573
        2007 |   .7563101   .3776986     2.00   0.045     .3807048    1.131915
        2008 |   .7475105   .3690598     2.03   0.043      .380496    1.114525
        2009 |   .7387109   .3607087     2.05   0.041     .3800013    1.097421
        2010 |   .7299113   .3526657     2.07   0.038     .3792001    1.080622
        2011 |   .7211117   .3449523     2.09   0.037     .3780711    1.064152
        2012 |    .712312   .3375912     2.11   0.035     .3765918    1.048032
        2013 |   .7035124   .3306058     2.13   0.033     .3747389    1.032286
        2014 |   .6947128   .3240205     2.14   0.032      .372488    1.016938
        2015 |   .6859132   .3178602     2.16   0.031     .3698146    1.002012
        2016 |   .6771136   .3121499     2.17   0.030     .3666937    .9875335
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     3
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  60
                                                           Replications  = 100

                                  (Replications based on 3 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |   .0333121   .0693507     0.48   0.631    -.0356542    .1022785
        1998 |   .0333885   .0671535     0.50   0.619    -.0333928    .1001699
        1999 |   .0334649   .0649937     0.51   0.607    -.0311686    .0980985
        2000 |   .0335413   .0628753     0.53   0.594    -.0289855    .0960681
        2001 |   .0336177   .0608025     0.55   0.580    -.0268478    .0940832
        2002 |   .0336941   .0587801     0.57   0.566    -.0247602    .0921485
        2003 |   .0337705   .0568137     0.59   0.552    -.0227283    .0902694
        2004 |   .0338469   .0549091     0.62   0.538    -.0207578    .0884517
        2005 |   .0339233    .053073     0.64   0.523    -.0188556    .0867022
        2006 |   .0339997   .0513128     0.66   0.508    -.0170287    .0850282
        2007 |   .0340761   .0496366     0.69   0.492    -.0152854    .0834377
        2008 |   .0341525   .0480531     0.71   0.477    -.0136343    .0819394
        2009 |   .0342289   .0465719     0.73   0.462    -.0120848    .0805427
        2010 |   .0343053   .0452028     0.76   0.448     -.010647    .0792577
        2011 |   .0343817   .0439566     0.78   0.434    -.0093312    .0780947
        2012 |   .0344581   .0428438     0.80   0.421    -.0081482    .0770644
        2013 |   .0345345    .041875     0.82   0.410    -.0071084    .0761775
        2014 |   .0346109   .0410606     0.84   0.399    -.0062221     .075444
        2015 |   .0346873   .0404098     0.86   0.391    -.0054985    .0748732
        2016 |   .0347637   .0399307     0.87   0.384    -.0049456    .0744731
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     4
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  60
                                                           Replications  = 100

                                  (Replications based on 3 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |  -.0003051    .001395    -0.22   0.827    -.0016923    .0010822
        1998 |  -.0002245   .0012694    -0.18   0.860    -.0014869    .0010378
        1999 |   -.000144   .0011743    -0.12   0.902    -.0013118    .0010238
        2000 |  -.0000635   .0011175    -0.06   0.955    -.0011748    .0010478
        2001 |    .000017    .001105     0.02   0.988    -.0010818    .0011159
        2002 |   .0000976   .0011382     0.09   0.932    -.0010343    .0012294
        2003 |   .0001781   .0012133     0.15   0.883    -.0010285    .0013847
        2004 |   .0002586   .0013233     0.20   0.845    -.0010573    .0015746
        2005 |   .0003392   .0014603     0.23   0.816     -.001113    .0017913
        2006 |   .0004197   .0016174     0.26   0.795    -.0011887    .0020281
        2007 |   .0005002   .0017893     0.28   0.780    -.0012792    .0022796
        2008 |   .0005808   .0019722     0.29   0.768    -.0013806    .0025421
        2009 |   .0006613   .0021633     0.31   0.760    -.0014901    .0028126
        2010 |   .0007418   .0023606     0.31   0.753    -.0016057    .0030894
        2011 |   .0008223   .0025627     0.32   0.748    -.0017262    .0033709
        2012 |   .0009029   .0027685     0.33   0.744    -.0018503     .003656
        2013 |   .0009834   .0029773     0.33   0.741    -.0019774    .0039442
        2014 |   .0010639   .0031884     0.33   0.739    -.0021068    .0042346
        2015 |   .0011445   .0034014     0.34   0.737    -.0022381     .004527
        2016 |    .001225   .0036161     0.34   0.735     -.002371     .004821
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     5
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  60
                                                           Replications  = 100

                                  (Replications based on 3 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |   .0325902   .0028825    11.31   0.000     .0297237    .0354568
        1998 |   .0338583   .0027573    12.28   0.000     .0311163    .0366003
        1999 |   .0351264   .0026706    13.15   0.000     .0324706    .0377821
        2000 |   .0363944   .0026262    13.86   0.000     .0337828    .0390061
        2001 |   .0376625   .0026263    14.34   0.000     .0350507    .0402743
        2002 |   .0389306    .002671    14.58   0.000     .0362744    .0415867
        2003 |   .0401986   .0027579    14.58   0.000      .037456    .0429413
        2004 |   .0414667   .0028834    14.38   0.000     .0385993    .0443341
        2005 |   .0427348   .0030426    14.05   0.000     .0397091    .0457605
        2006 |   .0440028   .0032305    13.62   0.000     .0407902    .0472155
        2007 |   .0452709   .0034425    13.15   0.000     .0418474    .0486944
        2008 |    .046539   .0036745    12.67   0.000     .0428849    .0501931
        2009 |    .047807   .0039227    12.19   0.000     .0439061     .051708
        2010 |   .0490751   .0041845    11.73   0.000     .0449138    .0532364
        2011 |   .0503432   .0044573    11.29   0.000     .0459106    .0547757
        2012 |   .0516112   .0047392    10.89   0.000     .0468983    .0563242
        2013 |   .0528793   .0050289    10.52   0.000     .0478783    .0578803
        2014 |   .0541474   .0053248    10.17   0.000      .048852    .0594427
        2015 |   .0554155   .0056262     9.85   0.000     .0498204    .0610105
        2016 |   .0566835   .0059321     9.56   0.000     .0507843    .0625828
------------------------------------------------------------------------------

. ereturn list

scalars:
                  e(N) =  3
                  e(T) =  20
             e(bwidth) =  7174.466015038447
                  e(k) =  4
                 e(NT) =  60
              e(g_avg) =  20
              e(g_min) =  20
              e(g_max) =  20

macros:
            e(cmdline) : "xtnptimevar lco2_c lgdp_c lgdp_c2 fossil_fuel_prod_c techonol.."
                e(cmd) : "xtnptimevar"
   e(seq_coefse_efftv) : "coefse_tvprime"
  e(seq_coefse_ciul_5) : "coefse_ciul_5"
  e(seq_coefse_cill_5) : "coefse_cill_5"
    e(seq_coefse_se_5) : "coefse_se_5"
     e(seq_coefse_b_5) : "coefse_b_5"
  e(seq_coefse_ciul_4) : "coefse_ciul_4"
  e(seq_coefse_cill_4) : "coefse_cill_4"
    e(seq_coefse_se_4) : "coefse_se_4"
     e(seq_coefse_b_4) : "coefse_b_4"
  e(seq_coefse_ciul_3) : "coefse_ciul_3"
  e(seq_coefse_cill_3) : "coefse_cill_3"
    e(seq_coefse_se_3) : "coefse_se_3"
     e(seq_coefse_b_3) : "coefse_b_3"
  e(seq_coefse_ciul_2) : "coefse_ciul_2"
  e(seq_coefse_cill_2) : "coefse_cill_2"
    e(seq_coefse_se_2) : "coefse_se_2"
     e(seq_coefse_b_2) : "coefse_b_2"
  e(seq_coefse_ciul_1) : "coefse_ciul_1"
  e(seq_coefse_cill_1) : "coefse_cill_1"
    e(seq_coefse_se_1) : "coefse_se_1"
     e(seq_coefse_b_1) : "coefse_b_1"
            e(vcetype) : "Bootstrap"
            e(cluster) : "Number"
               e(seed) : "XAA0000000001b824187be0e3f6c93e403990dfc65b426511daebaecd1252.."
           e(clustvar) : "Number"
            e(stubloc) : "coefse"
           e(nombreco) : "5"
               e(ivar) : "Number"
             e(depvar) : "lco2_c"

functions:
             e(sample)   

. describe coefse_*

Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------------------
coefse_1        double  %10.0g                Coefficient 1, original
coefse_2        double  %10.0g                Coefficient 2, original
coefse_3        double  %10.0g                Coefficient 3, original
coefse_4        double  %10.0g                Coefficient 4, original
coefse_5        double  %10.0g                Coefficient 5, original
coefse_b_1      double  %10.0g                Coefficient-Vector 1, observed
coefse_se_1     double  %10.0g                Std. Err. 1, bootstrapped
coefse_cill_1   double  %10.0g                Lower bound confid. inter. 1, NB
coefse_ciul_1   double  %10.0g                Upper bound confid. inter. 1, NB
coefse_b_2      double  %10.0g                Coefficient-Vector 2, observed
coefse_se_2     double  %10.0g                Std. Err. 2, bootstrapped
coefse_cill_2   double  %10.0g                Lower bound confid. inter. 2, NB
coefse_ciul_2   double  %10.0g                Upper bound confid. inter. 2, NB
coefse_b_3      double  %10.0g                Coefficient-Vector 3, observed
coefse_se_3     double  %10.0g                Std. Err. 3, bootstrapped
coefse_cill_3   double  %10.0g                Lower bound confid. inter. 3, NB
coefse_ciul_3   double  %10.0g                Upper bound confid. inter. 3, NB
coefse_b_4      double  %10.0g                Coefficient-Vector 4, observed
coefse_se_4     double  %10.0g                Std. Err. 4, bootstrapped
coefse_cill_4   double  %10.0g                Lower bound confid. inter. 4, NB
coefse_ciul_4   double  %10.0g                Upper bound confid. inter. 4, NB
coefse_b_5      double  %10.0g                Coefficient-Vector 5, observed
coefse_se_5     double  %10.0g                Std. Err. 5, bootstrapped
coefse_cill_5   double  %10.0g                Lower bound confid. inter. 5, NB
coefse_ciul_5   double  %10.0g                Upper bound confid. inter. 5, NB
coefse_tvprime  float   %9.0g                 Year

. 
. // do the ols and see if the ols estimation result is in the confidence interval
. xtreg lco2_c lgdp_c lgdp_c2 fossil_fuel_prod_c techonology_c if Year<2017 & Region=="NE",
>  fe level(68)

Fixed-effects (within) regression               Number of obs     =         60
Group variable: Number                          Number of groups  =          3

R-squared:                                      Obs per group:
     Within  = 0.9828                                         min =         20
     Between = 0.9904                                         avg =       20.0
     Overall = 0.9775                                         max =         20

                                                F(4,53)           =     755.95
corr(u_i, Xb) = 0.3667                          Prob > F          =     0.0000

------------------------------------------------------------------------------------
            lco2_c | Coefficient  Std. err.      t    P>|t|     [68% conf. interval]
-------------------+----------------------------------------------------------------
            lgdp_c |   1.580906   .1079435    14.65   0.000     1.472544    1.689268
           lgdp_c2 |  -.1174574   .0133913    -8.77   0.000    -.1309006   -.1040143
fossil_fuel_prod_c |  -.0003224   .0002169    -1.49   0.143    -.0005401   -.0001047
     techonology_c |   .0275197   .0022146    12.43   0.000     .0252965    .0297429
             _cons |  -2.693521   .2576928   -10.45   0.000    -2.952212   -2.434829
-------------------+----------------------------------------------------------------
           sigma_u |  .04809305
           sigma_e |  .04603952
               rho |  .52180487   (fraction of variance due to u_i)
------------------------------------------------------------------------------------
F test that all u_i=0: F(2, 53) = 10.51                      Prob > F = 0.0001

. 
. // cross sectional dependence test
. xtcsd, pesaran abs
 
Pesaran's test of cross sectional independence =     1.158, Pr = 0.2468
 
Average absolute value of the off-diagonal elements =     0.150

. xtcsd, friedman
 
Friedman's test of cross sectional independence =    28.143, Pr = 0.0000

. 
. 
. 
. // Northwest (NW)
. xtnptimevar lco2_c lgdp_c lgdp_c2 fossil_fuel_prod_c techonology_c if Year<2017 & Region=
> ="NW", stub(coefse) alle bootstrap bootoptions(reps(100) seed(28845080) level(68)) matsiz
> e(800) forcereg title(trend function, lgdp, lgdp2, ff, tech) saving("/Users/yuehenghu/Des
> ktop/RP/Stata_RP/mystatagraphs")

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     1
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)
(file coefse_bootds.dta not found)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs = 100
                                                           Replications  = 100

                                  (Replications based on 5 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |   4.543178    4.99447     0.91   0.363    -.4236115    9.509968
        1998 |   4.621913   5.046513     0.92   0.360    -.3966319    9.640458
        1999 |   4.700647   5.098691     0.92   0.357    -.3697856    9.771081
        2000 |   4.779382   5.150998     0.93   0.353    -.3430688    9.901833
        2001 |   4.858117   5.203432     0.93   0.350    -.3164775    10.03271
        2002 |   4.936851   5.255988     0.94   0.348    -.2900079    10.16371
        2003 |   5.015586   5.308663     0.94   0.345    -.2636565    10.29483
        2004 |    5.09432   5.361454     0.95   0.342    -.2374196    10.42606
        2005 |   5.173055   5.414356     0.96   0.339    -.2112941     10.5574
        2006 |   5.251789   5.467367     0.96   0.337    -.1852766    10.68886
        2007 |   5.330524   5.520483     0.97   0.334    -.1593641    10.82041
        2008 |   5.409259   5.573702     0.97   0.332    -.1335535    10.95207
        2009 |   5.487993   5.627021     0.98   0.329     -.107842    11.08383
        2010 |   5.566728   5.680436     0.98   0.327    -.0822267    11.21568
        2011 |   5.645462   5.733945     0.98   0.325     -.056705    11.34763
        2012 |   5.724197   5.787546     0.99   0.323    -.0312742    11.47967
        2013 |   5.802931   5.841236     0.99   0.320     -.005932    11.61179
        2014 |   5.881666   5.895013     1.00   0.318     .0193243    11.74401
        2015 |     5.9604   5.948873     1.00   0.316     .0444967     11.8763
        2016 |   6.039135   6.002816     1.01   0.314     .0695878    12.00868
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     2
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs = 100
                                                           Replications  = 100

                                  (Replications based on 5 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |  -5.266565   4.353004    -1.21   0.226    -9.595444    -.937686
        1998 |  -5.079699   4.217978    -1.20   0.228    -9.274301   -.8850979
        1999 |  -4.892834   4.083336    -1.20   0.231    -8.953539   -.8321282
        2000 |  -4.705968   3.949117    -1.19   0.233    -8.633198    -.778738
        2001 |  -4.519103   3.815365    -1.18   0.236    -8.313322   -.7248828
        2002 |  -4.332237   3.682132    -1.18   0.239    -7.993962   -.6705119
        2003 |  -4.145371   3.549476    -1.17   0.243    -7.675175   -.6155674
        2004 |  -3.958506   3.417463    -1.16   0.247    -7.357029   -.5599824
        2005 |   -3.77164   3.286173    -1.15   0.251    -7.039601   -.5036797
        2006 |  -3.584775   3.155694    -1.14   0.256    -6.722979   -.4465697
        2007 |  -3.397909   3.026132    -1.12   0.261     -6.40727    -.388548
        2008 |  -3.211043    2.89761    -1.11   0.268    -6.092594   -.3294923
        2009 |  -3.024178   2.770272    -1.09   0.275    -5.779097   -.2692587
        2010 |  -2.837312    2.64429    -1.07   0.283    -5.466947   -.2076771
        2011 |  -2.650446   2.519867    -1.05   0.293    -5.156348   -.1445451
        2012 |  -2.463581   2.397245    -1.03   0.304     -4.84754   -.0796215
        2013 |  -2.276715   2.276716    -1.00   0.317    -4.540814   -.0126167
        2014 |   -2.08985   2.158631    -0.97   0.333    -4.236517     .056818
        2015 |  -1.902984   2.043413    -0.93   0.352    -3.935072    .1291038
        2016 |  -1.716118   1.931574    -0.89   0.374    -3.636988    .2047511
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     3
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs = 100
                                                           Replications  = 100

                                  (Replications based on 5 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |   .9818344   .6825527     1.44   0.150     .3030645    1.660604
        1998 |   .9382993   .6517182     1.44   0.150      .290193    1.586406
        1999 |   .8947643   .6209753     1.44   0.150     .2772305    1.512298
        2000 |   .8512292   .5903383     1.44   0.149     .2641627    1.438296
        2001 |   .8076942   .5598246     1.44   0.149     .2509722    1.364416
        2002 |   .7641591   .5294554     1.44   0.149      .237638     1.29068
        2003 |   .7206241   .4992572     1.44   0.149     .2241338    1.217114
        2004 |    .677089    .469263     1.44   0.149     .2104267    1.143751
        2005 |   .6335539   .4395146     1.44   0.149     .1964752    1.070633
        2006 |   .5900189   .4100653     1.44   0.150     .1822262    .9978116
        2007 |   .5464838   .3809847     1.43   0.151     .1676106    .9253571
        2008 |   .5029488    .352364     1.43   0.153     .1525376      .85336
        2009 |   .4594137    .324325     1.42   0.157     .1368861    .7819413
        2010 |   .4158787   .2970324     1.40   0.161     .1204924    .7112649
        2011 |   .3723436   .2707122     1.38   0.169     .1031317    .6415555
        2012 |   .3288085    .245677     1.34   0.181     .0844932    .5731239
        2013 |   .2852735   .2223612     1.28   0.200     .0641446    .5064023
        2014 |   .2417384   .2013631     1.20   0.230     .0414913    .4419855
        2015 |   .1982034   .1834801     1.08   0.280     .0157402    .3806666
        2016 |   .1546683   .1696999     0.91   0.362    -.0140911    .3234277
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     4
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs = 100
                                                           Replications  = 100

                                  (Replications based on 5 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |   .0083232   .0064267     1.30   0.195     .0019321    .0147143
        1998 |   .0084552   .0061823     1.37   0.171     .0023071    .0146032
        1999 |   .0085871   .0060172     1.43   0.154     .0026033    .0145709
        2000 |   .0087191   .0059379     1.47   0.142     .0028141    .0146241
        2001 |   .0088511   .0059479     1.49   0.137     .0029361    .0147661
        2002 |   .0089831   .0060469     1.49   0.137     .0029697    .0149965
        2003 |   .0091151   .0062305     1.46   0.143     .0029191     .015311
        2004 |   .0092471   .0064915     1.42   0.154     .0027915    .0157026
        2005 |    .009379   .0068211     1.37   0.169     .0025957    .0161624
        2006 |    .009511   .0072099     1.32   0.187     .0023411     .016681
        2007 |    .009643   .0076489     1.26   0.207     .0020365    .0172495
        2008 |    .009775   .0081299     1.20   0.229     .0016902    .0178598
        2009 |    .009907   .0086459     1.15   0.252      .001309     .018505
        2010 |    .010039   .0091911     1.09   0.275     .0008988    .0191791
        2011 |   .0101709   .0097605     1.04   0.297     .0004646    .0198773
        2012 |   .0103029   .0103501     1.00   0.320     .0000102    .0205957
        2013 |   .0104349   .0109567     0.95   0.341    -.0004611    .0213309
        2014 |   .0105669   .0115777     0.91   0.361    -.0009466    .0220804
        2015 |   .0106989   .0122107     0.88   0.381    -.0014442    .0228419
        2016 |   .0108309   .0128541     0.84   0.399     -.001952    .0236138
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     5
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs = 100
                                                           Replications  = 100

                                  (Replications based on 5 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |   .0410444    .008602     4.77   0.000       .03249    .0495987
        1998 |   .0412986    .007828     5.28   0.000      .033514    .0490832
        1999 |   .0415528   .0070828     5.87   0.000     .0345092    .0485963
        2000 |    .041807   .0063767     6.56   0.000     .0354656    .0481483
        2001 |   .0420612    .005724     7.35   0.000     .0363689    .0477534
        2002 |   .0423154   .0051452     8.22   0.000     .0371987     .047432
        2003 |   .0425695   .0046678     9.12   0.000     .0379276    .0472115
        2004 |   .0428237   .0043256     9.90   0.000     .0385221    .0471254
        2005 |   .0430779   .0041521    10.37   0.000     .0389488     .047207
        2006 |   .0433321   .0041684    10.40   0.000     .0391868    .0474774
        2007 |   .0435863   .0043724     9.97   0.000     .0392381    .0479345
        2008 |   .0438405   .0047399     9.25   0.000     .0391269    .0485542
        2009 |   .0440947   .0052367     8.42   0.000     .0388871    .0493023
        2010 |   .0443489   .0058296     7.61   0.000     .0385516    .0501462
        2011 |   .0446031   .0064926     6.87   0.000     .0381465    .0510597
        2012 |   .0448573   .0072062     6.22   0.000      .037691    .0520235
        2013 |   .0451115   .0079569     5.67   0.000     .0371987    .0530242
        2014 |   .0453657    .008735     5.19   0.000      .036679    .0540523
        2015 |   .0456199    .009534     4.78   0.000     .0361387     .055101
        2016 |    .045874   .0103488     4.43   0.000     .0355826    .0561655
------------------------------------------------------------------------------

. ereturn list

scalars:
                  e(N) =  5
                  e(T) =  20
             e(bwidth) =  6810.760740669452
                  e(k) =  4
                 e(NT) =  100
              e(g_avg) =  20
              e(g_min) =  20
              e(g_max) =  20

macros:
            e(cmdline) : "xtnptimevar lco2_c lgdp_c lgdp_c2 fossil_fuel_prod_c techonol.."
                e(cmd) : "xtnptimevar"
   e(seq_coefse_efftv) : "coefse_tvprime"
  e(seq_coefse_ciul_5) : "coefse_ciul_5"
  e(seq_coefse_cill_5) : "coefse_cill_5"
    e(seq_coefse_se_5) : "coefse_se_5"
     e(seq_coefse_b_5) : "coefse_b_5"
  e(seq_coefse_ciul_4) : "coefse_ciul_4"
  e(seq_coefse_cill_4) : "coefse_cill_4"
    e(seq_coefse_se_4) : "coefse_se_4"
     e(seq_coefse_b_4) : "coefse_b_4"
  e(seq_coefse_ciul_3) : "coefse_ciul_3"
  e(seq_coefse_cill_3) : "coefse_cill_3"
    e(seq_coefse_se_3) : "coefse_se_3"
     e(seq_coefse_b_3) : "coefse_b_3"
  e(seq_coefse_ciul_2) : "coefse_ciul_2"
  e(seq_coefse_cill_2) : "coefse_cill_2"
    e(seq_coefse_se_2) : "coefse_se_2"
     e(seq_coefse_b_2) : "coefse_b_2"
  e(seq_coefse_ciul_1) : "coefse_ciul_1"
  e(seq_coefse_cill_1) : "coefse_cill_1"
    e(seq_coefse_se_1) : "coefse_se_1"
     e(seq_coefse_b_1) : "coefse_b_1"
            e(vcetype) : "Bootstrap"
            e(cluster) : "Number"
               e(seed) : "XAA0000000001b824187be0e3f6c93e403990dfc65b426511daebaecd1252.."
           e(clustvar) : "Number"
            e(stubloc) : "coefse"
           e(nombreco) : "5"
               e(ivar) : "Number"
             e(depvar) : "lco2_c"

functions:
             e(sample)   

. describe coefse_*

Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------------------
coefse_1        double  %10.0g                Coefficient 1, original
coefse_2        double  %10.0g                Coefficient 2, original
coefse_3        double  %10.0g                Coefficient 3, original
coefse_4        double  %10.0g                Coefficient 4, original
coefse_5        double  %10.0g                Coefficient 5, original
coefse_b_1      double  %10.0g                Coefficient-Vector 1, observed
coefse_se_1     double  %10.0g                Std. Err. 1, bootstrapped
coefse_cill_1   double  %10.0g                Lower bound confid. inter. 1, NB
coefse_ciul_1   double  %10.0g                Upper bound confid. inter. 1, NB
coefse_b_2      double  %10.0g                Coefficient-Vector 2, observed
coefse_se_2     double  %10.0g                Std. Err. 2, bootstrapped
coefse_cill_2   double  %10.0g                Lower bound confid. inter. 2, NB
coefse_ciul_2   double  %10.0g                Upper bound confid. inter. 2, NB
coefse_b_3      double  %10.0g                Coefficient-Vector 3, observed
coefse_se_3     double  %10.0g                Std. Err. 3, bootstrapped
coefse_cill_3   double  %10.0g                Lower bound confid. inter. 3, NB
coefse_ciul_3   double  %10.0g                Upper bound confid. inter. 3, NB
coefse_b_4      double  %10.0g                Coefficient-Vector 4, observed
coefse_se_4     double  %10.0g                Std. Err. 4, bootstrapped
coefse_cill_4   double  %10.0g                Lower bound confid. inter. 4, NB
coefse_ciul_4   double  %10.0g                Upper bound confid. inter. 4, NB
coefse_b_5      double  %10.0g                Coefficient-Vector 5, observed
coefse_se_5     double  %10.0g                Std. Err. 5, bootstrapped
coefse_cill_5   double  %10.0g                Lower bound confid. inter. 5, NB
coefse_ciul_5   double  %10.0g                Upper bound confid. inter. 5, NB
coefse_tvprime  float   %9.0g                 Year

. 
. // do the ols and see if the ols estimation result is in the confidence interval
. xtreg lco2_c lgdp_c lgdp_c2 fossil_fuel_prod_c techonology_c if Year<2017 & Region=="NW",
>  fe level(68)

Fixed-effects (within) regression               Number of obs     =        100
Group variable: Number                          Number of groups  =          5

R-squared:                                      Obs per group:
     Within  = 0.9487                                         min =         20
     Between = 0.7907                                         avg =       20.0
     Overall = 0.8665                                         max =         20

                                                F(4,91)           =     420.62
corr(u_i, Xb) = -0.4659                         Prob > F          =     0.0000

------------------------------------------------------------------------------------
            lco2_c | Coefficient  Std. err.      t    P>|t|     [68% conf. interval]
-------------------+----------------------------------------------------------------
            lgdp_c |   1.659826   .2083718     7.97   0.000      1.45147    1.868181
           lgdp_c2 |  -.0711188   .0320549    -2.22   0.029    -.1031712   -.0390664
fossil_fuel_prod_c |   .0001637   .0011244     0.15   0.885    -.0009607    .0012881
     techonology_c |    .051977   .0019784    26.27   0.000     .0499987    .0539553
             _cons |  -4.263361   .3516033   -12.13   0.000    -4.614936   -3.911785
-------------------+----------------------------------------------------------------
           sigma_u |  .34939525
           sigma_e |  .21625171
               rho |  .72302599   (fraction of variance due to u_i)
------------------------------------------------------------------------------------
F test that all u_i=0: F(4, 91) = 29.91                      Prob > F = 0.0000

. 
. // cross sectional dependence test
. xtcsd, pesaran abs
 
Pesaran's test of cross sectional independence =    -0.396, Pr = 1.3081
 
Average absolute value of the off-diagonal elements =     0.545

. xtcsd, friedman
 
Friedman's test of cross sectional independence =    20.223, Pr = 0.0005

. 
. 
. // South China (S)
. xtnptimevar lco2_c lgdp_c lgdp_c2 fossil_fuel_prod_c techonology_c if Year<2017 & Region=
> ="S", stub(coefsw) alle bootstrap bootoptions(reps(100) seed(28845080) level(68)) matsize
> (800) forcereg title(trend function, lgdp, lgdp2, ff, tech) saving("/Users/yuehenghu/Desk
> top/RP/Stata_RP/mystatagraphs")

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     1
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)
(file coefsw_bootds.dta not found)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  60
                                                           Replications  = 100

                                  (Replications based on 3 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |  -5.222389   4.292662    -1.22   0.224     -9.49126   -.9535172
        1998 |  -5.432965   4.263983    -1.27   0.203    -9.673316   -1.192613
        1999 |   -5.64354   4.237558    -1.33   0.183    -9.857613   -1.429468
        2000 |  -5.854116   4.213427    -1.39   0.165    -10.04419    -1.66404
        2001 |  -6.064692   4.191631    -1.45   0.148    -10.23309   -1.896291
        2002 |  -6.275268   4.172207    -1.50   0.133    -10.42435   -2.126183
        2003 |  -6.485843   4.155188    -1.56   0.119      -10.618   -2.353684
        2004 |  -6.696419   4.140603    -1.62   0.106    -10.81407   -2.578764
        2005 |  -6.906995   4.128478    -1.67   0.094    -11.01259   -2.801397
        2006 |   -7.11757   4.118835    -1.73   0.084    -11.21358   -3.021562
        2007 |  -7.328146   4.111691    -1.78   0.075    -11.41705   -3.239242
        2008 |  -7.538721    4.10706    -1.84   0.066    -11.62302   -3.454423
        2009 |  -7.749297    4.10495    -1.89   0.059     -11.8315   -3.667097
        2010 |  -7.959873   4.105365    -1.94   0.053    -12.04248    -3.87726
        2011 |  -8.170448   4.108304    -1.99   0.047    -12.25598   -4.084913
        2012 |  -8.381024   4.113761    -2.04   0.042    -12.47199   -4.290061
        2013 |  -8.591599   4.121727    -2.08   0.037    -12.69048   -4.492715
        2014 |  -8.802174   4.132188    -2.13   0.033    -12.91146   -4.692888
        2015 |   -9.01275   4.145123    -2.17   0.030     -13.1349   -4.890599
        2016 |  -9.223325   4.160511    -2.22   0.027    -13.36078   -5.085872
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     2
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  60
                                                           Replications  = 100

                                  (Replications based on 3 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |   2.020977   2.806205     0.72   0.471    -.7696755    4.811629
        1998 |   2.082914   2.712144     0.77   0.442    -.6141984    4.780027
        1999 |   2.144852   2.618538     0.82   0.413    -.4591741    4.748878
        2000 |   2.206789   2.525439     0.87   0.382     -.304653    4.718232
        2001 |   2.268727   2.432903     0.93   0.351    -.1506927    4.688146
        2002 |   2.330664   2.340998     1.00   0.319     .0026401    4.658688
        2003 |   2.392602   2.249802     1.06   0.288     .1552686    4.629935
        2004 |   2.454539   2.159403     1.14   0.256     .3071036    4.601975
        2005 |   2.516477   2.069907     1.22   0.224     .4580411    4.574912
        2006 |   2.578414   1.981436     1.30   0.193     .6079595    4.548869
        2007 |   2.640352   1.894133     1.39   0.163     .7567159    4.523988
        2008 |   2.702289   1.808168     1.49   0.135     .9041422    4.500437
        2009 |   2.764227   1.723741     1.60   0.109     1.050039    4.478415
        2010 |   2.826164   1.641089     1.72   0.085     1.194171    4.458158
        2011 |   2.888102   1.560494     1.85   0.064     1.336257    4.439947
        2012 |    2.95004   1.482292     1.99   0.047     1.475963    4.424116
        2013 |   3.011977   1.406881     2.14   0.032     1.612893    4.411061
        2014 |   3.073915   1.334736     2.30   0.021     1.746576    4.401254
        2015 |   3.135852   1.266414     2.48   0.013     1.876457    4.395248
        2016 |    3.19779   1.202568     2.66   0.008     2.001887    4.393693
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     3
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  60
                                                           Replications  = 100

                                  (Replications based on 3 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |  -.1509823   .3813102    -0.40   0.692    -.5301792    .2282147
        1998 |  -.1552887   .3637645    -0.43   0.669    -.5170372    .2064598
        1999 |  -.1595952   .3462565    -0.46   0.645    -.5039327    .1847423
        2000 |  -.1639016   .3287922    -0.50   0.618    -.4908716    .1630684
        2001 |  -.1682081    .311379    -0.54   0.589    -.4778613    .1414452
        2002 |  -.1725145   .2940258    -0.59   0.557    -.4649108    .1198818
        2003 |   -.176821   .2767441    -0.64   0.523    -.4520314    .0983894
        2004 |  -.1811274   .2595481    -0.70   0.485    -.4392371    .0769823
        2005 |  -.1854339   .2424561    -0.76   0.444    -.4265462    .0556785
        2006 |  -.1897403   .2254916    -0.84   0.400    -.4139822    .0345015
        2007 |  -.1940468   .2086858    -0.93   0.352     -.401576    .0134824
        2008 |  -.1983533   .1920803    -1.03   0.302     -.389369   -.0073375
        2009 |  -.2026597   .1757319    -1.15   0.249    -.3774177   -.0279018
        2010 |  -.2069662   .1597196    -1.30   0.195    -.3658006   -.0481318
        2011 |  -.2112726   .1441554    -1.47   0.143    -.3546291   -.0679162
        2012 |  -.2155791   .1292013    -1.67   0.095    -.3440644   -.0870938
        2013 |  -.2198856   .1150955    -1.91   0.056    -.3343432   -.1054279
        2014 |   -.224192   .1021898    -2.19   0.028    -.3258155   -.1225686
        2015 |  -.2284985   .0909962    -2.51   0.012    -.3189904   -.1380066
        2016 |   -.232805    .082217    -2.83   0.005    -.3145663   -.1510436
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     4
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  60
                                                           Replications  = 100

                                  (Replications based on 3 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |  -.0099977   .0107197    -0.93   0.351     -.020658    .0006626
        1998 |  -.0124388   .0129718    -0.96   0.338    -.0253388    .0004611
        1999 |    -.01488   .0154459    -0.96   0.335    -.0302402    .0004803
        2000 |  -.0173211   .0180508    -0.96   0.337    -.0352719    .0006296
        2001 |  -.0197622   .0207373    -0.95   0.341    -.0403847    .0008602
        2002 |  -.0222034   .0234775    -0.95   0.344    -.0455508     .001144
        2003 |  -.0246445   .0262545    -0.94   0.348    -.0507535    .0014645
        2004 |  -.0270857   .0290578    -0.93   0.351    -.0559824    .0018111
        2005 |  -.0295268   .0318804    -0.93   0.354    -.0612305    .0021769
        2006 |  -.0319679   .0347176    -0.92   0.357    -.0664931    .0025573
        2007 |   -.034409   .0375662    -0.92   0.360     -.071767     .002949
        2008 |  -.0368502   .0404237    -0.91   0.362    -.0770498    .0033495
        2009 |  -.0392913   .0432883    -0.91   0.364    -.0823397    .0037571
        2010 |  -.0417324   .0461588    -0.90   0.366    -.0876354    .0041705
        2011 |  -.0441735    .049034    -0.90   0.368    -.0929358    .0045887
        2012 |  -.0466147   .0519133    -0.90   0.369    -.0982402    .0050109
        2013 |  -.0490558   .0547959    -0.90   0.371     -.103548    .0054364
        2014 |  -.0514969   .0576814    -0.89   0.372    -.1088586    .0058648
        2015 |   -.053938   .0605693    -0.89   0.373    -.1141716    .0062956
        2016 |  -.0563791   .0634594    -0.89   0.374    -.1194868    .0067286
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     5
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  60
                                                           Replications  = 100

                                  (Replications based on 3 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |    .143464   .0323657     4.43   0.000     .1112776    .1756503
        1998 |   .1508972   .0341346     4.42   0.000     .1169518    .1848427
        1999 |   .1583305   .0375056     4.22   0.000     .1210327    .1956282
        2000 |   .1657637   .0420954     3.94   0.000     .1239016    .2076258
        2001 |   .1731969   .0475525     3.64   0.000      .125908    .2204858
        2002 |   .1806301   .0536126     3.37   0.001     .1273146    .2339456
        2003 |   .1880633   .0600937     3.13   0.002     .1283027    .2478239
        2004 |   .1954965   .0668733     2.92   0.003     .1289938    .2619992
        2005 |   .2029297   .0738694     2.75   0.006     .1294697    .2763898
        2006 |   .2103629    .081026     2.60   0.009      .129786    .2909398
        2007 |   .2177961   .0883039     2.47   0.014     .1299816    .3056106
        2008 |   .2252293   .0956755     2.35   0.019      .130084    .3203746
        2009 |   .2326625   .1031208     2.26   0.024     .1301132    .3352118
        2010 |   .2400956   .1106248     2.17   0.030     .1300839    .3501073
        2011 |   .2475288   .1181764     2.09   0.036     .1300074    .3650502
        2012 |    .254962   .1257669     2.03   0.043     .1298921    .3800319
        2013 |   .2623951   .1333898     1.97   0.049     .1297446    .3950456
        2014 |   .2698283   .1410398     1.91   0.056     .1295702    .4100864
        2015 |   .2772614   .1487126     1.86   0.062     .1293729    .4251499
        2016 |   .2846945   .1564051     1.82   0.069     .1291563    .4402328
------------------------------------------------------------------------------

. ereturn list

scalars:
                  e(N) =  3
                  e(T) =  20
             e(bwidth) =  319.009231322778
                  e(k) =  4
                 e(NT) =  60
              e(g_avg) =  20
              e(g_min) =  20
              e(g_max) =  20

macros:
            e(cmdline) : "xtnptimevar lco2_c lgdp_c lgdp_c2 fossil_fuel_prod_c techonol.."
                e(cmd) : "xtnptimevar"
   e(seq_coefsw_efftv) : "coefsw_tvprime"
  e(seq_coefsw_ciul_5) : "coefsw_ciul_5"
  e(seq_coefsw_cill_5) : "coefsw_cill_5"
    e(seq_coefsw_se_5) : "coefsw_se_5"
     e(seq_coefsw_b_5) : "coefsw_b_5"
  e(seq_coefsw_ciul_4) : "coefsw_ciul_4"
  e(seq_coefsw_cill_4) : "coefsw_cill_4"
    e(seq_coefsw_se_4) : "coefsw_se_4"
     e(seq_coefsw_b_4) : "coefsw_b_4"
  e(seq_coefsw_ciul_3) : "coefsw_ciul_3"
  e(seq_coefsw_cill_3) : "coefsw_cill_3"
    e(seq_coefsw_se_3) : "coefsw_se_3"
     e(seq_coefsw_b_3) : "coefsw_b_3"
  e(seq_coefsw_ciul_2) : "coefsw_ciul_2"
  e(seq_coefsw_cill_2) : "coefsw_cill_2"
    e(seq_coefsw_se_2) : "coefsw_se_2"
     e(seq_coefsw_b_2) : "coefsw_b_2"
  e(seq_coefsw_ciul_1) : "coefsw_ciul_1"
  e(seq_coefsw_cill_1) : "coefsw_cill_1"
    e(seq_coefsw_se_1) : "coefsw_se_1"
     e(seq_coefsw_b_1) : "coefsw_b_1"
            e(vcetype) : "Bootstrap"
            e(cluster) : "Number"
               e(seed) : "XAA0000000001b824187be0e3f6c93e403990dfc65b426511daebaecd1252.."
           e(clustvar) : "Number"
            e(stubloc) : "coefsw"
           e(nombreco) : "5"
               e(ivar) : "Number"
             e(depvar) : "lco2_c"

functions:
             e(sample)   

. describe coefsw_*

Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------------------
coefsw_1        double  %10.0g                Coefficient 1, original
coefsw_2        double  %10.0g                Coefficient 2, original
coefsw_3        double  %10.0g                Coefficient 3, original
coefsw_4        double  %10.0g                Coefficient 4, original
coefsw_5        double  %10.0g                Coefficient 5, original
coefsw_b_1      double  %10.0g                Coefficient-Vector 1, observed
coefsw_se_1     double  %10.0g                Std. Err. 1, bootstrapped
coefsw_cill_1   double  %10.0g                Lower bound confid. inter. 1, NB
coefsw_ciul_1   double  %10.0g                Upper bound confid. inter. 1, NB
coefsw_b_2      double  %10.0g                Coefficient-Vector 2, observed
coefsw_se_2     double  %10.0g                Std. Err. 2, bootstrapped
coefsw_cill_2   double  %10.0g                Lower bound confid. inter. 2, NB
coefsw_ciul_2   double  %10.0g                Upper bound confid. inter. 2, NB
coefsw_b_3      double  %10.0g                Coefficient-Vector 3, observed
coefsw_se_3     double  %10.0g                Std. Err. 3, bootstrapped
coefsw_cill_3   double  %10.0g                Lower bound confid. inter. 3, NB
coefsw_ciul_3   double  %10.0g                Upper bound confid. inter. 3, NB
coefsw_b_4      double  %10.0g                Coefficient-Vector 4, observed
coefsw_se_4     double  %10.0g                Std. Err. 4, bootstrapped
coefsw_cill_4   double  %10.0g                Lower bound confid. inter. 4, NB
coefsw_ciul_4   double  %10.0g                Upper bound confid. inter. 4, NB
coefsw_b_5      double  %10.0g                Coefficient-Vector 5, observed
coefsw_se_5     double  %10.0g                Std. Err. 5, bootstrapped
coefsw_cill_5   double  %10.0g                Lower bound confid. inter. 5, NB
coefsw_ciul_5   double  %10.0g                Upper bound confid. inter. 5, NB
coefsw_tvprime  float   %9.0g                 Year

. 
. // do the ols and see if the ols estimation result is in the confidence interval
. xtreg lco2_c lgdp_c lgdp_c2 fossil_fuel_prod_c techonology_c if Year<2017 & Region=="S", 
> fe level(68)

Fixed-effects (within) regression               Number of obs     =         60
Group variable: Number                          Number of groups  =          3

R-squared:                                      Obs per group:
     Within  = 0.9637                                         min =         20
     Between = 1.0000                                         avg =       20.0
     Overall = 0.9667                                         max =         20

                                                F(4,53)           =     351.74
corr(u_i, Xb) = 0.2813                          Prob > F          =     0.0000

------------------------------------------------------------------------------------
            lco2_c | Coefficient  Std. err.      t    P>|t|     [68% conf. interval]
-------------------+----------------------------------------------------------------
            lgdp_c |   1.854326   .1903302     9.74   0.000     1.663259    2.045394
           lgdp_c2 |   -.111644   .0269768    -4.14   0.000    -.1387254   -.0845626
fossil_fuel_prod_c |  -.0130064   .0059673    -2.18   0.034    -.0189968   -.0070159
     techonology_c |   .1659493   .0131368    12.63   0.000     .1527617     .179137
             _cons |  -5.360287   .3505037   -15.29   0.000    -5.712149   -5.008425
-------------------+----------------------------------------------------------------
           sigma_u |  .01056384
           sigma_e |  .15642584
               rho |  .00453994   (fraction of variance due to u_i)
------------------------------------------------------------------------------------
F test that all u_i=0: F(2, 53) = 0.07                       Prob > F = 0.9326

. 
. // cross sectional dependence test
. xtcsd, pesaran abs
 
Pesaran's test of cross sectional independence =    -2.260, Pr = 1.9762
 
Average absolute value of the off-diagonal elements =     0.292

. xtcsd, friedman
 
Friedman's test of cross sectional independence =    14.829, Pr = 0.0006

. 
. 
. 
. // Southwest (SW)
. xtnptimevar lco2_c lgdp_c lgdp_c2 fossil_fuel_prod_c techonology_c if Year<2017 & Region=
> ="SW", stub(coefsw) alle bootstrap bootoptions(reps(100) seed(28845080) level(68)) matsiz
> e(800) forcereg title(trend function, lgdp, lgdp2, ff, tech) saving("/Users/yuehenghu/Des
> ktop/RP/Stata_RP/mystatagraphs")

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     1
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)
(file coefsw_bootds.dta not found)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  80
                                                           Replications  = 100

                                  (Replications based on 4 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |  -.8592749   .7306976    -1.18   0.240    -1.585923   -.1326269
        1998 |  -1.175075   .6838632    -1.72   0.086    -1.855148   -.4950015
        1999 |  -1.490874    .640195    -2.33   0.020    -2.127521   -.8542275
        2000 |  -1.806674   .6003841    -3.01   0.003    -2.403731   -1.209617
        2001 |  -2.122474   .5652463    -3.75   0.000    -2.684588    -1.56036
        2002 |  -2.438274   .5357017    -4.55   0.000    -2.971006   -1.905541
        2003 |  -2.754073   .5127182    -5.37   0.000     -3.26395   -2.244197
        2004 |  -3.069873   .4972066    -6.17   0.000    -3.564324   -2.575422
        2005 |  -3.385673   .4898772    -6.91   0.000    -3.872835   -2.898511
        2006 |  -3.701473   .4910963    -7.54   0.000    -4.189847   -3.213098
        2007 |  -4.017273   .5008016    -8.02   0.000    -4.515299   -3.519246
        2008 |  -4.333072   .5185168    -8.36   0.000    -4.848715   -3.817429
        2009 |  -4.648872   .5434591    -8.55   0.000    -5.189319   -4.108425
        2010 |  -4.964672   .5746883    -8.64   0.000    -5.536175   -4.393169
        2011 |  -5.280472   .6112415    -8.64   0.000    -5.888326   -4.672618
        2012 |  -5.596271   .6522243    -8.58   0.000    -6.244881   -4.947662
        2013 |  -5.912071   .6968555    -8.48   0.000    -6.605065   -5.219078
        2014 |  -6.227871   .7444793    -8.37   0.000    -6.968224   -5.487518
        2015 |  -6.543671   .7945576    -8.24   0.000    -7.333825   -5.753517
        2016 |  -6.859471   .8466552    -8.10   0.000    -7.701434   -6.017508
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     2
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  80
                                                           Replications  = 100

                                  (Replications based on 4 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |   .4756169   .4046971     1.18   0.240     .0731627    .8780711
        1998 |   .6120392   .3660354     1.67   0.095     .2480324     .976046
        1999 |   .7484615     .33315     2.25   0.025     .4171579    1.079765
        2000 |   .8848839   .3078972     2.87   0.004     .5786931    1.191075
        2001 |   1.021306   .2922621     3.49   0.000     .7306638    1.311949
        2002 |   1.157729   .2878166     4.02   0.000     .8715071     1.44395
        2003 |   1.294151   .2950668     4.39   0.000     1.000719    1.587582
        2004 |   1.430573   .3132015     4.57   0.000     1.119108    1.742039
        2005 |   1.566996    .340486     4.60   0.000     1.228397    1.905595
        2006 |   1.703418    .374928     4.54   0.000     1.330568    2.076268
        2007 |    1.83984   .4147481     4.44   0.000     1.427391     2.25229
        2008 |   1.976263   .4585475     4.31   0.000     1.520256    2.432269
        2009 |   2.112685   .5052923     4.18   0.000     1.610193    2.615177
        2010 |   2.249107   .5542379     4.06   0.000     1.697941    2.800273
        2011 |    2.38553   .6048501     3.94   0.000     1.784032    2.987028
        2012 |   2.521952   .6567439     3.84   0.000     1.868848    3.175056
        2013 |   2.658374    .709638     3.75   0.000     1.952669    3.364079
        2014 |   2.794797   .7633245     3.66   0.000     2.035703    3.553891
        2015 |   2.931219   .8176475     3.58   0.000     2.118103    3.744335
        2016 |   3.067641    .872488     3.52   0.000     2.199989    3.935294
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     3
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  80
                                                           Replications  = 100

                                  (Replications based on 4 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |   .0271731   .0536547     0.51   0.613    -.0261843    .0805304
        1998 |   .0102759   .0535515     0.19   0.848    -.0429789    .0635306
        1999 |  -.0066214   .0546251    -0.12   0.904    -.0609437     .047701
        2000 |  -.0235186   .0568087    -0.41   0.679    -.0800125    .0329753
        2001 |  -.0404158   .0599812    -0.67   0.500    -.1000646     .019233
        2002 |   -.057313   .0639958    -0.90   0.370    -.1209541    .0063281
        2003 |  -.0742102   .0687049    -1.08   0.280    -.1425344   -.0058861
        2004 |  -.0911075   .0739761    -1.23   0.218    -.1646736   -.0175413
        2005 |  -.1080047   .0796979    -1.36   0.175    -.1872609   -.0287485
        2006 |  -.1249019   .0857802    -1.46   0.145    -.2102067   -.0395971
        2007 |  -.1417991   .0921516    -1.54   0.124      -.23344   -.0501582
        2008 |  -.1586963   .0987562    -1.61   0.108    -.2569052   -.0604875
        2009 |  -.1755936   .1055502    -1.66   0.096    -.2805588   -.0706283
        2010 |  -.1924908   .1124994    -1.71   0.087    -.3043667   -.0806149
        2011 |   -.209388   .1195766    -1.75   0.080    -.3283019   -.0904742
        2012 |  -.2262852   .1267604    -1.79   0.074    -.3523431   -.1002274
        2013 |  -.2431824   .1340337    -1.81   0.070    -.3764733   -.1098916
        2014 |  -.2600797   .1413827    -1.84   0.066    -.4006788   -.1194806
        2015 |  -.2769769   .1487961    -1.86   0.063    -.4249483   -.1290054
        2016 |  -.2938741   .1562648    -1.88   0.060    -.4492729   -.1384753
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     4
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  80
                                                           Replications  = 100

                                  (Replications based on 4 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |  -.0007709   .0035051    -0.22   0.826    -.0042566    .0027147
        1998 |   -.000928   .0027868    -0.33   0.739    -.0036993    .0018434
        1999 |   -.001085   .0022372    -0.48   0.628    -.0033098    .0011398
        2000 |   -.001242   .0020005    -0.62   0.535    -.0032315    .0007474
        2001 |  -.0013991   .0021811    -0.64   0.521    -.0035681      .00077
        2002 |  -.0015561   .0026964    -0.58   0.564    -.0042376    .0011254
        2003 |  -.0017131   .0033974    -0.50   0.614    -.0050917    .0016654
        2004 |  -.0018702   .0041919    -0.45   0.655    -.0060388    .0022985
        2005 |  -.0020272   .0050358    -0.40   0.687    -.0070351    .0029807
        2006 |  -.0021842   .0059081    -0.37   0.712    -.0080596    .0036911
        2007 |  -.0023413   .0067978    -0.34   0.731    -.0091014    .0044188
        2008 |  -.0024983   .0076989    -0.32   0.746    -.0101545    .0051579
        2009 |  -.0026554   .0086077    -0.31   0.758    -.0112154    .0059047
        2010 |  -.0028124   .0095222    -0.30   0.768    -.0122818     .006657
        2011 |  -.0029694   .0104407    -0.28   0.776    -.0133523    .0074134
        2012 |  -.0031265   .0113624    -0.28   0.783    -.0144259    .0081729
        2013 |  -.0032835   .0122864    -0.27   0.789    -.0155018    .0089349
        2014 |  -.0034405   .0132124    -0.26   0.795    -.0165797    .0096987
        2015 |  -.0035976   .0141399    -0.25   0.799    -.0176591     .010464
        2016 |  -.0037546   .0150687    -0.25   0.803    -.0187398    .0112306
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     5
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  80
                                                           Replications  = 100

                                  (Replications based on 4 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |   .0145175   .0085407     1.70   0.089     .0060241    .0230108
        1998 |   .0185724   .0094782     1.96   0.050     .0091467     .027998
        1999 |   .0226272   .0104651     2.16   0.031     .0122201    .0330343
        2000 |   .0266821   .0114887     2.32   0.020     .0152571    .0381071
        2001 |    .030737   .0125401     2.45   0.014     .0182664    .0432075
        2002 |   .0347918   .0136127     2.56   0.011     .0212546    .0483291
        2003 |   .0388467    .014702     2.64   0.008     .0242262    .0534672
        2004 |   .0429016   .0158045     2.71   0.007     .0271847    .0586185
        2005 |   .0469564   .0169176     2.78   0.006     .0301326    .0637803
        2006 |   .0510113   .0180394     2.83   0.005     .0330719    .0689507
        2007 |   .0550662   .0191683     2.87   0.004     .0360041    .0741282
        2008 |    .059121   .0203031     2.91   0.004     .0389304    .0793117
        2009 |   .0631759    .021443     2.95   0.003     .0418518    .0845001
        2010 |   .0672308   .0225871     2.98   0.003     .0447689    .0896927
        2011 |   .0712857   .0237348     3.00   0.003     .0476824    .0948889
        2012 |   .0753405   .0248857     3.03   0.002     .0505928    .1000883
        2013 |   .0793954   .0260392     3.05   0.002     .0535005    .1052903
        2014 |   .0834503   .0271951     3.07   0.002     .0564058    .1104947
        2015 |   .0875051   .0283532     3.09   0.002     .0593091    .1157012
        2016 |     .09156    .029513     3.10   0.002     .0622106    .1209094
------------------------------------------------------------------------------

. ereturn list

scalars:
                  e(N) =  4
                  e(T) =  20
             e(bwidth) =  1886.643750192098
                  e(k) =  4
                 e(NT) =  80
              e(g_avg) =  20
              e(g_min) =  20
              e(g_max) =  20

macros:
            e(cmdline) : "xtnptimevar lco2_c lgdp_c lgdp_c2 fossil_fuel_prod_c techonol.."
                e(cmd) : "xtnptimevar"
   e(seq_coefsw_efftv) : "coefsw_tvprime"
  e(seq_coefsw_ciul_5) : "coefsw_ciul_5"
  e(seq_coefsw_cill_5) : "coefsw_cill_5"
    e(seq_coefsw_se_5) : "coefsw_se_5"
     e(seq_coefsw_b_5) : "coefsw_b_5"
  e(seq_coefsw_ciul_4) : "coefsw_ciul_4"
  e(seq_coefsw_cill_4) : "coefsw_cill_4"
    e(seq_coefsw_se_4) : "coefsw_se_4"
     e(seq_coefsw_b_4) : "coefsw_b_4"
  e(seq_coefsw_ciul_3) : "coefsw_ciul_3"
  e(seq_coefsw_cill_3) : "coefsw_cill_3"
    e(seq_coefsw_se_3) : "coefsw_se_3"
     e(seq_coefsw_b_3) : "coefsw_b_3"
  e(seq_coefsw_ciul_2) : "coefsw_ciul_2"
  e(seq_coefsw_cill_2) : "coefsw_cill_2"
    e(seq_coefsw_se_2) : "coefsw_se_2"
     e(seq_coefsw_b_2) : "coefsw_b_2"
  e(seq_coefsw_ciul_1) : "coefsw_ciul_1"
  e(seq_coefsw_cill_1) : "coefsw_cill_1"
    e(seq_coefsw_se_1) : "coefsw_se_1"
     e(seq_coefsw_b_1) : "coefsw_b_1"
            e(vcetype) : "Bootstrap"
            e(cluster) : "Number"
               e(seed) : "XAA0000000001b824187be0e3f6c93e403990dfc65b426511daebaecd1252.."
           e(clustvar) : "Number"
            e(stubloc) : "coefsw"
           e(nombreco) : "5"
               e(ivar) : "Number"
             e(depvar) : "lco2_c"

functions:
             e(sample)   

. describe coefsw_*

Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------------------
coefsw_1        double  %10.0g                Coefficient 1, original
coefsw_2        double  %10.0g                Coefficient 2, original
coefsw_3        double  %10.0g                Coefficient 3, original
coefsw_4        double  %10.0g                Coefficient 4, original
coefsw_5        double  %10.0g                Coefficient 5, original
coefsw_b_1      double  %10.0g                Coefficient-Vector 1, observed
coefsw_se_1     double  %10.0g                Std. Err. 1, bootstrapped
coefsw_cill_1   double  %10.0g                Lower bound confid. inter. 1, NB
coefsw_ciul_1   double  %10.0g                Upper bound confid. inter. 1, NB
coefsw_b_2      double  %10.0g                Coefficient-Vector 2, observed
coefsw_se_2     double  %10.0g                Std. Err. 2, bootstrapped
coefsw_cill_2   double  %10.0g                Lower bound confid. inter. 2, NB
coefsw_ciul_2   double  %10.0g                Upper bound confid. inter. 2, NB
coefsw_b_3      double  %10.0g                Coefficient-Vector 3, observed
coefsw_se_3     double  %10.0g                Std. Err. 3, bootstrapped
coefsw_cill_3   double  %10.0g                Lower bound confid. inter. 3, NB
coefsw_ciul_3   double  %10.0g                Upper bound confid. inter. 3, NB
coefsw_b_4      double  %10.0g                Coefficient-Vector 4, observed
coefsw_se_4     double  %10.0g                Std. Err. 4, bootstrapped
coefsw_cill_4   double  %10.0g                Lower bound confid. inter. 4, NB
coefsw_ciul_4   double  %10.0g                Upper bound confid. inter. 4, NB
coefsw_b_5      double  %10.0g                Coefficient-Vector 5, observed
coefsw_se_5     double  %10.0g                Std. Err. 5, bootstrapped
coefsw_cill_5   double  %10.0g                Lower bound confid. inter. 5, NB
coefsw_ciul_5   double  %10.0g                Upper bound confid. inter. 5, NB
coefsw_tvprime  float   %9.0g                 Year

. 
. // do the ols and see if the ols estimation result is in the confidence interval
. xtreg lco2_c lgdp_c lgdp_c2 fossil_fuel_prod_c techonology_c if Year<2017 & Region=="SW",
>  fe level(68)

Fixed-effects (within) regression               Number of obs     =         80
Group variable: Number                          Number of groups  =          4

R-squared:                                      Obs per group:
     Within  = 0.9532                                         min =         20
     Between = 0.0902                                         avg =       20.0
     Overall = 0.7757                                         max =         20

                                                F(4,72)           =     366.68
corr(u_i, Xb) = -0.0144                         Prob > F          =     0.0000

------------------------------------------------------------------------------------
            lco2_c | Coefficient  Std. err.      t    P>|t|     [68% conf. interval]
-------------------+----------------------------------------------------------------
            lgdp_c |   1.788261   .1146647    15.60   0.000     1.673438    1.903083
           lgdp_c2 |  -.1897479   .0173698   -10.92   0.000    -.2071416   -.1723542
fossil_fuel_prod_c |  -.0044697   .0017458    -2.56   0.013     -.006218   -.0027215
     techonology_c |   .0188602   .0019992     9.43   0.000     .0168582    .0208621
             _cons |  -2.703772   .1967737   -13.74   0.000    -2.900816   -2.506728
-------------------+----------------------------------------------------------------
           sigma_u |   .2669912
           sigma_e |  .10871488
               rho |   .8577802   (fraction of variance due to u_i)
------------------------------------------------------------------------------------
F test that all u_i=0: F(3, 72) = 46.65                      Prob > F = 0.0000

. 
. // cross sectional dependence test
. xtcsd, pesaran abs
 
Pesaran's test of cross sectional independence =    -0.546, Pr = 1.4146
 
Average absolute value of the off-diagonal elements =     0.215

. xtcsd, friedman
 
Friedman's test of cross sectional independence =    17.457, Pr = 0.0006

. 
. 
. 
. // The following part just aims to show that when switching the bandwidth to be the same 
> as those selected by the R package, the estimated results turn to be very similar to thos
> e produced by R, in terms of the piece-wise estimated value and overall trend. We benefit
> ed the well-developed packa in R to implement model diagonostics.
. 
. // C
. xtnptimevar lco2_c lgdp_c lgdp_c2 fossil_fuel_prod_c techonology_c if Year<2017 & Region=
> ="C", stub(coefsc) bwidth(0.6004) alle bootstrap bootoptions(reps(100) seed(28845080)  le
> vel(68)) matsize(800) forcereg title(trend function, lgdp, lgdp2, ff, tech) saving("/User
> s/yuehenghu/Desktop/RP/Stata_RP/mystatagraphs")

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     1
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)
(file coefsc_bootds.dta not found)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  60
                                                           Replications  = 100

                                  (Replications based on 3 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |  -2.457815   1.245927    -1.97   0.049    -3.696837   -1.218794
        1998 |  -2.564717   1.170763    -2.19   0.028    -3.728991   -1.400443
        1999 |  -2.635485   1.241134    -2.12   0.034    -3.869741   -1.401229
        2000 |  -2.724987   1.233654    -2.21   0.027    -3.951804    -1.49817
        2001 |  -2.813142   .6603273    -4.26   0.000    -3.469809   -2.156474
        2002 |  -2.873718   .5472961    -5.25   0.000    -3.417981   -2.329455
        2003 |  -2.984903   .5936708    -5.03   0.000    -3.575283   -2.394522
        2004 |  -3.152356   .6488057    -4.86   0.000    -3.797566   -2.507146
        2005 |  -3.421848   .6485966    -5.28   0.000     -4.06685   -2.776846
        2006 |  -3.657974     .65677    -5.57   0.000    -4.311104   -3.004844
        2007 |  -3.906422   .6648514    -5.88   0.000    -4.567589   -3.245255
        2008 |  -4.203522   .6736075    -6.24   0.000    -4.873397   -3.533648
        2009 |  -4.655786   .7008874    -6.64   0.000    -5.352789   -3.958783
        2010 |  -5.045486   .9540347    -5.29   0.000    -5.994233   -4.096738
        2011 |  -5.808914    1.09482    -5.31   0.000    -6.897667   -4.720162
        2012 |   -7.07998   1.434006    -4.94   0.000    -8.506038   -5.653921
        2013 |   -9.13483   2.167565    -4.21   0.000    -11.29038   -6.979278
        2014 |   -12.2298   2.732215    -4.48   0.000    -14.94687   -9.512725
        2015 |   -15.9838   5.443838    -2.94   0.003    -21.39747   -10.57014
        2016 |  -19.73246   8.062914    -2.45   0.014    -27.75069   -11.71423
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     2
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  60
                                                           Replications  = 100

                                  (Replications based on 3 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |   .9671845   1.121129     0.86   0.388    -.1477315      2.0821
        1998 |   1.001981   .9803667     1.02   0.307     .0270476    1.976914
        1999 |   1.007848   1.018669     0.99   0.322    -.0051754    2.020872
        2000 |   1.027454    .987344     1.04   0.298     .0455819    2.009326
        2001 |   1.039018   .4777254     2.17   0.030     .5639404    1.514096
        2002 |   1.025309   .3873765     2.65   0.008     .6400797    1.410539
        2003 |   1.051557   .3954773     2.66   0.008     .6582716    1.444843
        2004 |   1.121334   .3889284     2.88   0.004     .7345612    1.508107
        2005 |    1.26081   .3496827     3.61   0.000     .9130651    1.608555
        2006 |   1.368835   .3409229     4.02   0.000     1.029801    1.707868
        2007 |   1.478809   .3405776     4.34   0.000     1.140119      1.8175
        2008 |    1.61013    .346895     4.64   0.000     1.265158    1.955102
        2009 |   1.812613   .3533603     5.13   0.000     1.461212    2.164015
        2010 |   1.979755   .4997913     3.96   0.000     1.482733    2.476776
        2011 |   2.306051   .5761394     4.00   0.000     1.733104    2.878997
        2012 |   2.839757   .6912626     4.11   0.000     2.152325    3.527188
        2013 |   3.698852   .9866925     3.75   0.000     2.717628    4.680076
        2014 |   4.989666   1.334701     3.74   0.000     3.662362     6.31697
        2015 |    6.52487   2.528408     2.58   0.010     4.010474    9.039265
        2016 |   7.952124   3.652105     2.18   0.029     4.320259    11.58399
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     3
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  60
                                                           Replications  = 100

                                  (Replications based on 3 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |   .0018153   .2500546     0.01   0.994    -.2468535    .2504841
        1998 |  -.0041733   .1887727    -0.02   0.982    -.1918998    .1835531
        1999 |  -.0055562   .1944978    -0.03   0.977    -.1989761    .1878636
        2000 |  -.0099676   .1851214    -0.05   0.957     -.194063    .1741279
        2001 |  -.0112128   .0811579    -0.14   0.890     -.091921    .0694953
        2002 |  -.0083727   .0703974    -0.12   0.905    -.0783799    .0616346
        2003 |  -.0134549   .0699851    -0.19   0.848    -.0830522    .0561423
        2004 |  -.0259111    .062834    -0.41   0.680    -.0883969    .0365747
        2005 |  -.0490895   .0533631    -0.92   0.358    -.1021568    .0039778
        2006 |  -.0648815   .0529673    -1.22   0.221    -.1175552   -.0122078
        2007 |  -.0797799   .0545737    -1.46   0.144    -.1340511   -.0255087
        2008 |  -.0967117   .0571648    -1.69   0.091    -.1535596   -.0398637
        2009 |  -.1216903   .0582186    -2.09   0.037    -.1795862   -.0637943
        2010 |  -.1414187   .0752701    -1.88   0.060    -.2162716   -.0665658
        2011 |  -.1785454   .0840965    -2.12   0.034    -.2621759    -.094915
        2012 |  -.2372568   .0930617    -2.55   0.011    -.3298027   -.1447108
        2013 |  -.3297795   .1211532    -2.72   0.006    -.4502612   -.2092978
        2014 |  -.4669637   .1630373    -2.86   0.004    -.6290975     -.30483
        2015 |  -.6264437   .2931771    -2.14   0.033     -.917996   -.3348915
        2016 |  -.7650184   .4153262    -1.84   0.065    -1.178043    -.351994
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     4
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  60
                                                           Replications  = 100

                                  (Replications based on 3 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |   .0004006   .0013571     0.30   0.768     -.000949    .0017501
        1998 |   .0003786   .0011659     0.32   0.745    -.0007808    .0015381
        1999 |   .0002783   .0012149     0.23   0.819    -.0009299    .0014864
        2000 |   .0002307   .0015074     0.15   0.878    -.0012684    .0017298
        2001 |   .0003396    .001552     0.22   0.827    -.0012037     .001883
        2002 |   .0003705   .0017759     0.21   0.835    -.0013956    .0021366
        2003 |   .0005328   .0020528     0.26   0.795    -.0015086    .0025742
        2004 |   .0009564   .0023489     0.41   0.684    -.0013795    .0032923
        2005 |   .0015595   .0026865     0.58   0.562    -.0011121    .0042311
        2006 |    .002161   .0030419     0.71   0.477     -.000864     .005186
        2007 |   .0027657   .0033908     0.82   0.415    -.0006064    .0061377
        2008 |   .0033599   .0037395     0.90   0.369    -.0003589    .0070787
        2009 |   .0039684   .0046742     0.85   0.396    -.0006799    .0086167
        2010 |   .0054393   .0050376     1.08   0.280     .0004296     .010449
        2011 |   .0069955   .0075454     0.93   0.354    -.0005081    .0144991
        2012 |   .0084146   .0095387     0.88   0.378    -.0010712    .0179004
        2013 |   .0105265   .0123831     0.85   0.395     -.001788     .022841
        2014 |   .0137921     .01378     1.00   0.317     .0000885    .0274958
        2015 |   .0168802   .0155755     1.08   0.278      .001391    .0323694
        2016 |    .014598   .0178588     0.82   0.414    -.0031618    .0323579
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     5
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  60
                                                           Replications  = 100

                                  (Replications based on 3 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |   .0442084   .0034728    12.73   0.000     .0407548     .047662
        1998 |   .0472665   .0034831    13.57   0.000     .0438027    .0507303
        1999 |   .0506679   .0036224    13.99   0.000     .0470655    .0542702
        2000 |   .0544275   .0036771    14.80   0.000     .0507708    .0580842
        2001 |     .05825   .0034875    16.70   0.000     .0547819    .0617182
        2002 |   .0627791   .0033705    18.63   0.000     .0594273    .0661309
        2003 |   .0676121   .0032746    20.65   0.000     .0643556    .0708685
        2004 |   .0723442   .0032818    22.04   0.000     .0690805    .0756078
        2005 |   .0769353   .0037134    20.72   0.000     .0732425    .0806281
        2006 |   .0816664   .0043202    18.90   0.000     .0773702    .0859627
        2007 |   .0865561   .0050686    17.08   0.000     .0815156    .0915966
        2008 |    .091714   .0059965    15.29   0.000     .0857507    .0976772
        2009 |   .0973032   .0074321    13.09   0.000     .0899123    .1046942
        2010 |   .1015632   .0111404     9.12   0.000     .0904846    .1126419
        2011 |   .1071207   .0174591     6.14   0.000     .0897583    .1244831
        2012 |   .1146133   .0230747     4.97   0.000     .0916665    .1375601
        2013 |   .1222693   .0284175     4.30   0.000     .0940093    .1505293
        2014 |   .1290023   .0320918     4.02   0.000     .0970883    .1609162
        2015 |   .1378042   .0355459     3.88   0.000     .1024553    .1731531
        2016 |   .1637364   .0392271     4.17   0.000     .1247267    .2027461
------------------------------------------------------------------------------

. describe coefsc_*

Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------------------
coefsc_1        double  %10.0g                Coefficient 1, original
coefsc_2        double  %10.0g                Coefficient 2, original
coefsc_3        double  %10.0g                Coefficient 3, original
coefsc_4        double  %10.0g                Coefficient 4, original
coefsc_5        double  %10.0g                Coefficient 5, original
coefsc_b_1      double  %10.0g                Coefficient-Vector 1, observed
coefsc_se_1     double  %10.0g                Std. Err. 1, bootstrapped
coefsc_cill_1   double  %10.0g                Lower bound confid. inter. 1, NB
coefsc_ciul_1   double  %10.0g                Upper bound confid. inter. 1, NB
coefsc_b_2      double  %10.0g                Coefficient-Vector 2, observed
coefsc_se_2     double  %10.0g                Std. Err. 2, bootstrapped
coefsc_cill_2   double  %10.0g                Lower bound confid. inter. 2, NB
coefsc_ciul_2   double  %10.0g                Upper bound confid. inter. 2, NB
coefsc_b_3      double  %10.0g                Coefficient-Vector 3, observed
coefsc_se_3     double  %10.0g                Std. Err. 3, bootstrapped
coefsc_cill_3   double  %10.0g                Lower bound confid. inter. 3, NB
coefsc_ciul_3   double  %10.0g                Upper bound confid. inter. 3, NB
coefsc_b_4      double  %10.0g                Coefficient-Vector 4, observed
coefsc_se_4     double  %10.0g                Std. Err. 4, bootstrapped
coefsc_cill_4   double  %10.0g                Lower bound confid. inter. 4, NB
coefsc_ciul_4   double  %10.0g                Upper bound confid. inter. 4, NB
coefsc_b_5      double  %10.0g                Coefficient-Vector 5, observed
coefsc_se_5     double  %10.0g                Std. Err. 5, bootstrapped
coefsc_cill_5   double  %10.0g                Lower bound confid. inter. 5, NB
coefsc_ciul_5   double  %10.0g                Upper bound confid. inter. 5, NB
coefsc_tvprime  float   %9.0g                 Year

. 
. 
. // E
. xtnptimevar lco2_c lgdp_c lgdp_c2 fossil_fuel_prod_c techonology_c if Year<2017 & Region=
> ="E", stub(coefse) bwidth(1) alle bootstrap bootoptions(reps(100) seed(28845080) level(68
> )) matsize(800) forcereg title(trend function, lgdp, lgdp2, ff, tech) saving("/Users/yueh
> enghu/Desktop/RP/Stata_RP/mystatagraphs")

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     1
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)
(file coefse_bootds.dta not found)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs = 140
                                                           Replications  = 100

                                  (Replications based on 7 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |  -2.820582   .9022656    -3.13   0.002    -3.717847   -1.923317
        1998 |  -2.945674   .9113997    -3.23   0.001    -3.852023   -2.039325
        1999 |  -3.085507   .9270963    -3.33   0.001    -4.007466   -2.163549
        2000 |  -3.238827    .949066    -3.41   0.001    -4.182634   -2.295021
        2001 |  -3.403831   .9775044    -3.48   0.000    -4.375918   -2.431744
        2002 |   -3.57908   1.012449    -3.54   0.000    -4.585918   -2.572242
        2003 |  -3.763576   1.053729    -3.57   0.000    -4.811465   -2.715686
        2004 |  -3.956702    1.10102    -3.59   0.000     -5.05162   -2.861785
        2005 |  -4.158178    1.15391    -3.60   0.000    -5.305694   -3.010663
        2006 |  -4.368025   1.211962    -3.60   0.000    -5.573269    -3.16278
        2007 |  -4.586565    1.27475    -3.60   0.000    -5.854251    -3.31888
        2008 |  -4.814455   1.341904    -3.59   0.000    -6.148922   -3.479988
        2009 |  -5.052746   1.413126    -3.58   0.000     -6.45804   -3.647451
        2010 |  -5.303007   1.488222    -3.56   0.000    -6.782981   -3.823032
        2011 |  -5.567534   1.567135    -3.55   0.000    -7.125983   -4.009085
        2012 |   -5.84972   1.650002    -3.55   0.000    -7.490578   -4.208862
        2013 |  -6.154734   1.737281    -3.54   0.000    -7.882386   -4.427081
        2014 |  -6.490863   1.830023    -3.55   0.000    -8.310744   -4.670982
        2015 |   -6.87243   1.930681    -3.56   0.000    -8.792411   -4.952449
        2016 |  -7.326663   2.046365    -3.58   0.000    -9.361687    -5.29164
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     2
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs = 140
                                                           Replications  = 100

                                  (Replications based on 7 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |   1.076192   .5405145     1.99   0.046     .5386735    1.613711
        1998 |   1.131955   .5443163     2.08   0.038     .5906556    1.673255
        1999 |   1.188943   .5513516     2.16   0.031     .6406474    1.737239
        2000 |   1.248331   .5605319     2.23   0.026     .6909053    1.805756
        2001 |    1.31023   .5716617     2.29   0.022      .741736    1.878723
        2002 |   1.374557    .584706     2.35   0.019     .7930911    1.956022
        2003 |   1.441226   .5996429     2.40   0.016     .8449065    2.037546
        2004 |     1.5102   .6164326     2.45   0.014     .8971836    2.123216
        2005 |   1.581502   .6350148     2.49   0.013     .9500066    2.212997
        2006 |   1.655226   .6553143     2.53   0.012     1.003544    2.306909
        2007 |   1.731544   .6772478     2.56   0.011      1.05805    2.405039
        2008 |   1.810722   .7007302     2.58   0.010     1.113875    2.507568
        2009 |    1.89314   .7256817     2.61   0.009      1.17148      2.6148
        2010 |   1.979339   .7520339     2.63   0.008     1.231473    2.727205
        2011 |   2.070083   .7797378     2.65   0.008     1.294667      2.8455
        2012 |    2.16647   .8087771     2.68   0.007     1.362175    2.970765
        2013 |   2.270135   .8391951     2.71   0.007     1.435591     3.10468
        2014 |   2.383632   .8711661     2.74   0.006     1.517294     3.24997
        2015 |   2.511206   .9052467     2.77   0.006     1.610976    3.411436
        2016 |   2.660296   .9436615     2.82   0.005     1.721864    3.598727
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     3
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs = 140
                                                           Replications  = 100

                                  (Replications based on 7 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |  -.0178372   .0857464    -0.21   0.835    -.1031084    .0674339
        1998 |  -.0265696   .0844498    -0.31   0.753    -.1105514    .0574121
        1999 |  -.0346442   .0839644    -0.41   0.680    -.1181432    .0488549
        2000 |  -.0424866   .0838972    -0.51   0.613    -.1259188    .0409456
        2001 |  -.0502566   .0841301    -0.60   0.550    -.1339204    .0334072
        2002 |  -.0580305   .0846172    -0.69   0.493    -.1421787    .0261178
        2003 |  -.0658527   .0853369    -0.77   0.440    -.1507167    .0190112
        2004 |  -.0737547   .0862764    -0.85   0.393    -.1595529    .0120435
        2005 |  -.0817625   .0874262    -0.94   0.350    -.1687042    .0051792
        2006 |  -.0899018   .0887782    -1.01   0.311     -.178188   -.0016156
        2007 |  -.0982001   .0903244    -1.09   0.277    -.1880239   -.0083763
        2008 |  -.1066899   .0920564    -1.16   0.246    -.1982361   -.0151437
        2009 |  -.1154111   .0939656    -1.23   0.219    -.2088559   -.0219662
        2010 |  -.1244148   .0960428    -1.30   0.195    -.2199253   -.0289043
        2011 |  -.1337695   .0982779    -1.36   0.173    -.2315028   -.0360363
        2012 |  -.1435697     .10066    -1.43   0.154    -.2436718   -.0434676
        2013 |  -.1539518   .1031765    -1.49   0.136    -.2565565   -.0513472
        2014 |  -.1651226   .1058143    -1.56   0.119    -.2703505   -.0598947
        2015 |   -.177411   .1085721    -1.63   0.102    -.2853814   -.0694406
        2016 |  -.1913368   .1115649    -1.72   0.086    -.3022834   -.0803902
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     4
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs = 140
                                                           Replications  = 100

                                  (Replications based on 7 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |   .0000705   .0043772     0.02   0.987    -.0042825    .0044234
        1998 |  -.0000255   .0041414    -0.01   0.995     -.004144     .004093
        1999 |  -.0000577   .0039236    -0.01   0.988    -.0039596    .0038442
        2000 |  -.0000578   .0037638    -0.02   0.988    -.0038007    .0036852
        2001 |  -.0000408   .0036888    -0.01   0.991    -.0037092    .0036276
        2002 |  -.0000151   .0037141    -0.00   0.997    -.0037086    .0036784
        2003 |   .0000147   .0038428     0.00   0.997    -.0038067    .0038362
        2004 |   .0000454   .0040674     0.01   0.991    -.0039995    .0040903
        2005 |   .0000747    .004374     0.02   0.986     -.004275    .0044245
        2006 |    .000101   .0047463     0.02   0.983     -.004619     .004821
        2007 |   .0001224   .0051691     0.02   0.981     -.005018    .0052628
        2008 |   .0001372   .0056291     0.02   0.981    -.0054607    .0057351
        2009 |   .0001433   .0061155     0.02   0.981    -.0059383    .0062249
        2010 |    .000138   .0066189     0.02   0.983    -.0064443    .0067202
        2011 |   .0001174   .0071312     0.02   0.987    -.0069742    .0072091
        2012 |   .0000763    .007644     0.01   0.992    -.0075253    .0076779
        2013 |   6.07e-06   .0081478     0.00   0.999    -.0080966    .0081087
        2014 |  -.0001079   .0086303    -0.01   0.990    -.0086903    .0084745
        2015 |  -.0002942   .0090734    -0.03   0.974    -.0093173    .0087289
        2016 |  -.0006244   .0094536    -0.07   0.947    -.0100257    .0087769
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     5
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs = 140
                                                           Replications  = 100

                                  (Replications based on 7 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |    .053581   .0126608     4.23   0.000     .0409904    .0661716
        1998 |   .0563111   .0118478     4.75   0.000      .044529    .0680933
        1999 |   .0593125   .0112213     5.29   0.000     .0481534    .0704715
        2000 |   .0625555    .010902     5.74   0.000     .0517139    .0733971
        2001 |   .0660088   .0109725     6.02   0.000     .0550972    .0769205
        2002 |   .0696476   .0114595     6.08   0.000     .0582516    .0810435
        2003 |   .0734538   .0123348     5.96   0.000     .0611874    .0857202
        2004 |   .0774162   .0135362     5.72   0.000      .063955    .0908774
        2005 |    .081529   .0149938     5.44   0.000     .0666184    .0964397
        2006 |   .0857921   .0166451     5.15   0.000     .0692393    .1023449
        2007 |   .0902108   .0184405     4.89   0.000     .0718725    .1085492
        2008 |   .0947967   .0203425     4.66   0.000      .074567    .1150265
        2009 |   .0995693   .0223222     4.46   0.000     .0773708    .1217678
        2010 |   .1045584   .0243567     4.29   0.000     .0803367    .1287802
        2011 |   .1098091   .0264262     4.16   0.000     .0835293    .1360888
        2012 |   .1153903   .0285108     4.05   0.000     .0870375    .1437431
        2013 |   .1214117   .0305876     3.97   0.000     .0909936    .1518298
        2014 |   .1280593   .0326252     3.93   0.000      .095615    .1605037
        2015 |   .1356829   .0345772     3.92   0.000     .1012973    .1700684
        2016 |   .1450599   .0363898     3.99   0.000     .1088718     .181248
------------------------------------------------------------------------------

. describe coefse_*

Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------------------
coefse_1        double  %10.0g                Coefficient 1, original
coefse_2        double  %10.0g                Coefficient 2, original
coefse_3        double  %10.0g                Coefficient 3, original
coefse_4        double  %10.0g                Coefficient 4, original
coefse_5        double  %10.0g                Coefficient 5, original
coefse_b_1      double  %10.0g                Coefficient-Vector 1, observed
coefse_se_1     double  %10.0g                Std. Err. 1, bootstrapped
coefse_cill_1   double  %10.0g                Lower bound confid. inter. 1, NB
coefse_ciul_1   double  %10.0g                Upper bound confid. inter. 1, NB
coefse_b_2      double  %10.0g                Coefficient-Vector 2, observed
coefse_se_2     double  %10.0g                Std. Err. 2, bootstrapped
coefse_cill_2   double  %10.0g                Lower bound confid. inter. 2, NB
coefse_ciul_2   double  %10.0g                Upper bound confid. inter. 2, NB
coefse_b_3      double  %10.0g                Coefficient-Vector 3, observed
coefse_se_3     double  %10.0g                Std. Err. 3, bootstrapped
coefse_cill_3   double  %10.0g                Lower bound confid. inter. 3, NB
coefse_ciul_3   double  %10.0g                Upper bound confid. inter. 3, NB
coefse_b_4      double  %10.0g                Coefficient-Vector 4, observed
coefse_se_4     double  %10.0g                Std. Err. 4, bootstrapped
coefse_cill_4   double  %10.0g                Lower bound confid. inter. 4, NB
coefse_ciul_4   double  %10.0g                Upper bound confid. inter. 4, NB
coefse_b_5      double  %10.0g                Coefficient-Vector 5, observed
coefse_se_5     double  %10.0g                Std. Err. 5, bootstrapped
coefse_cill_5   double  %10.0g                Lower bound confid. inter. 5, NB
coefse_ciul_5   double  %10.0g                Upper bound confid. inter. 5, NB
coefse_tvprime  float   %9.0g                 Year

. 
. 
. // N
. xtnptimevar lco2_c lgdp_c lgdp_c2 fossil_fuel_prod_c techonology_c if Year<2017 & Region=
> ="N", stub(coefse) bwidth(0.3017) alle bootstrap bootoptions(reps(100) seed(28845080) lev
> el(68)) matsize(800) forcereg title(trend function, lgdp, lgdp2, ff, tech) saving("/Users
> /yuehenghu/Desktop/RP/Stata_RP/mystatagraphs")

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     1
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)
(file coefse_bootds.dta not found)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs = 100
                                                           Replications  = 100

                                  (Replications based on 5 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |  -4.144646   3.570992    -1.16   0.246    -7.695848   -.5934446
        1998 |  -5.025848   4.282167    -1.17   0.241    -9.284283    -.767413
        1999 |  -5.625797   3.771861    -1.49   0.136    -9.376755    -1.87484
        2000 |  -6.013491   2.866397    -2.10   0.036    -8.864002    -3.16298
        2001 |  -6.112454   2.191691    -2.79   0.005    -8.291998    -3.93291
        2002 |  -6.235841    2.34457    -2.66   0.008    -8.567417   -3.904265
        2003 |  -6.612737   2.228778    -2.97   0.003    -8.829163   -4.396312
        2004 |  -7.412616    2.26856    -3.27   0.001    -9.668603   -5.156628
        2005 |  -8.656836   3.334837    -2.60   0.009    -11.97319   -5.340481
        2006 |  -10.19417    4.63757    -2.20   0.028    -14.80604   -5.582302
        2007 |  -12.27776   5.481751    -2.24   0.025    -17.72914   -6.826393
        2008 |  -15.57233   7.693379    -2.02   0.043    -23.22307   -7.921586
        2009 |  -19.94167   9.056658    -2.20   0.028    -28.94814   -10.93521
        2010 |  -25.39829   9.987251    -2.54   0.011    -35.33019   -15.46639
        2011 |  -31.17351   11.18759    -2.79   0.005    -42.29909   -20.04792
        2012 |  -37.69233   12.57197    -3.00   0.003    -50.19463   -25.19003
        2013 |  -45.04722   15.06256    -2.99   0.003     -60.0263   -30.06813
        2014 |   -52.5676   18.88927    -2.78   0.005    -71.35218   -33.78301
        2015 |  -58.83093   24.08502    -2.44   0.015    -82.78247    -34.8794
        2016 |  -62.57932   46.74334    -1.34   0.181    -109.0636   -16.09504
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     2
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs = 100
                                                           Replications  = 100

                                  (Replications based on 5 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |   3.505085   2.923155     1.20   0.230      .598131     6.41204
        1998 |   3.931216   3.403431     1.16   0.248     .5466474    7.315786
        1999 |   4.183693   2.842708     1.47   0.141     1.356739    7.010647
        2000 |   4.293769   2.071242     2.07   0.038     2.234006    6.353532
        2001 |   4.190207   1.515704     2.76   0.006     2.682903    5.697511
        2002 |   4.090585   1.565682     2.61   0.009     2.533579     5.64759
        2003 |   4.162376   1.417942     2.94   0.003     2.752292     5.57246
        2004 |   4.445683   1.398535     3.18   0.001     3.054898    5.836467
        2005 |   4.970202   1.807623     2.75   0.006     3.172596    6.767807
        2006 |   5.618064   2.368905     2.37   0.018     3.262288    7.973841
        2007 |   6.491817   2.834273     2.29   0.022     3.673252    9.310382
        2008 |   7.922963   4.150526     1.91   0.056     3.795439    12.05049
        2009 |   9.761835   4.692479     2.08   0.037     5.095363    14.42831
        2010 |   11.97672   4.943607     2.42   0.015      7.06051    16.89293
        2011 |   14.26204   5.345422     2.67   0.008      8.94624    19.57783
        2012 |   16.84753   5.839855     2.88   0.004     11.04004    22.65502
        2013 |   19.74908   6.731446     2.93   0.003     13.05494    26.44322
        2014 |   22.65223   7.938251     2.85   0.004     14.75797    30.54648
        2015 |   24.99647   9.975413     2.51   0.012     15.07634     34.9166
        2016 |   26.26494   20.25793     1.30   0.195     6.119276     46.4106
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     3
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs = 100
                                                           Replications  = 100

                                  (Replications based on 5 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |  -.5678844   .6125874    -0.93   0.354    -1.177077     .041308
        1998 |   -.614871   .6932325    -0.89   0.375    -1.304262    .0745195
        1999 |  -.6342132   .5483031    -1.16   0.247    -1.179478   -.0889488
        2000 |  -.6302128   .3768911    -1.67   0.094    -1.005015   -.2554105
        2001 |  -.5887317   .2620426    -2.25   0.025    -.8493219   -.3281414
        2002 |  -.5485569   .2732011    -2.01   0.045    -.8202439   -.2768699
        2003 |  -.5377658   .2384173    -2.26   0.024    -.7748618   -.3006699
        2004 |  -.5551599   .2254237    -2.46   0.014    -.7793343   -.3309854
        2005 |  -.6060129   .2562219    -2.37   0.018    -.8608148    -.351211
        2006 |  -.6702108   .3143223    -2.13   0.033    -.9827911   -.3576305
        2007 |  -.7578155   .3751705    -2.02   0.043    -1.130907   -.3847243
        2008 |  -.9086134   .5585186    -1.63   0.104    -1.464037   -.3531901
        2009 |  -1.096656   .6008354    -1.83   0.068    -1.694161   -.4991504
        2010 |  -1.315437   .6025684    -2.18   0.029    -1.914666   -.7162086
        2011 |  -1.535371   .6305354    -2.44   0.015    -2.162412   -.9083301
        2012 |  -1.785439    .671265    -2.66   0.008    -2.452984   -1.117894
        2013 |  -2.064873   .7522989    -2.74   0.006    -2.813002   -1.316743
        2014 |  -2.338108   .8410218    -2.78   0.005    -3.174469   -1.501747
        2015 |  -2.550984   1.038572    -2.46   0.014    -3.583801   -1.518168
        2016 |  -2.651287   2.178602    -1.22   0.224    -4.817815   -.4847589
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     4
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs = 100
                                                           Replications  = 100

                                  (Replications based on 5 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |   .0007765   .0006258     1.24   0.215     .0001542    .0013989
        1998 |   .0006216   .0005564     1.12   0.264     .0000682    .0011749
        1999 |   .0004028   .0005812     0.69   0.488    -.0001752    .0009807
        2000 |   .0002635   .0006704     0.39   0.694    -.0004032    .0009302
        2001 |   .0001866   .0008624     0.22   0.829     -.000671    .0010442
        2002 |   .0000887   .0012524     0.07   0.944    -.0011567    .0013341
        2003 |   .0000319   .0013932     0.02   0.982    -.0013536    .0014175
        2004 |  -.0000562   .0016932    -0.03   0.974      -.00174    .0016276
        2005 |  -.0000581   .0024604    -0.02   0.981    -.0025049    .0023887
        2006 |   .0000494   .0026443     0.02   0.985    -.0025802    .0026791
        2007 |   .0002565   .0028466     0.09   0.928    -.0025743    .0030873
        2008 |   .0005623   .0030829     0.18   0.855    -.0025035    .0036281
        2009 |   .0008147   .0034757     0.23   0.815    -.0026417    .0042711
        2010 |   .0008977   .0041943     0.21   0.831    -.0032733    .0050688
        2011 |   .0006647   .0051737     0.13   0.898    -.0044803    .0058097
        2012 |   .0001053   .0064802     0.02   0.987     -.006339    .0065496
        2013 |  -.0011297   .0078445    -0.14   0.885    -.0089307    .0066713
        2014 |  -.0032675   .0093296    -0.35   0.726    -.0125454    .0060105
        2015 |  -.0058138   .0104291    -0.56   0.577    -.0161851    .0045575
        2016 |  -.0086111   .0159865    -0.54   0.590    -.0245089    .0072868
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     5
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs = 100
                                                           Replications  = 100

                                  (Replications based on 5 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |    .014094   .0072219     1.95   0.051     .0069122    .0212758
        1998 |   .0166633   .0071636     2.33   0.020     .0095394    .0237872
        1999 |   .0184526   .0072568     2.54   0.011     .0112361    .0256692
        2000 |   .0198776   .0079078     2.51   0.012     .0120136    .0277415
        2001 |   .0212643   .0096387     2.21   0.027      .011679    .0308495
        2002 |   .0233045   .0114204     2.04   0.041     .0119474    .0346616
        2003 |    .025375   .0134012     1.89   0.058      .012048    .0387019
        2004 |   .0283131    .016044     1.76   0.078     .0123581    .0442682
        2005 |   .0306713   .0202788     1.51   0.130     .0105049    .0508377
        2006 |   .0328163   .0228128     1.44   0.150     .0101299    .0555026
        2007 |   .0351286   .0241366     1.46   0.146     .0111257    .0591314
        2008 |   .0363938    .025846     1.41   0.159     .0106911    .0620965
        2009 |   .0374546   .0261301     1.43   0.152     .0114694    .0634399
        2010 |   .0388108   .0294872     1.32   0.188     .0094869    .0681346
        2011 |   .0398284   .0326664     1.22   0.223      .007343    .0723137
        2012 |   .0400607   .0392947     1.02   0.308     .0009838    .0791376
        2013 |   .0405717    .050732     0.80   0.424    -.0098791    .0910225
        2014 |   .0428832   .0651087     0.66   0.510    -.0218647    .1076311
        2015 |   .0464013   .0753971     0.62   0.538    -.0285779    .1213806
        2016 |   .0514958   .0857871     0.60   0.548    -.0338159    .1368075
------------------------------------------------------------------------------

. describe coefse_*

Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------------------
coefse_1        double  %10.0g                Coefficient 1, original
coefse_2        double  %10.0g                Coefficient 2, original
coefse_3        double  %10.0g                Coefficient 3, original
coefse_4        double  %10.0g                Coefficient 4, original
coefse_5        double  %10.0g                Coefficient 5, original
coefse_b_1      double  %10.0g                Coefficient-Vector 1, observed
coefse_se_1     double  %10.0g                Std. Err. 1, bootstrapped
coefse_cill_1   double  %10.0g                Lower bound confid. inter. 1, NB
coefse_ciul_1   double  %10.0g                Upper bound confid. inter. 1, NB
coefse_b_2      double  %10.0g                Coefficient-Vector 2, observed
coefse_se_2     double  %10.0g                Std. Err. 2, bootstrapped
coefse_cill_2   double  %10.0g                Lower bound confid. inter. 2, NB
coefse_ciul_2   double  %10.0g                Upper bound confid. inter. 2, NB
coefse_b_3      double  %10.0g                Coefficient-Vector 3, observed
coefse_se_3     double  %10.0g                Std. Err. 3, bootstrapped
coefse_cill_3   double  %10.0g                Lower bound confid. inter. 3, NB
coefse_ciul_3   double  %10.0g                Upper bound confid. inter. 3, NB
coefse_b_4      double  %10.0g                Coefficient-Vector 4, observed
coefse_se_4     double  %10.0g                Std. Err. 4, bootstrapped
coefse_cill_4   double  %10.0g                Lower bound confid. inter. 4, NB
coefse_ciul_4   double  %10.0g                Upper bound confid. inter. 4, NB
coefse_b_5      double  %10.0g                Coefficient-Vector 5, observed
coefse_se_5     double  %10.0g                Std. Err. 5, bootstrapped
coefse_cill_5   double  %10.0g                Lower bound confid. inter. 5, NB
coefse_ciul_5   double  %10.0g                Upper bound confid. inter. 5, NB
coefse_tvprime  float   %9.0g                 Year

. 
. 
. // NE
. xtnptimevar lco2_c lgdp_c lgdp_c2 fossil_fuel_prod_c techonology_c if Year<2017 & Region=
> ="NE", stub(coefse) bwidth(0.25) alle bootstrap bootoptions(reps(100) seed(28845080) leve
> l(68)) matsize(800) forcereg title(trend function, lgdp, lgdp2, ff, tech) saving("/Users/
> yuehenghu/Desktop/RP/Stata_RP/mystatagraphs")

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     1
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)
(file coefse_bootds.dta not found)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  60
                                                           Replications  = 100

                                  (Replications based on 3 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |  -2.785607   2.068544    -1.35   0.178    -4.842686   -.7285271
        1998 |   -2.92161   1.284936    -2.27   0.023    -4.199424   -1.643795
        1999 |  -3.084089   .9811556    -3.14   0.002    -4.059807   -2.108371
        2000 |  -3.093205   1.156338    -2.68   0.007    -4.243134   -1.943276
        2001 |   -2.98511   .9481486    -3.15   0.002    -3.928004   -2.042216
        2002 |  -2.858827   .8228506    -3.47   0.001    -3.677117   -2.040537
        2003 |  -3.203462   1.006046    -3.18   0.001    -4.203931   -2.202992
        2004 |  -3.061753   1.234667    -2.48   0.013    -4.289577   -1.833929
        2005 |  -3.605629   1.843191    -1.96   0.050    -5.438605   -1.772653
        2006 |  -3.795391   1.420081    -2.67   0.008    -5.207602    -2.38318
        2007 |  -4.062635   1.967027    -2.07   0.039    -6.018761    -2.10651
        2008 |  -4.030472   1.916645    -2.10   0.035    -5.936495    -2.12445
        2009 |  -4.302993   2.998009    -1.44   0.151    -7.284387     -1.3216
        2010 |  -5.001564   .7670628    -6.52   0.000    -5.764376   -4.238753
        2011 |  -5.785294   1.176167    -4.92   0.000    -6.954942   -4.615645
        2012 |  -6.921648   1.778012    -3.89   0.000    -8.689807    -5.15349
        2013 |  -9.637622   5.582124    -1.73   0.084    -15.18881   -4.086434
        2014 |  -5.979415   4.883921    -1.22   0.221    -10.83627   -1.122561
        2015 |  -3.021485   3.070659    -0.98   0.325    -6.075126    .0321561
        2016 |  -1.047924   5.493153    -0.19   0.849    -6.510633    4.414786
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     2
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  60
                                                           Replications  = 100

                                  (Replications based on 3 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |   1.793031   1.687599     1.06   0.288     .1147848    3.471277
        1998 |   1.839249   .9660049     1.90   0.057     .8785981      2.7999
        1999 |   1.892585   .6913858     2.74   0.006     1.205031    2.580139
        2000 |   1.823647   .8569108     2.13   0.033      .971485    2.675808
        2001 |   1.677288   .6658707     2.52   0.012     1.015108    2.339469
        2002 |   1.529062   .5633228     2.71   0.007     .9688614    2.089263
        2003 |   1.676575   .7665996     2.19   0.029     .9142238    2.438926
        2004 |   1.525478   .6380367     2.39   0.017     .8909779    2.159979
        2005 |   1.816582   .9505228     1.91   0.056     .8713275    2.761837
        2006 |   1.824603   .8731644     2.09   0.037      .956278    2.692928
        2007 |   1.872005   1.291615     1.45   0.147     .5875485    3.156462
        2008 |   1.759331   1.056059     1.67   0.096     .7091252    2.809537
        2009 |   1.806701   1.579406     1.14   0.253     .2360489    3.377354
        2010 |   2.080698   .4480744     4.64   0.000     1.635107    2.526289
        2011 |   2.400701   .5182503     4.63   0.000     1.885322    2.916079
        2012 |   2.821212   .7587986     3.72   0.000     2.066619    3.575805
        2013 |   3.933225   2.527815     1.56   0.120     1.419419     6.44703
        2014 |   2.241139   2.194291     1.02   0.307     .0590094    4.423268
        2015 |   .8973902   1.354655     0.66   0.508    -.4497575    2.244538
        2016 |  -.0079169   2.419055    -0.00   0.997    -2.413565    2.397731
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     3
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  60
                                                           Replications  = 100

                                  (Replications based on 3 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |  -.1649228   .3462197    -0.48   0.634    -.5092238    .1793781
        1998 |  -.1710516   .1894469    -0.90   0.367    -.3594485    .0173454
        1999 |  -.1765624   .1264267    -1.40   0.163    -.3022885   -.0508363
        2000 |  -.1575203   .1633277    -0.96   0.335    -.3199429    .0049022
        2001 |  -.1252903   .1200977    -1.04   0.297    -.2447225   -.0058582
        2002 |  -.0945938   .0989862    -0.96   0.339    -.1930314    .0038438
        2003 |  -.1174147    .149882    -0.78   0.433     -.266466    .0316366
        2004 |  -.0866197   .0904895    -0.96   0.338    -.1766077    .0033684
        2005 |  -.1276606   .1552959    -0.82   0.411    -.2820959    .0267746
        2006 |  -.1218686   .1309203    -0.93   0.352    -.2520634    .0083261
        2007 |  -.1216378   .2002354    -0.61   0.544    -.3207635    .0774879
        2008 |  -.1007013   .1471164    -0.68   0.494    -.2470024    .0455997
        2009 |  -.1020161   .2094115    -0.49   0.626     -.310267    .1062348
        2010 |  -.1316382   .0652799    -2.02   0.044    -.1965563   -.0667201
        2011 |  -.1664929   .0589197    -2.83   0.005     -.225086   -.1078998
        2012 |   -.208909    .083515    -2.50   0.012    -.2919611   -.1258568
        2013 |  -.3270058   .2884704    -1.13   0.257    -.6138775   -.0401342
        2014 |  -.1333101   .2470826    -0.54   0.590    -.3790233    .1124031
        2015 |    .017645   .1512275     0.12   0.907    -.1327444    .1680344
        2016 |   .1202782   .2701336     0.45   0.656    -.1483582    .3889147
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     4
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  60
                                                           Replications  = 100

                                  (Replications based on 3 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |  -.0000706   .0018399    -0.04   0.969    -.0019003    .0017591
        1998 |  -.0000614   .0005939    -0.10   0.918     -.000652    .0005292
        1999 |  -.0000615   .0001943    -0.32   0.752    -.0002547    .0001317
        2000 |  -.0000593   .0002285    -0.26   0.795    -.0002866    .0001679
        2001 |   -.000055   .0002294    -0.24   0.810    -.0002831     .000173
        2002 |  -.0000561   .0001514    -0.37   0.711    -.0002066    .0000945
        2003 |  -.0000342   .0008962    -0.04   0.970    -.0009254    .0008571
        2004 |  -.0000634    .000885    -0.07   0.943    -.0009435    .0008167
        2005 |  -.0001337   .0012943    -0.10   0.918    -.0014208    .0011535
        2006 |  -.0001069   .0019425    -0.06   0.956    -.0020386    .0018248
        2007 |  -.0000829   .0044681    -0.02   0.985    -.0045263    .0043605
        2008 |  -.0000553   .0017308    -0.03   0.974    -.0017766    .0016659
        2009 |  -.0000678   .0010533    -0.06   0.949    -.0011152    .0009797
        2010 |   .0000135   .0009764     0.01   0.989    -.0009575    .0009845
        2011 |   .0002303   .0017576     0.13   0.896    -.0015175    .0019782
        2012 |   .0003019   .0032705     0.09   0.926    -.0029505    .0035543
        2013 |   .0003367    .001915     0.18   0.860    -.0015678    .0022411
        2014 |   .0008305   .0049826     0.17   0.868    -.0041244    .0057855
        2015 |   .0013637   .0102954     0.13   0.895    -.0088746    .0116021
        2016 |    .002135   .0064431     0.33   0.740    -.0042724    .0085424
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     5
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  60
                                                           Replications  = 100

                                  (Replications based on 3 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |    .023149   .0016945    13.66   0.000     .0214639    .0248341
        1998 |   .0246842   .0012733    19.39   0.000     .0234179    .0259504
        1999 |   .0263878    .001129    23.37   0.000     .0252651    .0275106
        2000 |   .0280348   .0004938    56.77   0.000     .0275437    .0285259
        2001 |   .0295026   .0003702    79.70   0.000     .0291345    .0298708
        2002 |   .0309183   .0004391    70.41   0.000     .0304816    .0313549
        2003 |   .0343961   .0011948    28.79   0.000     .0332078    .0355843
        2004 |   .0356593   .0017622    20.24   0.000      .033907    .0374117
        2005 |   .0371433   .0037108    10.01   0.000     .0334531    .0408336
        2006 |   .0408764   .0025292    16.16   0.000     .0383613    .0433916
        2007 |     .04506   .0039784    11.33   0.000     .0411036    .0490163
        2008 |   .0496912   .0017201    28.89   0.000     .0479806    .0514017
        2009 |   .0555028   .0023524    23.59   0.000     .0531634    .0578422
        2010 |   .0596281   .0036165    16.49   0.000     .0560316    .0632246
        2011 |   .0624982    .004522    13.82   0.000     .0580012    .0669951
        2012 |   .0698478    .004922    14.19   0.000      .064953    .0747425
        2013 |   .0779834   .0059841    13.03   0.000     .0720325    .0839343
        2014 |   .0788996   .0073639    10.71   0.000     .0715765    .0862226
        2015 |   .0795534   .0255999     3.11   0.002     .0540953    .1050114
        2016 |   .0788384   .0154212     5.11   0.000     .0635027    .0941741
------------------------------------------------------------------------------

. describe coefse_*

Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------------------
coefse_1        double  %10.0g                Coefficient 1, original
coefse_2        double  %10.0g                Coefficient 2, original
coefse_3        double  %10.0g                Coefficient 3, original
coefse_4        double  %10.0g                Coefficient 4, original
coefse_5        double  %10.0g                Coefficient 5, original
coefse_b_1      double  %10.0g                Coefficient-Vector 1, observed
coefse_se_1     double  %10.0g                Std. Err. 1, bootstrapped
coefse_cill_1   double  %10.0g                Lower bound confid. inter. 1, NB
coefse_ciul_1   double  %10.0g                Upper bound confid. inter. 1, NB
coefse_b_2      double  %10.0g                Coefficient-Vector 2, observed
coefse_se_2     double  %10.0g                Std. Err. 2, bootstrapped
coefse_cill_2   double  %10.0g                Lower bound confid. inter. 2, NB
coefse_ciul_2   double  %10.0g                Upper bound confid. inter. 2, NB
coefse_b_3      double  %10.0g                Coefficient-Vector 3, observed
coefse_se_3     double  %10.0g                Std. Err. 3, bootstrapped
coefse_cill_3   double  %10.0g                Lower bound confid. inter. 3, NB
coefse_ciul_3   double  %10.0g                Upper bound confid. inter. 3, NB
coefse_b_4      double  %10.0g                Coefficient-Vector 4, observed
coefse_se_4     double  %10.0g                Std. Err. 4, bootstrapped
coefse_cill_4   double  %10.0g                Lower bound confid. inter. 4, NB
coefse_ciul_4   double  %10.0g                Upper bound confid. inter. 4, NB
coefse_b_5      double  %10.0g                Coefficient-Vector 5, observed
coefse_se_5     double  %10.0g                Std. Err. 5, bootstrapped
coefse_cill_5   double  %10.0g                Lower bound confid. inter. 5, NB
coefse_ciul_5   double  %10.0g                Upper bound confid. inter. 5, NB
coefse_tvprime  float   %9.0g                 Year

. 
. 
. // NW
. xtnptimevar lco2_c lgdp_c lgdp_c2 fossil_fuel_prod_c techonology_c if Year<2017 & Region=
> ="NW", stub(coefse) bwidth(0.6748) alle bootstrap bootoptions(reps(100) seed(28845080) le
> vel(68)) matsize(800) forcereg title(trend function, lgdp, lgdp2, ff, tech) saving("/User
> s/yuehenghu/Desktop/RP/Stata_RP/mystatagraphs")

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     1
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)
(file coefse_bootds.dta not found)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs = 100
                                                           Replications  = 100

                                  (Replications based on 5 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |  -1.226376   19.65025    -0.06   0.950    -20.76773    18.31497
        1998 |   .7309934   17.42492     0.04   0.967    -16.59736    18.05935
        1999 |   2.376608   14.56627     0.16   0.870    -12.10893    16.86215
        2000 |   3.724641   12.20815     0.31   0.760    -8.415851    15.86513
        2001 |   4.751839   10.77543     0.44   0.659    -5.963874    15.46755
        2002 |   5.607796   10.02841     0.56   0.576     -4.36503    15.58062
        2003 |   6.232715   9.587754     0.65   0.516    -3.301903    15.76733
        2004 |   6.710473   9.458063     0.71   0.478    -2.695172    16.11612
        2005 |   7.176288   9.483142     0.76   0.449    -2.254298    16.60687
        2006 |   7.677434   9.563273     0.80   0.422    -1.832838    17.18771
        2007 |    8.24604   9.673469     0.85   0.394    -1.373817     17.8659
        2008 |   8.925908   9.808281     0.91   0.363     -.828014    18.67983
        2009 |   9.805359   9.985694     0.98   0.326    -.1249928    19.73571
        2010 |    11.1553   10.32498     1.08   0.280     .8875446    21.42305
        2011 |   13.00215    10.9566     1.19   0.235     2.106266    23.89803
        2012 |   14.67049   11.58345     1.27   0.205     3.151238    26.18975
        2013 |   15.39464   12.26702     1.25   0.209     3.195606    27.59367
        2014 |   13.48895   12.98919     1.04   0.299     .5717459    26.40616
        2015 |   6.567186    9.96763     0.66   0.510    -3.345202    16.47957
        2016 |  -3.160495    4.64931    -0.68   0.497    -7.784039    1.463048
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     2
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs = 100
                                                           Replications  = 100

                                  (Replications based on 5 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |   1.288836   18.05822     0.07   0.943     -16.6693    19.24697
        1998 |  -.8702291   15.29733    -0.06   0.955    -16.08278    14.34232
        1999 |  -2.466947   12.13485    -0.20   0.839    -14.53455    9.600654
        2000 |  -3.584227   9.598457    -0.37   0.709    -13.12949    5.961034
        2001 |  -4.270558   7.984154    -0.53   0.593    -12.21046    3.669347
        2002 |  -4.716833   7.012356    -0.67   0.501    -11.69033     2.25666
        2003 |  -4.916588   6.347227    -0.77   0.439    -11.22864    1.395461
        2004 |  -4.968346   5.957587    -0.83   0.404    -10.89292     .956224
        2005 |  -4.989269   5.697066    -0.88   0.381    -10.65476    .6762226
        2006 |  -5.017932   5.486068    -0.91   0.360     -10.4736    .4377317
        2007 |  -5.075577   5.306057    -0.96   0.339    -10.35223    .2010734
        2008 |  -5.186542   5.153564    -1.01   0.314    -10.31154     -.06154
        2009 |  -5.396658   5.039741    -1.07   0.284    -10.40847   -.3848474
        2010 |  -5.844416   5.029837    -1.16   0.245    -10.84638   -.8424542
        2011 |  -6.536721   5.194395    -1.26   0.208    -11.70233   -1.371114
        2012 |  -7.139324   5.394387    -1.32   0.186    -12.50381   -1.774833
        2013 |  -7.308526   5.672096    -1.29   0.198    -12.94919   -1.667866
        2014 |  -6.284681   5.942049    -1.06   0.290     -12.1938   -.3755631
        2015 |  -3.044724   4.537398    -0.67   0.502    -7.556975    1.467527
        2016 |   1.358645   1.982886     0.69   0.493    -.6132517    3.330541
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     3
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs = 100
                                                           Replications  = 100

                                  (Replications based on 5 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |  -.8402107   3.696671    -0.23   0.820    -4.516394    2.835973
        1998 |  -.2148919    2.99508    -0.07   0.943    -3.193373    2.763589
        1999 |   .2268039   2.237656     0.10   0.919    -1.998451    2.452059
        2000 |   .5191163   1.652406     0.31   0.753    -1.124132    2.162364
        2001 |   .6876159   1.287883     0.53   0.593    -.5931299    1.968362
        2002 |   .7866599   1.070299     0.73   0.462    -.2777071    1.851027
        2003 |   .8233866   .9268165     0.89   0.374    -.0982934    1.745067
        2004 |    .823414    .843077     0.98   0.329    -.0149906    1.661819
        2005 |   .8126153   .7849022     1.04   0.301     .0320631    1.593168
        2006 |   .7996618   .7361974     1.09   0.277     .0675445    1.531779
        2007 |   .7886329   .6933915     1.14   0.255     .0990843    1.478182
        2008 |   .7832655   .6557937     1.19   0.232     .1311063    1.435425
        2009 |   .7897327   .6249844     1.26   0.206      .168212    1.411253
        2010 |   .8259096   .6097443     1.35   0.176     .2195446    1.432275
        2011 |   .8919955   .6190559     1.44   0.150     .2763705     1.50762
        2012 |   .9459428   .6349019     1.49   0.136     .3145596    1.577326
        2013 |   .9485647   .6626396     1.43   0.152     .2895975    1.607532
        2014 |   .8144263   .6841498     1.19   0.234     .1340682    1.494784
        2015 |   .4345226   .5208623     0.83   0.404    -.0834531    .9524982
        2016 |  -.0663736   .2168514    -0.31   0.760    -.2820232     .149276
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     4
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs = 100
                                                           Replications  = 100

                                  (Replications based on 5 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |   .0090417   .0103974     0.87   0.385     -.001298    .0193815
        1998 |   .0097161   .0092247     1.05   0.292     .0005425    .0188896
        1999 |   .0100642   .0082375     1.22   0.222     .0018723    .0182561
        2000 |    .010187   .0075054     1.36   0.175     .0027232    .0176508
        2001 |   .0101684   .0070254     1.45   0.148     .0031819    .0171549
        2002 |   .0100572   .0067115     1.50   0.134     .0033829    .0167315
        2003 |   .0099115   .0065094     1.52   0.128     .0034382    .0163849
        2004 |   .0097817   .0063661     1.54   0.124     .0034508    .0161125
        2005 |   .0096635   .0062592     1.54   0.123      .003439    .0158881
        2006 |   .0095365    .006181     1.54   0.123     .0033898    .0156832
        2007 |   .0093861   .0061205     1.53   0.125     .0032996    .0154727
        2008 |   .0091951   .0060622     1.52   0.129     .0031665    .0152237
        2009 |   .0089313   .0059807     1.49   0.135     .0029837    .0148788
        2010 |   .0085042   .0058284     1.46   0.145     .0027081    .0143002
        2011 |   .0076962   .0056555     1.36   0.174      .002072    .0133204
        2012 |   .0065041   .0055311     1.18   0.240     .0010036    .0120045
        2013 |   .0052041   .0049019     1.06   0.288     .0003294    .0100789
        2014 |   .0043175   .0046085     0.94   0.349    -.0002654    .0089005
        2015 |   .0042376   .0035434     1.20   0.232     .0007139    .0077614
        2016 |   .0050576   .0031434     1.61   0.108     .0019317    .0081836
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     5
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs = 100
                                                           Replications  = 100

                                  (Replications based on 5 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |   .0391607   .0156973     2.49   0.013     .0235504    .0547709
        1998 |   .0410996    .013704     3.00   0.003     .0274716    .0547277
        1999 |   .0422718   .0116678     3.62   0.000     .0306687    .0538749
        2000 |   .0428859   .0097324     4.41   0.000     .0332074    .0525644
        2001 |   .0431614   .0079703     5.42   0.000     .0352352    .0510875
        2002 |   .0432389   .0063249     6.84   0.000     .0369491    .0495287
        2003 |   .0432492    .004752     9.10   0.000     .0385235    .0479748
        2004 |   .0432347   .0032712    13.22   0.000     .0399815    .0464878
        2005 |   .0431812   .0020041    21.55   0.000     .0411883    .0451742
        2006 |   .0430928   .0015941    27.03   0.000     .0415076     .044678
        2007 |   .0429689   .0025396    16.92   0.000     .0404433    .0454945
        2008 |    .042806   .0040131    10.67   0.000     .0388152    .0467968
        2009 |   .0426001   .0056819     7.50   0.000     .0369497    .0482505
        2010 |   .0423668   .0075603     5.60   0.000     .0348484    .0498852
        2011 |   .0421965   .0097114     4.35   0.000      .032539    .0518541
        2012 |    .042453    .011721     3.62   0.000      .030797     .054109
        2013 |   .0435235   .0131392     3.31   0.001     .0304572    .0565898
        2014 |   .0451105   .0141929     3.18   0.001     .0309963    .0592247
        2015 |   .0473329   .0147812     3.20   0.001     .0326336    .0620322
        2016 |   .0505268    .013266     3.81   0.000     .0373343    .0637193
------------------------------------------------------------------------------

. describe coefse_*

Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------------------
coefse_1        double  %10.0g                Coefficient 1, original
coefse_2        double  %10.0g                Coefficient 2, original
coefse_3        double  %10.0g                Coefficient 3, original
coefse_4        double  %10.0g                Coefficient 4, original
coefse_5        double  %10.0g                Coefficient 5, original
coefse_b_1      double  %10.0g                Coefficient-Vector 1, observed
coefse_se_1     double  %10.0g                Std. Err. 1, bootstrapped
coefse_cill_1   double  %10.0g                Lower bound confid. inter. 1, NB
coefse_ciul_1   double  %10.0g                Upper bound confid. inter. 1, NB
coefse_b_2      double  %10.0g                Coefficient-Vector 2, observed
coefse_se_2     double  %10.0g                Std. Err. 2, bootstrapped
coefse_cill_2   double  %10.0g                Lower bound confid. inter. 2, NB
coefse_ciul_2   double  %10.0g                Upper bound confid. inter. 2, NB
coefse_b_3      double  %10.0g                Coefficient-Vector 3, observed
coefse_se_3     double  %10.0g                Std. Err. 3, bootstrapped
coefse_cill_3   double  %10.0g                Lower bound confid. inter. 3, NB
coefse_ciul_3   double  %10.0g                Upper bound confid. inter. 3, NB
coefse_b_4      double  %10.0g                Coefficient-Vector 4, observed
coefse_se_4     double  %10.0g                Std. Err. 4, bootstrapped
coefse_cill_4   double  %10.0g                Lower bound confid. inter. 4, NB
coefse_ciul_4   double  %10.0g                Upper bound confid. inter. 4, NB
coefse_b_5      double  %10.0g                Coefficient-Vector 5, observed
coefse_se_5     double  %10.0g                Std. Err. 5, bootstrapped
coefse_cill_5   double  %10.0g                Lower bound confid. inter. 5, NB
coefse_ciul_5   double  %10.0g                Upper bound confid. inter. 5, NB
coefse_tvprime  float   %9.0g                 Year

. 
. 
. // S
. xtnptimevar lco2_c lgdp_c lgdp_c2 fossil_fuel_prod_c techonology_c if Year<2017 & Region=
> ="S", stub(coefsw) bwidth(1) alle bootstrap bootoptions(reps(100) seed(28845080) level(68
> )) matsize(800) forcereg title(trend function, lgdp, lgdp2, ff, tech) saving("/Users/yueh
> enghu/Desktop/RP/Stata_RP/mystatagraphs")

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     1
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)
(file coefsw_bootds.dta not found)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  60
                                                           Replications  = 100

                                  (Replications based on 3 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |  -4.758388   10.14075    -0.47   0.639    -14.84294    5.326163
        1998 |  -5.124516   8.821875    -0.58   0.561     -13.8975    3.648468
        1999 |  -5.433862    7.92629    -0.69   0.493    -13.31622      2.4485
        2000 |  -5.715681   7.228515    -0.79   0.429    -12.90414    1.472773
        2001 |  -5.981407   6.649559    -0.90   0.368    -12.59411    .6312987
        2002 |   -6.23678   6.150399    -1.01   0.311    -12.35309   -.1204674
        2003 |  -6.485166   5.708434    -1.14   0.256    -12.16196   -.8083688
        2004 |  -6.728786   5.309516    -1.27   0.205    -12.00888   -1.448696
        2005 |  -6.969265   4.944596    -1.41   0.159    -11.88646   -2.052072
        2006 |  -7.207928    4.60819    -1.56   0.118    -11.79058   -2.625277
        2007 |  -7.445998   4.297761    -1.73   0.083    -11.71994   -3.172056
        2008 |  -7.684751   4.013681    -1.91   0.056    -11.67619   -3.693315
        2009 |  -7.925699   3.759681    -2.11   0.035    -11.66454   -4.186854
        2010 |   -8.17083   3.543744    -2.31   0.021    -11.69493   -4.646725
        2011 |  -8.423015   3.379319    -2.49   0.013     -11.7836   -5.062424
        2012 |   -8.68674   3.286402    -2.64   0.008    -11.95493   -5.418551
        2013 |  -8.969593   3.291609    -2.72   0.006    -12.24296   -5.696226
        2014 |  -9.285634   3.426418    -2.71   0.007    -12.69306   -5.878206
        2015 |  -9.664233   3.725047    -2.59   0.009    -13.36864   -5.959831
        2016 |   -10.1791   4.230895    -2.41   0.016    -14.38655   -5.971655
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     2
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  60
                                                           Replications  = 100

                                  (Replications based on 3 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |    1.70981   6.989942     0.24   0.807    -5.241393    8.661013
        1998 |   1.862499   5.877489     0.32   0.751    -3.982417    7.707414
        1999 |   1.980225   5.110768     0.39   0.698    -3.102218    7.062669
        2000 |   2.082653   4.509467     0.46   0.644    -2.401822    6.567128
        2001 |   2.177073    4.00922     0.54   0.587    -1.809927    6.164073
        2002 |    2.26696   3.577808     0.63   0.526    -1.291019    5.824939
        2003 |   2.354272   3.196416     0.74   0.461    -.8244289    5.532974
        2004 |   2.440273   2.853216     0.86   0.392    -.3971306    5.277677
        2005 |   2.525888   2.540659     0.99   0.320    -.0006904    5.052466
        2006 |   2.611888   2.254275     1.16   0.247     .3701064     4.85367
        2007 |   2.699006   1.992307     1.35   0.176     .7177408    4.680272
        2008 |   2.788026   1.755967     1.59   0.112      1.04179    4.534262
        2009 |   2.879882   1.550338     1.86   0.063     1.338136    4.421628
        2010 |   2.975789   1.385779     2.15   0.032      1.59769    4.353888
        2011 |   3.077454   1.278856     2.41   0.016     1.805685    4.349222
        2012 |   3.187449   1.249951     2.55   0.011     1.944426    4.430473
        2013 |   3.309962   1.315362     2.52   0.012     2.001889    4.618034
        2014 |   3.452461   1.480255     2.33   0.020     1.980409    4.924512
        2015 |   3.630022   1.743185     2.08   0.037     1.896499    5.363546
        2016 |   3.879407   2.113078     1.84   0.066      1.77804    5.980774
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     3
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  60
                                                           Replications  = 100

                                  (Replications based on 3 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |  -.0855265   1.024383    -0.08   0.933    -1.104233    .9331795
        1998 |  -.1090607   .8394632    -0.13   0.897    -.9438715    .7257501
        1999 |  -.1249918   .7136677    -0.18   0.861    -.8347043    .5847207
        2000 |  -.1375197   .6159498    -0.22   0.823    -.7500558    .4750164
        2001 |  -.1482341   .5353449    -0.28   0.782     -.680612    .3841438
        2002 |  -.1578956   .4664118    -0.34   0.735    -.6217225    .3059313
        2003 |  -.1669278   .4059961    -0.41   0.681    -.5706738    .2368182
        2004 |  -.1755961     .35213    -0.50   0.618    -.5257746    .1745823
        2005 |  -.1840855   .3035752    -0.61   0.544    -.4859783    .1178073
        2006 |  -.1925398   .2596308    -0.74   0.458    -.4507318    .0656521
        2007 |  -.2010848   .2200999    -0.91   0.361    -.4199649    .0177953
        2008 |  -.2098444    .185401    -1.13   0.258    -.3942178    -.025471
        2009 |  -.2189554   .1568411    -1.40   0.163    -.3749273   -.0629835
        2010 |  -.2285854   .1369356    -1.67   0.095     -.364762   -.0924087
        2011 |  -.2389582   .1290646    -1.85   0.064    -.3673074   -.1106089
        2012 |  -.2503989   .1354338    -1.85   0.064    -.3850821   -.1157157
        2013 |  -.2634206   .1551254    -1.70   0.089    -.4176862   -.1091549
        2014 |   -.278915   .1855277    -1.50   0.133    -.4634145   -.0944155
        2015 |  -.2986446    .225012    -1.33   0.184    -.5224095   -.0748796
        2016 |  -.3268343   .2748483    -1.19   0.234    -.6001593   -.0535092
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     4
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  60
                                                           Replications  = 100

                                  (Replications based on 3 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |   -.004627   .0126643    -0.37   0.715    -.0172211    .0079672
        1998 |  -.0095637   .0141416    -0.68   0.499     -.023627    .0044995
        1999 |  -.0137453   .0166329    -0.83   0.409     -.030286    .0027954
        2000 |  -.0174194    .019452    -0.90   0.371    -.0367636    .0019248
        2001 |  -.0207132   .0223355    -0.93   0.354    -.0429249    .0014984
        2002 |  -.0237013   .0251808    -0.94   0.347    -.0487426      .00134
        2003 |  -.0264294   .0279457    -0.95   0.344    -.0542202    .0013614
        2004 |  -.0289254   .0306102    -0.94   0.345     -.059366    .0015152
        2005 |  -.0312049    .033163    -0.94   0.347    -.0641841    .0017743
        2006 |  -.0332735   .0355942    -0.93   0.350    -.0686705    .0021234
        2007 |  -.0351287   .0378931    -0.93   0.354    -.0728118    .0025544
        2008 |  -.0367593   .0400457    -0.92   0.359    -.0765831    .0030645
        2009 |  -.0381447   .0420334    -0.91   0.364    -.0799451    .0036557
        2010 |  -.0392525   .0438304    -0.90   0.370    -.0828401     .004335
        2011 |  -.0400344   .0454014    -0.88   0.378    -.0851842    .0051153
        2012 |  -.0404178   .0466954    -0.87   0.387    -.0868544    .0060187
        2013 |  -.0402908   .0476362    -0.85   0.398    -.0876629    .0070814
        2014 |  -.0394706   .0481007    -0.82   0.412    -.0873047    .0083636
        2015 |  -.0376311   .0478623    -0.79   0.432    -.0852281    .0099659
        2016 |  -.0341076   .0463968    -0.74   0.462    -.0802472    .0120321
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     5
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  60
                                                           Replications  = 100

                                  (Replications based on 3 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |   .1278589   .0260787     4.90   0.000     .1019247    .1537931
        1998 |   .1429454   .0305728     4.68   0.000      .112542    .1733488
        1999 |   .1554916   .0366951     4.24   0.000     .1189999    .1919833
        2000 |   .1664088   .0434798     3.83   0.000       .12317    .2096476
        2001 |   .1761445   .0504455     3.49   0.000     .1259786    .2263105
        2002 |    .184953   .0573609     3.22   0.001       .12791    .2419961
        2003 |   .1929875   .0641068     3.01   0.003      .129236    .2567391
        2004 |   .2003408   .0706121     2.84   0.005       .13012    .2705615
        2005 |   .2070646    .076825     2.70   0.007     .1306654    .2834638
        2006 |   .2131803   .0826981     2.58   0.010     .1309405    .2954201
        2007 |   .2186832   .0881799     2.48   0.013      .130992    .3063744
        2008 |   .2235435    .093208     2.40   0.016      .130852    .3162349
        2009 |   .2277041   .0977025     2.33   0.020     .1305431    .3248651
        2010 |   .2310746   .1015568     2.28   0.023     .1300806    .3320686
        2011 |   .2335189   .1046245     2.23   0.026     .1294743    .3375635
        2012 |   .2348331   .1066964     2.20   0.028      .128728    .3409382
        2013 |   .2347027    .107459     2.18   0.029     .1278393    .3415661
        2014 |   .2326124   .1064064     2.19   0.029     .1267957    .3384291
        2015 |    .227632   .1026287     2.22   0.027      .125572    .3296919
        2016 |   .2178069   .0941692     2.31   0.021     .1241596    .3114542
------------------------------------------------------------------------------

. describe coefsw_*

Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------------------
coefsw_1        double  %10.0g                Coefficient 1, original
coefsw_2        double  %10.0g                Coefficient 2, original
coefsw_3        double  %10.0g                Coefficient 3, original
coefsw_4        double  %10.0g                Coefficient 4, original
coefsw_5        double  %10.0g                Coefficient 5, original
coefsw_b_1      double  %10.0g                Coefficient-Vector 1, observed
coefsw_se_1     double  %10.0g                Std. Err. 1, bootstrapped
coefsw_cill_1   double  %10.0g                Lower bound confid. inter. 1, NB
coefsw_ciul_1   double  %10.0g                Upper bound confid. inter. 1, NB
coefsw_b_2      double  %10.0g                Coefficient-Vector 2, observed
coefsw_se_2     double  %10.0g                Std. Err. 2, bootstrapped
coefsw_cill_2   double  %10.0g                Lower bound confid. inter. 2, NB
coefsw_ciul_2   double  %10.0g                Upper bound confid. inter. 2, NB
coefsw_b_3      double  %10.0g                Coefficient-Vector 3, observed
coefsw_se_3     double  %10.0g                Std. Err. 3, bootstrapped
coefsw_cill_3   double  %10.0g                Lower bound confid. inter. 3, NB
coefsw_ciul_3   double  %10.0g                Upper bound confid. inter. 3, NB
coefsw_b_4      double  %10.0g                Coefficient-Vector 4, observed
coefsw_se_4     double  %10.0g                Std. Err. 4, bootstrapped
coefsw_cill_4   double  %10.0g                Lower bound confid. inter. 4, NB
coefsw_ciul_4   double  %10.0g                Upper bound confid. inter. 4, NB
coefsw_b_5      double  %10.0g                Coefficient-Vector 5, observed
coefsw_se_5     double  %10.0g                Std. Err. 5, bootstrapped
coefsw_cill_5   double  %10.0g                Lower bound confid. inter. 5, NB
coefsw_ciul_5   double  %10.0g                Upper bound confid. inter. 5, NB
coefsw_tvprime  float   %9.0g                 Year

. 
. 
. // SW
. xtnptimevar lco2_c lgdp_c lgdp_c2 fossil_fuel_prod_c techonology_c if Year<2017 & Region=
> ="SW", stub(coefsw) bwidth(0.2728) alle bootstrap bootoptions(reps(100) seed(28845080) le
> vel(68)) matsize(800) forcereg title(trend function, lgdp, lgdp2, ff, tech) saving("/User
> s/yuehenghu/Desktop/RP/Stata_RP/mystatagraphs")

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     1
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)
(file coefsw_bootds.dta not found)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  80
                                                           Replications  = 100

                                  (Replications based on 4 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |   4.271255   3.459029     1.23   0.217     .8313964    7.711114
        1998 |   1.915769   2.518802     0.76   0.447    -.5890731    4.420612
        1999 |   .9346001   2.373438     0.39   0.694    -1.425684    3.294884
        2000 |   .0176845   1.861463     0.01   0.992    -1.833462    1.868831
        2001 |  -.3687014   2.336259    -0.16   0.875    -2.692013     1.95461
        2002 |  -.6706212   1.851401    -0.36   0.717    -2.511761    1.170519
        2003 |  -1.304477   1.315068    -0.99   0.321    -2.612256    .0033032
        2004 |  -2.473636   .8429058    -2.93   0.003     -3.31187   -1.635402
        2005 |  -2.715425   1.197844    -2.27   0.023    -3.906631   -1.524219
        2006 |  -3.279764   2.271751    -1.44   0.149    -5.538925   -1.020603
        2007 |  -4.457252   3.407352    -1.31   0.191     -7.84572   -1.068784
        2008 |  -6.400286   4.948987    -1.29   0.196    -11.32184   -1.478727
        2009 |  -7.811666   3.374599    -2.31   0.021    -11.16756   -4.455769
        2010 |  -10.10096   3.875043    -2.61   0.009    -13.95453   -6.247395
        2011 |  -13.71382   3.952577    -3.47   0.001    -17.64449   -9.783151
        2012 |  -17.10394   5.456459    -3.13   0.002    -22.53016   -11.67772
        2013 |  -16.24118   3.832771    -4.24   0.000    -20.05271   -12.42965
        2014 |  -11.41056   5.278162    -2.16   0.031    -16.65947   -6.161651
        2015 |  -.4846235   7.716636    -0.06   0.950    -8.158493    7.189246
        2016 |   16.93518   15.54972     1.09   0.276     1.471641    32.39872
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     2
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  80
                                                           Replications  = 100

                                  (Replications based on 4 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |  -4.942562   3.369829    -1.47   0.142    -8.293716   -1.591409
        1998 |  -2.804857   2.736634    -1.02   0.305    -5.526324   -.0833894
        1999 |  -1.817666    2.65958    -0.68   0.494    -4.462506    .8271745
        2000 |  -.9154835   1.846837    -0.50   0.620    -2.752085     .921118
        2001 |  -.5470252   1.898365    -0.29   0.773    -2.434869    1.340819
        2002 |  -.2751128   1.464405    -0.19   0.851    -1.731401    1.181176
        2003 |   .2467642   1.042567     0.24   0.813    -.7900252    1.283554
        2004 |   1.081048   .7362901     1.47   0.142     .3488389    1.813258
        2005 |   1.095962   1.010206     1.08   0.278     .0913548     2.10057
        2006 |   1.267101    1.67765     0.76   0.450    -.4012517    2.935453
        2007 |   1.780733   2.274034     0.78   0.434    -.4806985    4.042164
        2008 |   2.701794   3.254438     0.83   0.406     -.534608    5.938195
        2009 |    3.27394   2.245364     1.46   0.145     1.041019     5.50686
        2010 |   4.261869   1.617291     2.64   0.008     2.653541    5.870197
        2011 |   5.845482   1.625374     3.60   0.000     4.229116    7.461849
        2012 |   7.205822   2.522468     2.86   0.004     4.697334     9.71431
        2013 |   6.579521   1.838954     3.58   0.000     4.750759    8.408283
        2014 |   4.245015    2.54088     1.67   0.095     1.718217    6.771814
        2015 |  -.6910647   3.688473    -0.19   0.851    -4.359096    2.976967
        2016 |  -8.390641    7.40722    -1.13   0.257    -15.75681   -1.024472
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     3
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  80
                                                           Replications  = 100

                                  (Replications based on 4 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |   1.520203   .9143844     1.66   0.096     .6108859     2.42952
        1998 |   .9676195   .7967594     1.21   0.225     .1752759    1.759963
        1999 |    .683319   .7724347     0.88   0.376    -.0848348    1.451473
        2000 |   .4312742   .4934071     0.87   0.382    -.0593984    .9219468
        2001 |   .3224627   .4246455     0.76   0.448    -.0998294    .7447547
        2002 |   .2458895   .3245693     0.76   0.449     -.076881    .5686599
        2003 |   .1249405   .2384853     0.52   0.600    -.1122231    .3621041
        2004 |  -.0368521   .1750775    -0.21   0.833    -.2109593    .1372552
        2005 |  -.0217774    .205481    -0.11   0.916    -.2261195    .1825648
        2006 |  -.0289639   .3024584    -0.10   0.924    -.3297461    .2718183
        2007 |  -.0891722   .3775214    -0.24   0.813    -.4646013    .2862569
        2008 |  -.2070454   .5281106    -0.39   0.695    -.7322291    .3181384
        2009 |   -.271235   .3635659    -0.75   0.456    -.6327859     .090316
        2010 |  -.3861955   .1846508    -2.09   0.036    -.5698229    -.202568
        2011 |  -.5679694   .1744749    -3.26   0.001    -.7414773   -.3944615
        2012 |  -.7088589   .2911918    -2.43   0.015    -.9984368   -.4192809
        2013 |  -.6174223   .2214595    -2.79   0.005    -.8376544   -.3971901
        2014 |  -.3423414   .3054911    -1.12   0.262    -.6461395   -.0385434
        2015 |   .2085325   .4369173     0.48   0.633    -.2259634    .6430283
        2016 |   1.049155    .874223     1.20   0.230     .1797767    1.918533
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     4
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  80
                                                           Replications  = 100

                                  (Replications based on 4 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |  -.0090431   .0074435    -1.21   0.224    -.0164454   -.0016408
        1998 |  -.0055456    .005334    -1.04   0.298      -.01085   -.0002412
        1999 |  -.0038913   .0040353    -0.96   0.335    -.0079043    .0001217
        2000 |  -.0026977   .0029574    -0.91   0.362    -.0056387    .0002432
        2001 |  -.0016225   .0021858    -0.74   0.458    -.0037961    .0005512
        2002 |   -.000759   .0016587    -0.46   0.647    -.0024085    .0008906
        2003 |   -.000334   .0023792    -0.14   0.888       -.0027    .0020321
        2004 |   .0000525    .002539     0.02   0.984    -.0024725    .0025774
        2005 |   .0022639   .0029957     0.76   0.450    -.0007151     .005243
        2006 |   .0049595   .0041564     1.19   0.233     .0008261    .0090929
        2007 |   .0077453    .004574     1.69   0.090     .0031967     .012294
        2008 |   .0102231   .0051179     2.00   0.046     .0051336    .0153126
        2009 |   .0128607   .0067527     1.90   0.057     .0061454     .019576
        2010 |   .0150803   .0070217     2.15   0.032     .0080975    .0220631
        2011 |   .0164524   .0086553     1.90   0.057     .0078451    .0250597
        2012 |   .0181432   .0099245     1.83   0.068     .0082738    .0280127
        2013 |   .0207728   .0088234     2.35   0.019     .0119983    .0295473
        2014 |   .0235818   .0102615     2.30   0.022     .0133772    .0337865
        2015 |   .0295203   .0182949     1.61   0.107     .0113267    .0477138
        2016 |   .0441537   .0275682     1.60   0.109     .0167383    .0715691
------------------------------------------------------------------------------

==============================================================================
Performing Non-Parametric Panel Data Estimations.
Bootstrapping Coefficient-Vector:     5
This may take some time, please wait.
==============================================================================

(running xtnptimevaravecb on estimation sample)

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                                          Number of obs =  80
                                                           Replications  = 100

                                  (Replications based on 4 clusters in Number)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
      lco2_c | coefficient  std. err.      z    P>|z|     [68% conf. interval]
-------------+----------------------------------------------------------------
        1997 |   .0049221   .0163685     0.30   0.764    -.0113557    .0211999
        1998 |   .0145526   .0143007     1.02   0.309     .0003311     .028774
        1999 |   .0192538   .0155873     1.24   0.217     .0037529    .0347547
        2000 |   .0238896   .0155983     1.53   0.126     .0083778    .0394014
        2001 |   .0269491   .0155577     1.73   0.083     .0114776    .0424206
        2002 |   .0294813   .0153203     1.92   0.054     .0142459    .0447167
        2003 |   .0329385   .0149802     2.20   0.028     .0180413    .0478356
        2004 |   .0380611   .0151596     2.51   0.012     .0229856    .0531367
        2005 |   .0406745   .0157861     2.58   0.010     .0249759    .0563731
        2006 |   .0448401    .016438     2.73   0.006     .0284932     .061187
        2007 |   .0508755   .0184896     2.75   0.006     .0324883    .0692626
        2008 |   .0588967   .0221901     2.65   0.008     .0368296    .0809638
        2009 |   .0669986   .0279193     2.40   0.016      .039234    .0947631
        2010 |   .0772532   .0370328     2.09   0.037     .0404257    .1140808
        2011 |   .0899056   .0410194     2.19   0.028     .0491135    .1306976
        2012 |   .1027385   .0397433     2.59   0.010     .0632155    .1422615
        2013 |   .1119472   .0458719     2.44   0.015     .0663296    .1575649
        2014 |   .1191008   .0505352     2.36   0.018     .0688457     .169356
        2015 |   .1255164    .056073     2.24   0.025     .0697541    .1812787
        2016 |   .1353902   .0587848     2.30   0.021     .0769311    .1938492
------------------------------------------------------------------------------

. describe coefsw_*

Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------------------
coefsw_1        double  %10.0g                Coefficient 1, original
coefsw_2        double  %10.0g                Coefficient 2, original
coefsw_3        double  %10.0g                Coefficient 3, original
coefsw_4        double  %10.0g                Coefficient 4, original
coefsw_5        double  %10.0g                Coefficient 5, original
coefsw_b_1      double  %10.0g                Coefficient-Vector 1, observed
coefsw_se_1     double  %10.0g                Std. Err. 1, bootstrapped
coefsw_cill_1   double  %10.0g                Lower bound confid. inter. 1, NB
coefsw_ciul_1   double  %10.0g                Upper bound confid. inter. 1, NB
coefsw_b_2      double  %10.0g                Coefficient-Vector 2, observed
coefsw_se_2     double  %10.0g                Std. Err. 2, bootstrapped
coefsw_cill_2   double  %10.0g                Lower bound confid. inter. 2, NB
coefsw_ciul_2   double  %10.0g                Upper bound confid. inter. 2, NB
coefsw_b_3      double  %10.0g                Coefficient-Vector 3, observed
coefsw_se_3     double  %10.0g                Std. Err. 3, bootstrapped
coefsw_cill_3   double  %10.0g                Lower bound confid. inter. 3, NB
coefsw_ciul_3   double  %10.0g                Upper bound confid. inter. 3, NB
coefsw_b_4      double  %10.0g                Coefficient-Vector 4, observed
coefsw_se_4     double  %10.0g                Std. Err. 4, bootstrapped
coefsw_cill_4   double  %10.0g                Lower bound confid. inter. 4, NB
coefsw_ciul_4   double  %10.0g                Upper bound confid. inter. 4, NB
coefsw_b_5      double  %10.0g                Coefficient-Vector 5, observed
coefsw_se_5     double  %10.0g                Std. Err. 5, bootstrapped
coefsw_cill_5   double  %10.0g                Lower bound confid. inter. 5, NB
coefsw_ciul_5   double  %10.0g                Upper bound confid. inter. 5, NB
coefsw_tvprime  float   %9.0g                 Year

. 
end of do-file

. log close
      name:  <unnamed>
       log:  /Users/yuehenghu/Desktop/RP/Stata_RP/time-varying coefficient.log
  log type:  text
 closed on:  21 Oct 2022, 08:17:56
-------------------------------------------------------------------------------------------
